Repository: dotnet/runtime
Catalog: src/libraries/System.Runtime.InteropServices/gen/LibraryImportGenerator/Resources/xlf/Strings.*.xlf
Languages: fr

source: Add missing custom type marshaller members
fr: Ajouter les membres du marshaleur de type personnalisé manquants

# AddMissingFeaturesToCustomTypeMarshaller
source: Add missing features to the 'CustomTypeMarshallerAttribute' attribute
fr: Ajouter les fonctionnalités manquantes à l’attribut « CustomTypeMarshallerAttribute »

# CallerAllocConstructorMustHaveBufferSizeDescription
source: When a constructor taking a 'Span<byte>' is specified on the native type, the type must set the BufferSize field on the 'System.Runtime.InteropServices.CustomTypeMarshallerAttribute' to provide the size of the caller-allocated buffer.
fr: Quand un constructeur prenant un «Span<byte>» est spécifié sur le type natif, le type doit définir le champ BufferSize sur «System.Runtime.InteropServices.CustomTypeMarshallerAttribute» pour fournir la taille de la mémoire tampon allouée par l’appelant.

# CallerAllocConstructorMustHaveBufferSizeMessage
source: The native type '{0}' must set the 'BufferSize' field on the applied 'System.Runtime.InteropServices.CustomTypeMarshallerAttribute' to specify the size of the caller-allocated buffer because it has a constructor that takes a caller-allocated 'Span<byte>'
fr: Le type natif «{0}» doit définir le champ «BufferSize» sur le «System.Runtime.InteropServices.CustomTypeMarshallerAttribute» appliqué pour spécifier la taille de la mémoire tampon allouée par l’appelant, car il a un constructeur qui accepte un «Span<byte>» alloué par l’appelant

# CallerAllocConstructorMustHaveBufferSizeTitle
source: 'BufferSize' should be set on 'CustomTypeMarshallerAttribute'
fr: « BufferSize » doit être défini sur « CustomTypeMarshallerAttribute »

# CallerAllocMarshallingShouldSupportAllocatingMarshallingFallbackDescription
source: A type that supports marshalling from managed to native using a caller-allocated buffer should also support marshalling from managed to native where using a caller-allocated buffer is impossible.
fr: Un type qui prend en charge le marshaling de managé à natif à l’aide d’une mémoire tampon allouée par l’appelant doit également prendre en charge le marshaling entre managé et natif, où l’utilisation d’un tampon alloué par l’appelant est impossible.

# CallerAllocMarshallingShouldSupportAllocatingMarshallingFallbackMessage
source: Native type '{0}' has a constructor taking a caller-allocated buffer, but does not support marshalling in scenarios where using a caller-allocated buffer is impossible
fr: Le type natif « {0} » a un constructeur qui prend une mémoire tampon allouée par l’appelant, mais ne prend pas en charge le marshaling dans les scénarios où l’utilisation d’un tampon alloué par l’appelant est impossible

# CallerAllocatedBufferConstructorProvidedShouldSpecifyFeatureDescription
source: A marshaller type that provides a constructor taking a caller-allocated 'Span<byte>' should specify that it supports the 'CallerAllocatedBuffer' feature.
fr: Un type de marshaleur qui fournit un constructeur prenant un «Span<byte>» alloué par l’appelant doit spécifier qu’il prend en charge la fonctionnalité «CallerAllocatedBuffer».

# CallerAllocatedBufferConstructorProvidedShouldSpecifyFeatureMessage
source: The type '{0}' provides a constructor taking a caller-allocated 'Span<byte>' but does not specify that it supports the 'CallerAllocatedBuffer' feature. The constructor will not be used unless the feature is specified.
fr: Le type «{0}» fournit un constructeur qui accepte un «Span<byte>» alloué par l’appelant, mais ne spécifie pas qu’il prend en charge la fonctionnalité «CallerAllocatedBuffer». Le constructeur ne sera pas utilisé tant que la fonctionnalité n’est pas spécifiée.

# CannotForwardToDllImportDescription
source: The generated 'DllImportAttribute' will not have a value corresponding to '{0}'.
fr: Le « DllImportAttribute » généré n’aura pas de valeur correspondant à « {0} ».

# CannotForwardToDllImportMessage
source: '{0}' has no equivalent in 'DllImportAtttribute' and will not be forwarded
fr: « {0} » n’a pas d’équivalent dans « DllImportAtttribute » et ne sera pas transféré

# CannotForwardToDllImportTitle
source: Specified 'LibraryImportAttribute' arguments cannot be forwarded to 'DllImportAttribute'
fr: Les arguments « LibraryImportAttribute » spécifiés ne peuvent pas être transférés à « DllImportAttribute »

# ConfigurationNotSupportedDescription
source: Source-generated P/Invokes will ignore any configuration that is not supported.
fr: Les P/Invokes générés par la source ignorent toute configuration qui n’est pas prise en charge.

# ConfigurationNotSupportedMessage
source: The '{0}' configuration is not supported by source-generated P/Invokes. If the specified configuration is required, use a regular `DllImport` instead.
fr: La configuration de « {0} » n’est pas prise en charge par les P/Invok générés par la source. Si la configuration spécifiée est requise, utilisez plutôt un « DllImport » normal.

# ConfigurationNotSupportedMessageMarshallingInfo
source: The specified marshalling configuration is not supported by source-generated P/Invokes. {0}.
fr: La configuration de marshaling spécifiée n’est pas prise en charge par les P/Invokes générés par la source. {0}.

# ConfigurationNotSupportedMessageParameter
source: The specified '{0}' configuration for parameter '{1}' is not supported by source-generated P/Invokes. If the specified configuration is required, use a regular `DllImport` instead.
fr: La configuration de « {0} » spécifiée pour le paramètre « {1} » n’est pas prise en charge par les P/Invok générés par la source. Si la configuration spécifiée est requise, utilisez plutôt un « DllImport » normal.

# ConfigurationNotSupportedMessageReturn
source: The specified '{0}' configuration for the return value of method '{1}' is not supported by source-generated P/Invokes. If the specified configuration is required, use a regular `DllImport` instead.
fr: La configuration de « {0} » spécifiée pour la valeur renvoyée de la méthode « {1} » n’est pas prise en charge par les P/Invok générés par la source. Si la configuration spécifiée est requise, utilisez plutôt un « DllImport » normal.

# ConfigurationNotSupportedMessageValue
source: The specified value '{0}' for '{1}' is not supported by source-generated P/Invokes. If the specified value is required, use a regular `DllImport` instead.
fr: La valeur de « {0} » spécifiée pour « {1} » n’est pas prise en charge par les P/Invok générés par la source. Si la valeur spécifiée est requise, utilisez plutôt un « DllImport » normal.

# ConfigurationNotSupportedTitle
source: Specified configuration is not supported by source-generated P/Invokes.
fr: La configuration spécifiée n’est pas prise en charge par les P/Invokes générés par la source.

# ConstantAndElementCountInfoDisallowed
source: Only one of 'ConstantElementCount' or 'ElementCountInfo' may be used in a 'MarshalUsingAttribute' for a given 'ElementIndirectionDepth'
fr: Un seul de « ConstantElementCount » ou « ElementCountInfo » peut être utilisé dans un « MarshalUsingAttribute » pour un « ElementIndirectionDepth » donné

# ConvertNoPreserveSigDllImportToGeneratedMayProduceInvalidCode
source: Automatically converting a P/Invoke with 'PreserveSig' set to 'false' to a source-generated P/Invoke may produce invalid code
fr: La conversion automatique d’un P/Invoke avec « PreserveSig » défini sur « false » en P/Invoke généré par la source peut produire du code non valide

source: Convert to 'LibraryImport'
fr: Convertir en « LibraryImport »

# ConvertToLibraryImportDescription
source: Use 'LibraryImportAttribute' instead of 'DllImportAttribute' to generate P/Invoke marshalling code at compile time
fr: Utilisez « LibraryImportAttribute » à la place de « DllImportAttribute » pour générer du code de marshaling P/Invoke au moment de la compilation

# ConvertToLibraryImportMessage
source: Mark the method '{0}' with 'LibraryImportAttribute' instead of 'DllImportAttribute' to generate P/Invoke marshalling code at compile time
fr: Marquer la méthode « {0} » avec « LibraryImportAttribute » à la place de « DllImportAttribute » pour générer du code de marshaling P/Invoke au moment de la compilation

# ConvertToLibraryImportTitle
source: Use 'LibraryImportAttribute' instead of 'DllImportAttribute' to generate P/Invoke marshalling code at compile time
fr: Utilisez « LibraryImportAttribute » à la place de « DllImportAttribute » pour générer du code de marshaling P/Invoke au moment de la compilation

# ConvertToLibraryImportWarning
source: Conversion to 'LibraryImport' may change behavior and compatibility. See {0} for more information.
fr: La conversion en « LibraryImport » peut modifier le comportement et la compatibilité. Pour plus d’informations, consultez {0}.

# ConvertToLibraryImportWithSuffix
source: Convert to 'LibraryImport' with '{0}' suffix
fr: Convertir en « LibraryImport » avec suffixe « {0} »

# CustomMarshallerTypeMustHaveRequiredShapeTitle
source: Marshaller type does not have the required shape
fr: Le type Marshaller n’a pas la forme requise

# CustomMarshallerTypeMustSupportDirectionDescription
source: A native must set the 'Direction' property on the 'CustomTypeMarshallerAttribute' to a value that sets at least one known flag value on the 'CustomTypeMarshallerDirection' enum
fr: Un natif doit définir la propriété « Direction » de « CustomTypeMarshallerAttribute » sur une valeur qui définit au moins une valeur d’indicateur connue sur l’énumération « CustomTypeMarshallerDirection »

# CustomMarshallerTypeMustSupportDirectionMessage
source: The native type '{0}' must set the 'Direction' property on the 'CustomTypeMarshallerAttribute' to a value that sets at least one known flag value on the 'CustomTypeMarshallerDirection' enum
fr: Le type natif « {0} » doit définir la propriété « Direction » de « CustomTypeMarshallerAttribute » sur une valeur qui définit au moins une valeur d’indicateur connue sur l’énumération « CustomTypeMarshallerDirection »

# CustomTypeMarshallerAttributeMustBeValidDescription
source: The 'CustomTypeMarshallerAttribute' attribute must be semantically valid
fr: L’attribut « CustomTypeMarstribuerAttribute » doit être sémantiquement valide

# CustomTypeMarshallerAttributeMustBeValidMessage
source: The 'CustomTypeMarshallerAttribute' on '{0}' is semantically invalid
fr: CustomTypeMarstribuerAttribute sur « {0} » n’est pas valide sémantiquement

# CustomTypeMarshallingManagedToNativeUnsupported
source: The specified parameter needs to be marshalled from managed to native, but the native type '{0}' does not support it.
fr: Le paramètre spécifié doit être marshalé de managé à natif, mais le type natif « {0} » ne le prend pas en charge.

# CustomTypeMarshallingNativeToManagedUnsupported
source: The specified parameter needs to be marshalled from native to managed, but the native type '{0}' does not support it.
fr: Le paramètre spécifié doit être marshalé de natif à managé, mais le type natif « {0} » ne le prend pas en charge.

# FreeNativeMethodProvidedShouldSpecifyUnmanagedResourcesFeatureDescription
source: A marshaller type that provides a 'FreeNative' method should specify that it supports the 'UnmanagedResources' feature.
fr: Un type marshaleur qui fournit une méthode « FreeNative » doit spécifier qu’il prend en charge la fonctionnalité « UnmanagedResources ».

# FreeNativeMethodProvidedShouldSpecifyUnmanagedResourcesFeatureMessage
source: The type '{0}' provides a 'FreeNative' method but does not specify that it supports the 'UnmanagedResources' feature. The method will not be used unless the feature is specified.
fr: Le type « {0} » fournit une méthode « FreeNative », mais ne spécifie pas qu’il prend en charge la fonctionnalité « UnmanagedResources ». La méthode ne sera pas utilisée, sauf si la fonctionnalité est spécifiée.

# FromNativeValueMethodProvidedShouldSpecifyTwoStageMarshallingFeatureDescription
source: A marshaller type that provides a 'FromNativeValue' method should specify that it supports the 'TwoStageMarshalling' feature.
fr: Un type marshaleur qui fournit une méthode « FromNativeValue » doit spécifier qu’il prend en charge la fonctionnalité « TwoStageMarsoboing ».

# FromNativeValueMethodProvidedShouldSpecifyTwoStageMarshallingFeatureMessage
source: The type '{0}' provides a 'FromNativeValue' method but does not specify that it supports the 'TwoStageMarshalling' feature. The method will not be used unless the feature is specified.
fr: Le type « {0} » fournit une méthode « FromNativeValue », mais ne spécifie pas qu’il prend en charge la fonctionnalité « TwoStageMarshalling ». La méthode ne sera pas utilisée tant que la fonctionnalité n’est pas spécifiée.

# GetPinnableReferenceReturnTypeBlittableDescription
source: The return type of 'GetPinnableReference' (after accounting for 'ref') must be blittable.
fr: Le type de retour de « GetPinnableReference » (après la gestion des comptes pour « ref ») doit être blittable.

# GetPinnableReferenceReturnTypeBlittableMessage
source: The dereferenced type of the return type of the 'GetPinnableReference' method must be blittable
fr: Le type déréférencé du type de retour de la méthode GetPinnableReference doit être blittable

# GetPinnableReferenceShouldSupportAllocatingMarshallingFallbackDescription
source: A type that supports marshalling from managed to native by pinning should also support marshalling from managed to native where pinning is impossible.
fr: Un type qui prend en charge le marshaling de managé en natif par épinglage doit également prendre en charge le marshaling de managé à natif où l’épinglage est impossible.

# GetPinnableReferenceShouldSupportAllocatingMarshallingFallbackMessage
source: Type '{0}' has a 'GetPinnableReference' method but its native type does not support marshalling in scenarios where pinning is impossible
fr: Le type « {0} » a une méthode « GetPinnableReference », mais son type natif ne prend pas en charge le marshaling dans les scénarios où l’épinglage est impossible

# InTwoStageMarshallingRequiresToNativeValueDescription
source: The 'TwoStageMarshalling' feature requires a 'TNativeType ToNativeValue()' method for the 'In' direction.
fr: La fonctionnalité « TwoStageMarshalling » nécessite une méthode « TNativeType ToNativeValue() » pour la direction « In ».

# InTwoStageMarshallingRequiresToNativeValueMessage
source: A marshaller type '{0}' that supports marshalling in the 'In' direction with the 'TwoStageMarshalling' feature must provide a 'ToNativeValue' instance method that returns the native value
fr: Un type de marshaleur « {0} » prend en charge le marshaling dans le sens « In » avec la fonctionnalité « TwoStageMarshalling » doit fournir une méthode d’instance « ToNativeValue » qui retourne la valeur native

# InvalidAttributedMethodContainingTypeMissingModifiersMessage
source: Method '{0}' is contained in a type '{1}' that is not marked 'partial'. P/Invoke source generation will ignore method '{0}'.
fr: La méthode « {0} » est contenue dans un type « {1} » qui n’est pas marqué comme étant « partial ». La génération source P/Invoke ignore la méthode « {0} ».

# InvalidAttributedMethodDescription
source: Methods marked with 'LibraryImportAttribute' should be 'static', 'partial', and non-generic. P/Invoke source generation will ignore methods that are non-'static', non-'partial', or generic.
fr: Les méthodes marquées avec « LibraryImportAttribute » doivent être « static », « partial » et non génériques. La génération de source P/Invoke ignore les méthodes qui ne sont pas statiques, non partielles ou génériques.

# InvalidAttributedMethodSignatureMessage
source: Method '{0}' should be 'static', 'partial', and non-generic when marked with 'LibraryImportAttribute'. P/Invoke source generation will ignore method '{0}'.
fr: La méthode « {0} » doit être « static », « partial » et non générique quand elle est marquée avec « LibraryImportAttribute ». La génération source P/Invoke ignore la méthode « {0} ».

# InvalidCustomTypeMarshallerAttributeUsageTitle
source: Invalid `CustomTypeMarshallerAttribute` usage
fr: Utilisation de « CustomTypeMarshallerAttribute » non valide

# InvalidLibraryImportAttributeUsageTitle
source: Invalid 'LibraryImportAttribute' usage
fr: Utilisation de « LibraryImportAttribute » non valide

# InvalidNativeTypeTitle
source: Specified native type is invalid
fr: Le type natif spécifié est non valide

# InvalidSignaturesInMarshallerShapeTitle
source: Marshaller type has incompatible method signatures
fr: Le type Marshaller a des signatures de méthode incompatibles

# InvalidStringMarshallingConfigurationDescription
source: The configuration of 'StringMarshalling' and 'StringMarshallingCustomType' is invalid.
fr: La configuration de « StringMarshalling » et de « StringMarshallingCustomType » n’est pas valide.

# InvalidStringMarshallingConfigurationMessage
source: The configuration of 'StringMarshalling' and 'StringMarshallingCustomType' on method '{0}' is invalid. {1}
fr: La configuration de « StringMarshalling » et de « StringMarshallingCustomType » n’est sur la méthode « {0} » pas valide. {1}

# InvalidStringMarshallingConfigurationMissingCustomType
source: 'StringMarshallingCustomType' must be specified when 'StringMarshalling' is set to 'StringMarshalling.Custom'.
fr: « StringMarshallingCustomType » doit être spécifié quand « StringMarshalling » a la valeur « StringMarshalling.Custom ».

# InvalidStringMarshallingConfigurationNotCustom
source: 'StringMarshalling' should be set to 'StringMarshalling.Custom' when 'StringMarshallingCustomType' is specified.
fr: « StringMarshalling » doit être défini sur « StringMarshalling.Custom » quand « StringMarshallingCustomType » est spécifié.

# LinearCollectionElementTypesMustMatchDescription
source: The element type of the 'ReadOnlySpan' returned by 'GetManagedValuesSource' must be the same as the element type returned by 'GetManagedValuesDestination'.
fr: Le type d’élément de « ReadOnlySpan » retourné par « GetManagedValuesSource » doit être identique au type d’élément retourné par « GetManagedValuesDestination ».

# LinearCollectionElementTypesMustMatchMessage
source: The element type of the 'ReadOnlySpan' returned by 'GetManagedValuesSource' must be the same as the element type returned by 'GetManagedValuesDestination'
fr: Le type d’élément de « ReadOnlySpan » retourné par « GetManagedValuesSource » doit être identique au type d’élément retourné par « GetManagedValuesDestination »

# LinearCollectionInCallerAllocatedBufferRequiresSpanConstructorDescription
source: A 'LinearCollection'-kind native type that supports the 'CallerAllocatedBuffer' feature must provide a three-parameter constructor taking the managed type as the first parameter, a 'Span<byte>' as the second parameter, and the native size of the element as the third parameter
fr: Un type natif de type «LinearCollection» qui prend en charge la fonctionnalité «CallerAllocatedBuffer» doit fournir un constructeur à trois paramètres prenant le type managé comme premier paramètre, un «Span<byte>» comme deuxième paramètre et la taille native de l’élément comme troisième paramètre

# LinearCollectionInCallerAllocatedBufferRequiresSpanConstructorMessage
source: The type '{0}' specifies that it supports 'In' marshalling with the 'CallerAllocatedBuffer' feature for '{1}' but does not provide a three-parameter constructor that takes a '{1}' , a 'Span<byte>', and an 'int'
fr: Le type «{0}» spécifie qu’il prend en charge le marshaling «In» avec la fonctionnalité «CallerAllocatedBuffer» pour «{1}» mais ne fournit pas de constructeur à trois paramètres qui accepte un «{1}», un «Span<byte>» et un «int»

# LinearCollectionInRequiresCollectionMethodsDescription
source: A 'LinearCollection'-kind native type that supports marshalling in the 'In' direction must provide a 'GetManagedValuesSource' that returns a 'ReadOnlySpan<>' and a 'GetNativeValuesDestination' method that returns a 'Span<byte>'.
fr: Un type natif de type «LinearCollection» qui prend en charge le marshaling dans la direction «In» doit fournir un «GetManagedValuesSource» qui retourne un «ReadOnlySpan<>» et une méthode «GetNativeValuesDestination» qui retourne un «Span<byte>».

# LinearCollectionInRequiresCollectionMethodsMessage
source: The type '{0}' specifies that is supports marshalling in the 'In' direction, but it does not provide a 'GetManagedValuesSource' that returns a 'ReadOnlySpan<>' and a 'GetNativeValuesDestination' method that returns a 'Span<byte>'
fr: Le type «{0}» spécifie qui prend en charge le marshaling dans le sens «In», mais il ne fournit pas de «GetManagedValuesSource» qui retourne un «ReadOnlySpan<>» et une méthode «GetNativeValuesDestination» qui retourne un «Span<byte>»

# LinearCollectionInRequiresTwoParameterConstructorDescription
source: A 'LinearCollection'-kind native type must provide a two-parameter constructor taking the managed type as the first parameter and the native size of the element as the second parameter
fr: Un type natif de type « LinearCollection » doit fournir un constructeur à deux paramètres prenant le type managé comme premier paramètre et la taille native de l’élément comme deuxième paramètre

# LinearCollectionInRequiresTwoParameterConstructorMessage
source: The type '{0}' specifies that it supports 'In' marshalling of '{1}' but does not provide a two-parameter constructor that takes a '{1}' as the first parameter and an 'int' as the second parameter
fr: Le type « {0} » spécifie qu’il prend en charge le marshaling « In » de « {1} » mais ne fournit pas de constructeur à deux paramètres qui accepte un « {1} » comme premier paramètre et un « int » comme second paramètre

# LinearCollectionOutRequiresCollectionMethodsDescription
source: A 'LinearCollection'-kind native type that supports marshalling in the 'Out' direction must provide a 'GetManagedValuesDestination' that takes an 'int' and returns a 'Span<>' and a 'GetNativeValuesSource' method that takes an 'int' and rreturns a 'ReadOnlySpan<byte>'.
fr: Un type natif de type «LinearCollection» qui prend en charge le marshaling dans la direction «Out» doit fournir un «GetManagedValuesDestination» qui prend un «int» et retourne «Span<>» et une méthode «GetNativeValuesSource» qui prend un «int» et retourne un «ReadOnlySpan<byte>».

# LinearCollectionOutRequiresCollectionMethodsMessage
source: The type '{0}' specifies that it supports marshalling in the 'Out' direction, but it does not provide a 'GetManagedValuesDestination' that takes an 'int' and returns a 'Span<>' and a 'GetNativeValuesSource' method that takes an 'int' and rreturns a 'ReadOnlySpan<byte>'
fr: Le type «{0}» spécifie qu’il prend en charge le marshaling dans la direction «Out», mais il ne fournit pas de «GetManagedValuesDestination» qui accepte «int» et retourne un «Span<>» et une méthode «GetNativeValuesSource» qui accepte «int» et renvoie un «ReadOnlySpan<byte>»

# LinearCollectionOutRequiresIntConstructorDescription
source: A 'LinearCollection'-kind native type that supports marshalling in the 'Out' direction must provide a constructor that takes the size of the native element as an 'int'.
fr: Un type natif de type « LinearCollection » qui prend en charge le marshaling dans la direction « Out » doit fournir un constructeur qui accepte la taille de l’élément natif en tant que « int ».

# LinearCollectionOutRequiresIntConstructorMessage
source: The type '{0}' specifies that it supports marshalling in the 'Out' direction, but it does not provide a constructor that takes the size of the native element as an 'int'.
fr: Le type « {0} » spécifie qu’il prend en charge le marshaling dans la direction « Out », mais il ne fournit pas de constructeur qui prend la taille de l’élément natif comme « int ».
