Repository: dotnet/runtime
Catalog: src/libraries/System.Runtime.InteropServices/gen/LibraryImportGenerator/Resources/xlf/Strings.*.xlf
Languages: fr

# MarshallerDirectionMustBeValidDescription
source: The specified marshaller direction must be a valid value of the 'System.Runtime.InteropServices.CustomMarshallerDirection' enum.
fr: La direction de marshaleur spécifié doit être une valeur valide de l’énumération « System.Runtime.InteropServices.CustomMarshallerDirection ».

# MarshallerDirectionMustBeValidMessage
source: The specified custom marshaller direction for '{0}' is invalid
fr: La direction du marshaleur personnalisé spécifiée pour « {0} » n’est pas valide

# MarshallerGetPinnableReferenceRequiresTwoStageMarshallingDescription
source: The use cases for 'GetPinnableReference' are not applicable in any scenarios where 'TwoStageMarshalling' is not also required.
fr: Les cas d’utilisation de « GetPinnableReference » ne sont applicables dans aucun scénario où « TwoStageMarspinging » n’est pas nécessaire.

# MarshallerGetPinnableReferenceRequiresTwoStageMarshallingMessage
source: The 'GetPinnableReference' method cannot be provided on the native type '{0}' unless the 'TwoStageMarshalling' feature is also supported
fr: La méthode « GetPinnableReference » ne peut pas être fournie sur le type natif « {0} » sauf si la fonctionnalité « TwoStageMarshalling » est également prise en charge

# MarshallerKindMustBeValidDescription
source: The specified marshaller kind must be a valid value of the 'System.Runtime.InteropServices.CustomMarshallerKind' enum.
fr: Le genre de marshaleur spécifié doit être une valeur valide de l’énumération « System.Runtime.InteropServices.CustomMarshallerKind ».

# MarshallerKindMustBeValidMessage
source: The specified custom marshaller kind for '{0}' is invalid
fr: Le genre de marshaleur personnalisé spécifiée pour « {0} » n’est pas valide

# MarshallerTypeMustSpecifyManagedTypeDescription
source: A type with a 'System.Runtime.InteropServices.CustomTypeMarshallerAttribute' must specify a managed type
fr: Un type avec un « System.Runtime.InteropServices.CustomTypeMarspiaerAttribute » doit spécifier un type managé

# MarshallerTypeMustSpecifyManagedTypeMessage
source: The type '{0}' does not specify a managed type in the 'System.Runtime.InteropServices.CustomTypeMarshallerAttribute' applied to the type
fr: Le type « {0} » ne spécifie pas de type managé dans « System.Runtime.InteropServices.CustomTypeMarshallerAttribute » appliqué au type

# MissingAllocatingMarshallingFallbackTitle
source: Marshaller type does not support allocating constructor
fr: Le type Marshaller ne prend pas en charge le constructeur d’allocation

# NativeGenericTypeMustBeClosedOrMatchArityDescription
source: The native type '{0}' must be a closed generic or have the same number of generic parameters as the managed type so the emitted code can use a specific instantiation.
fr: Le type natif « {0} » doit être un générique fermé ou avoir le même nombre de paramètres génériques que le type managé pour que le code émis puisse utiliser une instanciation spécifique.

# NativeGenericTypeMustBeClosedOrMatchArityMessage
source: The native type '{0}' for managed type '{1}' must be a closed generic type or have the same arity as the managed type.
fr: Le type natif « {0} » pour le type managé « {1} » doit être un type générique fermé ou avoir la même arité que le type managé.

# NativeTypeMustBeBlittableDescription
source: A native type must be blittable.
fr: Un type natif doit être blittable.

# NativeTypeMustBeBlittableMessage
source: The native type '{0}' for type '{1}' must be blittable
fr: Le type natif « {0} » pour le type « {1} » doit être blittable

# NativeTypeMustBePointerSizedDescription
source: The native type must be pointer sized so the pinned result of 'GetPinnableReference' can be cast to the native type.
fr: Le type natif doit être de taille de pointeur pour que le résultat épinglé de « GetPinnableReference » puisse être converti en type natif.

# NativeTypeMustBePointerSizedMessage
source: The native type '{0}' must be pointer sized because the managed type '{1}' has a 'GetPinnableReference' method
fr: Le type natif « {0} » doit être dimensionné par un pointeur, car le type managé « {1} » a une méthode « GetPinnableReference »

# NativeTypeMustHaveCustomTypeMarshallerAttributeDescription
source: A native type for a given type must have the 'System.Runtime.InteropServices.CustomTypeMarshallerAttribute' that specifies this type as the managed type.
fr: Un type natif pour un type donné doit avoir « System.Runtime.InteropServices.CustomTypeMarstribute » qui spécifie ce type en tant que type managé.

# NativeTypeMustHaveCustomTypeMarshallerAttributeMessage
source: The native type for the type '{0}' must be a type with the 'System.Runtime.InteropServices.CustomTypeMarshallerAttribute' that specifies this type as the managed type
fr: Le type natif du type « {0} » doit être un type avec « System.Runtime.InteropServices.CustomTypeMarshallerAttribute » qui spécifie ce type en tant que type managé

# OutRequiresToManagedDescription
source: A 'Value' or 'LinearCollection'-kind native type that supports marshalling in the 'Out' direction must provide a 'ToManaged' method that returns the managed type.
fr: Un type natif de type « Value » ou « LinearCollection » qui prend en charge le marshaling dans la direction « Out » doit fournir une méthode « ToManaged » qui retourne le type managé.

# OutRequiresToManagedMessage
source: The type '{0}' specifies it supports marshalling in the 'Out' direction, but it does not provide a 'ToManaged' method that returns the managed type
fr: Le type « {0} » spécifie qu’il prend en charge le marshaling dans la direction « Out », mais il ne fournit pas de méthode « ToManaged » qui retourne le type managé

# OutTwoStageMarshallingRequiresFromNativeValueDescription
source: The 'TwoStageMarshalling' feature requires a 'void FromNativeValue(TNativeType value)' method for the 'Out' direction.
fr: La fonctionnalité « TwoStageMarsimaing » nécessite une méthode « void FromNativeValue(valeur TNativeType) » pour la direction « Out ».

# OutTwoStageMarshallingRequiresFromNativeValueMessage
source: The marshaller type '{0}' supports marshalling in the 'Out' direction with the 'TwoStageMarshalling' feature, but it does not provide a 'FromNativeValue' instance method that returns 'void' and takes one parameter.
fr: Le type de marshaleur « {0} » prend en charge le marshaling dans la direction « Out » avec la fonctionnalité « TwoStageMarshalling », mais il ne fournit pas de méthode d’instance « FromNativeValue » qui retourne « void » et accepte un paramètre.

# ProvidedMethodsNotSpecifiedInFeaturesTitle
source: Marshaller type defines a well-known method without specifying support for the corresponding feature
fr: Le type Marshaler définit une méthode connue sans spécifier la prise en charge de la fonctionnalité correspondante

# RefNativeValueUnsupportedDescription
source: The 'Value' property must not be a 'ref' or 'readonly ref' property.
fr: La propriété « Value » ne doit pas être une propriété « ref » ou « readonly ref ».

# RefNativeValueUnsupportedMessage
source: The 'Value' property on the native type '{0}' must not be a 'ref' or 'readonly ref' property.
fr: La propriété « Value » sur le type natif {0}« » ne doit pas être une propriété « ref » ou « readonly ref ».

# SafeHandleByRefMustBeConcrete
source: An abstract type derived from 'SafeHandle' cannot be marshalled by reference. The provided type must be concrete.
fr: Un type abstrait dérivé de « SafeHandle » ne peut pas être marshalé par référence. Le type fourni doit être concret.

# ToNativeValueMethodProvidedShouldSpecifyTwoStageMarshallingFeatureDescription
source: A marshaller type that provides a 'ToNativeValue' method should specify that it supports the 'TwoStageMarshalling' feature.
fr: Un type marshaleur qui fournit une méthode « ToNativeValue » doit spécifier qu’il prend en charge la fonctionnalité « TwoStageMarsoboing ».

# ToNativeValueMethodProvidedShouldSpecifyTwoStageMarshallingFeatureMessage
source: The type '{0}' provides a 'ToNativeValue' method but does not specify that it supports the 'TwoStageMarshalling' feature. The method will not be used unless the feature is specified.
fr: Le type « {0} » fournit une méthode « ToNativeValue », mais ne spécifie pas qu’il prend en charge la fonctionnalité « TwoStageMarshalling ». La méthode ne sera pas utilisée tant que la fonctionnalité n’est pas spécifiée.

# TwoStageMarshallingNativeTypesMustMatchDescription
source: The return type of 'ToNativeValue' and the parameter type of 'FromNativeValue' must be the same.
fr: Le type de retour de « ToNativeValue » et le type de paramètre « FromNativeValue » doivent être identiques.

# TwoStageMarshallingNativeTypesMustMatchMessage
source: The return type of 'ToNativeValue' and the parameter type of 'FromNativeValue' must be the same
fr: Le type de retour de « ToNativeValue » et le type de paramètre « FromNativeValue » doivent être identiques

# TypeNotSupportedDescription
source: For types that are not supported by source-generated P/Invokes, the resulting P/Invoke will rely on the underlying runtime to marshal the specified type.
fr: Pour les types qui ne sont pas pris en charge par les P/Invok générés par la source, le P/Invoke résultant se base sur le runtime sous-jacent pour marshaler le type spécifié.

# TypeNotSupportedMessageParameter
source: The type '{0}' is not supported by source-generated P/Invokes. The generated source will not handle marshalling of parameter '{1}'.
fr: Le type « {0} » n’est pas pris en charge par les P/Invokes générés par la source. La source générée ne gère pas le marshaling du paramètre « {1} ».

# TypeNotSupportedMessageParameterWithDetails
source: {0} The generated source will not handle marshalling of parameter '{1}'.
fr: {0} La source générée ne gère pas le marshaling du paramètre « {1} ».

# TypeNotSupportedMessageReturn
source: The type '{0}' is not supported by source-generated P/Invokes. The generated source will not handle marshalling of the return value of method '{1}'.
fr: Le type « {0} » n’est pas pris en charge par les P/Invokes générés par la source. La source générée ne gère pas le marshaling de la valeur de retour de la méthode « {1} ».

# TypeNotSupportedMessageReturnWithDetails
source: {0} The generated source will not handle marshalling of the return value of method '{1}'.
fr: {0} La source générée ne gère pas le marshaling de la valeur de retour de la méthode « {1} ».

# TypeNotSupportedTitle
source: Specified type is not supported by source-generated P/Invokes
fr: Le type spécifié n’est pas prise en charge par les P/Invokes générés par la source.

# UnmanagedResourcesRequiresFreeNativeDescription
source: The 'UnmanagedResources' feature requires a 'void FreeNative()' method.
fr: La fonctionnalité « UnmanagedResources » requiert une méthode « void FreeNative() ».

# UnmanagedResourcesRequiresFreeNativeMessage
source: The marshaller type '{0}' supports marshalling with the 'UnmanagedResources' feature, but it does not provide a parameterless 'FreeNative' instance method that returns 'void'
fr: Le type de marshaleur « {0} » prend en charge le marshaling avec la fonctionnalité « UnmanagedResources », mais il ne fournit pas de méthode d’instance « FreeNative » sans paramètre qui retourne « void »

# ValueInCallerAllocatedBufferRequiresSpanConstructorDescription
source: A 'Value'-kind native type that supports the 'CallerAllocatedBuffer' feature must provide a two-parameter constructor taking the managed type and a 'Span' of an 'unmanaged' type as parameters
fr: Un type natif de type «Value» qui prend en charge la fonctionnalité «CallerAllocatedBuffer» doit fournir un constructeur à deux paramètres prenant le type managé et un « Span » d’un type « non géré » comme paramètres

# ValueInCallerAllocatedBufferRequiresSpanConstructorMessage
source: The type '{0}' specifies that it supports 'In' marshalling with the 'CallerAllocatedBuffer' feature for '{1}' but does not provide a two-parameter constructor that takes a '{1}' and 'Span' of an 'unmanaged' type as parameters
fr: Le type « {0} » spécifie qu’il prend en charge le marshaling «In» avec la fonctionnalité «CallerAllocatedBuffer» pour « {1} » mais ne fournit pas de constructeur à deux paramètre qui accepte un « {1} » et « Span » d’un type « non géré » comme paramètres.

# ValueInRequiresOneParameterConstructorDescription
source: A 'Value'-kind native type must provide a one-parameter constructor taking the managed type as a parameter
fr: Un type natif de type « Value » doit fournir un constructeur à un paramètre prenant le type managé en tant que paramètre

# ValueInRequiresOneParameterConstructorMessage
source: The type '{0}' specifies that it supports 'In' marshalling of '{1}' but does not provide a one-parameter constructor that takes a '{1}' as a parameter
fr: Le type « {0} » spécifie qu’il prend en charge le marshaling « In » de « {1} » mais ne fournit pas de constructeur à paramètre unique qui accepte un « {1} » comme paramètre
