Repository: dotnet/runtime
Catalog: src/libraries/System.Text.RegularExpressions/gen/Resources/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# MultipleRegexGeneratorAttributesMessage
source: Multiple RegexGeneratorAttributes were applied to the same method, but only one is allowed
cs: Na stejnou metodu se uplatnilo několik RegexGeneratorAttributes, ale je povolena jenom jedna.
de: Mehrere RegexGeneratorAttributes wurden auf dieselbe Methode angewendet, aber nur eine ist zulässig
es: Se aplicaron varios RegexGeneratorAttributes al mismo método, pero solo se permite uno.
fr: Plusieurs RegexGeneratorAttributes ont été appliqués à la même méthode, alors qu’un seul est autorisé
it: Allo stesso metodo sono stati applicati più RegexGeneratorAttribute, ma ne è consentito solo uno
ja: 複数の RegexGeneratorAttributes が同じメソッドに適用されましたが、許可されるのは 1 つだけです
ko: 동일한 메서드에 여러 RegexGeneratorAttributes가 적용되었지만 하나만 허용됩니다.
pl: Do tej samej metody zastosowano wiele atrybutów RegexGeneratorAttributes, ale dozwolony jest tylko jeden
pt_br: Vários RegexGeneratorAttributes foram aplicados ao mesmo método, mas apenas um é permitido
ru: Несколько RegexGeneratorAttributes были применены к одному методу, но разрешен только один
tr: Aynı yönteme birden çok RegexGeneratorAttributes uygulandı, ancak yalnızca birine izin veriliyor
zh_hans: 对同一方法应用了多个 RegexGeneratorAttribute，但只允许使用一个
zh_hant: 已將多個 RegexGeneratorAttributes 套用到同一個方法，但只允許一個

# NestedQuantifiersNotParenthesized
source: Nested quantifier '{0}'.
cs: Vnořený kvantifikátor {0}.
de: Geschachtelter Quantifizierer „{0}“.
es: Cuantificador anidado '{0}'.
fr: Quantificateur imbriqué « {0} ».
it: Quantificatore '{0}' annidato.
ja: 入れ子になった量指定子 '{0}' です。
ko: 중첩 수량자 '{0}'입니다.
pl: Zagnieżdżony kwantyfikator „{0}”.
pt_br: Quantificador aninhado '{0}'.
ru: Вложенный квантификатор "{0}".
tr: İç içe yerleştirilmiş niceleyici “{0}”.
zh_hans: 嵌套限定符“{0}”。
zh_hant: 巢狀數量詞 '{0}'。

# NestedQuantifiersNotParenthesizedNoPlaceholder
source: Nested quantifier no parenthesized.
cs: Vnořený kvantifikátor neobsahuje žádné závorky.
de: Geschachtelter Quantifizierer ohne Klammern.
es: El cuantificador anidado no está entre paréntesis.
fr: Quantificateur imbriqué sans parenthèse.
it: Quantificatore annidato non racchiuso tra parentesi.
ja: 入れ子になった量指定子はかっこで囲まれません。
ko: 중첩된 수량자에 괄호가 없습니다.
pl: Zagnieżdżony kwantyfikator nie ma nawiasów.
pt_br: Quantificador aninhado sem parênteses.
ru: Вложенный квантификатор не заключен в круглые скобки.
tr: İç içe geçmiş niceleyici parantez içine alınmamış.
zh_hans: 不带圆括号的嵌套限定符。
zh_hant: 巢狀數量詞沒有小括號。

# NoResultOnFailed
source: Result cannot be called on a failed Match.
cs: Výsledek nelze volat pro shodu, která se nezdařila.
de: Das Ergebnis kann nicht für eine fehlgeschlagene Übereinstimmung aufgerufen werden.
es: No se puede llamar al resultado si no se encuentra ninguna coincidencia.
fr: Le résultat ne peut pas être appelé sur un Match ayant échoué.
it: Impossibile chiamare Result su un Match non riuscito.
ja: 失敗した Match で Result を呼び出すことはできません。
ko: 실패한 Match에서 결과를 호출할 수 없습니다.
pl: Nie można wywołać wyniku błędnego dopasowania.
pt_br: Não é possível chamar resultado quando há falha na correspondência.
ru: Вызов результата невозможен при сбойном соответствии.
tr: Sonuç, başarısız Eşleştirmede çağrılamaz.
zh_hans: 不能对失败的匹配调用结果。
zh_hant: 無法在已失敗的對應 (Match) 上呼叫結果。

# NotSupported_NonBacktrackingAndReplacementsWithSubstitutionsOfGroups
source: Regex replacements with substitutions of groups are not supported with RegexOptions.NonBacktracking.
cs: Nahrazení regulárních výrazů pomocí substitucí skupin se u RegexOptions.NonBacktracking nepodporuje.
de: RegEx-Ersätze durch Austausch von Gruppen werden bei RegexOptions.NonBacktracking nicht unterstützt.
es: Los reemplazos de regex con sustituciones de grupos no se admiten con RegexOptions.NonBacktracking.
fr: Les remplacements d'expressions régulières avec des substitutions de groupes ne sont pas pris en charge avec RegexOptions.NonBacktracking.
it: Le sostituzioni regex con sostituzioni di gruppi non sono supportate con RegexOptions.NonBacktracking.
ja: RegexOptions.NonBacktracking では、グループの置換による正規表現の置換はサポートされていません。
ko: RegexOptions.NonBacktracking에서는 그룹을 대체하는 Regex 대체가 지원되지 않습니다.
pl: Zamiany wyrażeń regularnych z podstawieniami grup nie są obsługiwane w przypadku metody RegexOptions.NonBacktracking.
pt_br: Substituições de regex com substituições de grupos não são suportadas com RegexOptions.NonBacktracking.
ru: Замена регулярных выражений на группы не поддерживается в RegexOptions.NonBacktracking.
tr: Grup değiştirmeleri içeren normal ifade değiştirmeleri RegexOptions.NonBacktracking ile desteklenmez.
zh_hans: RegexOptions.NonBacktracking 不支持使用组替换的正则表达式替换。
zh_hant: RegexOptions.NonBacktracking 不支援以替代群組取代 Regex。

# NotSupported_ReadOnlyCollection
source: Collection is read-only.
cs: Kolekce je jen pro čtení.
de: Die Sammlung ist schreibgeschützt.
es: La colección es de sólo lectura.
fr: La collection est en lecture seule.
it: La raccolta è di sola lettura.
ja: コレクションは読み取り専用です。
ko: 읽기 전용 컬렉션입니다.
pl: Kolekcja jest tylko do odczytu.
pt_br: A coleção é somente leitura.
ru: Данная коллекция предназначена только для чтения.
tr: Koleksiyon salt okunur.
zh_hans: 集合是只读的。
zh_hant: 集合是唯讀的。

# OnlyAllowedOnce
source: This operation is only allowed once per object.
cs: Tuto operaci lze na objektu provést pouze jednou.
de: Dieser Vorgang ist pro Objekt nur einmal zulässig.
fr: Cette opération n'est autorisée qu'une fois par objet.
ko: 이 작업은 개체 당 한 번만 사용할 수 있습니다.
ru: Для каждого объекта допускается только однократное выполнение этой операции.
zh_hans: 对每个对象只能执行一次此操作。

# PlatformNotSupported_CompileToAssembly
source: This platform does not support writing compiled regular expressions to an assembly.
cs: Tato platforma nepodporuje zápis zkompilovaných regulárních výrazů do sestavení.
de: Diese Plattform unterstützt das Schreiben kompilierter regulärer Ausdrücke in eine Assembly nicht.
es: Esta plataforma no admite la escritura de expresiones regulares compiladas en un ensamblado.
fr: Cette plateforme ne prend pas en charge l’écriture d’expressions régulières compilées dans un assembly.
it: Questa piattaforma non supporta la scrittura di espressioni regolari compilate in un assembly.
ja: このプラットフォームでは、コンパイルされた正規表現をアセンブリに書き込むことはサポートされていません。
ko: 이 플랫폼은 컴파일된 정규식을 어셈블리에 쓰는 것을 지원하지 않습니다.
pl: Ta platforma nie obsługuje pisania skompilowanych wyrażeń regularnych do zestawu.
pt_br: Essa plataforma não suporta a escrita de expressões regulares compiladas em um assembly.
ru: Эта платформа не поддерживает запись скомпилированных регулярных выражений в сборку.
tr: Bu platform, bütünleştirilmiş koda derlenmiş normal ifadeler yazılmasını desteklemiyor.
zh_hans: 此平台不支持将已编译的正则表达式写入程序集。
zh_hant: 此平台不支援將已編譯的規則運算式寫入組件。

# QuantifierAfterNothing
source: Quantifier {x,y} following nothing.
cs: Před kvantifikátorem {x,y} není nic uvedeno.
de: Quantifizierer {x,y} nach nichts.
es: Cuantificador {x,y} después de nada.
fr: Quantificateur {x,y} ne suivant rien.
it: Il quantificatore {x,y} non segue alcun elemento.
ja: 量指定子 {x,y} の前に何もありません。
ko: 수량자 {x,y} 앞에 아무 것도 없습니다.
pl: Nic nie występuje przed kwantyfikatorem {x,y}.
pt_br: Nada precede o quantificador {x,y}.
ru: Перед квантификатором {x,y} ничего нет.
tr: {x,y} miktar belirleyicisinin izlediği bir öğe yok.
zh_hans: 限定符 {x,y} 前没有任何内容。
zh_hant: 數量詞 {x,y} 之後沒有東西。

# QuantifierOrCaptureGroupOutOfRange
source: Capture group numbers must be less than or equal to Int32.MaxValue.
cs: Počty skupin digitalizace musí být menší nebo rovny hodnotě Int32.MaxValue.
de: Erfassungsgruppennummern müssen kleiner oder gleich Int32.MaxValue sein.
es: Los números del grupo de capturas deben ser menores o iguales que Int32.MaxValue.
fr: Les nombres de groupes de capture doivent être inférieurs ou égaux à Int32.MaxValue.
it: I numeri del gruppo Capture devono essere minori o uguali a Int32.MaxValue.
ja: キャプチャ グループ数は、Int32.MaxValue 以下でなければなりません。
ko: 캡처 그룹 번호는 Int32.MaxValue보다 작거나 같아야 합니다.
pl: Numery grup przechwytywania muszą być mniejsze lub równe wartości Int32.MaxValue.
pt_br: Os números de grupo de captura devem ser menores que ou iguais a Int32.MaxValue.
ru: Номера групп захвата должны быть меньше или равны Int32.MaxValue.
tr: Yakalama grubu numaraları Int32.MaxValue değerine eşit veya bundan küçük olmalıdır.
zh_hans: 捕获组的数量必须小于或等于 Int32.MaxValue。
zh_hant: 擷取的群組數目必須小於或等於 Int32.MaxValue。

# RegexMatchTimeoutException_Occurred
source: The RegEx engine has timed out while trying to match a pattern to an input string. This can occur for many reasons, including very large inputs or excessive backtracking caused by nested quantifiers, back-references and other factors.
cs: Vypršel časový limit modulu RegEx při pokusu o porovnání vzoru se vstupním řetězcem. K tomu může dojít z celé řady důvodů, mezi které patří velká velikost vstupních dat nebo nadměrné zpětné navracení způsobené vloženými kvantifikátory, zpětnými odkazy a dalšími faktory.
de: Zeitüberschreitung des RegEx-Moduls beim Versuch, ein Muster mit einer Eingabezeichenfolge in Übereinstimmung zu bringen. Dies kann viele Ursachen haben, darunter sehr große Eingaben oder übermäßige Rückverfolgung aufgrund von geschachtelten Quantifizierern, Rückverweisen und anderen Faktoren.
es: Se agotó el tiempo de espera mientras el motor de RegEx intentaba comparar una cadena de entrada con un patrón. Esto puede deberse a muchos motivos, como la especificación de cadenas de entrada muy grandes o búsquedas hacia atrás excesivas causadas por cuantificadores anidados, referencias inversas y otros factores.
fr: Le délai d'attente du moteur RegEx a expiré pendant la tentative d'appariement d'un modèle avec une chaîne d'entrée. Ce problème peut se produire pour de nombreuses raisons, notamment en cas d'entrées volumineuses ou de retour sur trace excessif causé par les quantificateurs imbriqués, les références arrière et d'autres facteurs.
it: Timeout del motore RegEx durante il tentativo di corrispondenza di un criterio a una stringa di input. Il timeout si può verificare per molti motivi, compresi gli input molto grandi o un eccessivo backtracking causato dai quantificatori annidati, backreference e altri fattori.
ja: パターンと入力文字列との照合中に、RegEx エンジンがタイムアウトしました。これは、非常に大きな入力、入れ子になった量指定子によって生じた過剰なバックトラッキング、前方参照などの要因を含む、さまざまな原因によって発生する可能性があります。
ko: RegEx 엔진이 패턴을 입력 문자열에 일치시키는 동안 시간 초과되었습니다. 이 오류는 많은 입력, 중첩 수량자로 인한 과도한 역추적, 역참조, 기타 요인 등의 다양한 이유로 인해 발생할 수 있습니다.
pl: Upłynął limit czasu podczas próby dopasowania przez aparat wyrażeń regularnych wzorca do ciągu wejściowego. Mogło to być spowodowane wieloma przyczynami, w tym bardzo dużą ilością danych wejściowych, nadmiernym wykorzystaniem algorytmu wycofywania związanym z kwantyfikatorami zagnieżdżonymi, odwołaniami wstecznymi i innymi czynnikami.
pt_br: O mecanismo de RegEx esgotou o tempo limite ao tentar combinar um padrão com uma cadeia de caracteres de entrada. Isso pode ocorrer por vários motivos, incluindo entradas muito grandes ou acompanhamento inverso excessivo causado por quantificadores aninhados, referências inversas e outros fatores.
ru: Истекло время ожидания модуля RegEx при попытке сравнить шаблон со входной строкой. Это могло произойти по многим причинам, в том числе из-за очень большого объема входных данных или излишнего обратного отслеживания, вызванного вложенными квантификаторами, обратными ссылками и прочими факторами.
tr: RegEx altyapısı bir deseni bir giriş dizesiyle eşleştirmeye çalışırken zaman aşımına uğradı. Bu birçok nedenle oluşabilir; buna çok büyük girişler ya da iç içe geçmiş miktar belirleyiciler, geri başvurular ve diğer faktörler nedeniyle oluşan aşırı geri dönüşler dahildir.
zh_hans: 尝试将模式与输入字符串匹配时，RegEx 引擎超时。许多原因均可能导致出现这种情况，包括由嵌套限定符、反向引用和其他因素引起的大量输入或过度回溯。
zh_hant: 嘗試將模式對應至輸入字串時，RegEx 引擎發生逾時。有很多原因會導致這個情形，其中包括巢狀數量詞、反向參考及其他因素所造成的極大量輸入或過度使用回溯法。

# RegexMethodMustHaveValidSignatureMessage
source: Regex method must be partial, parameterless, non-generic, and return Regex
cs: Metoda regulárního výrazu musí být částečná, bez parametrů, negenerická a musí vracet regulární výraz.
de: Die Regex-Methode muss partiell, parameterlos, nicht generisch sein und Regex zurückgeben.
fr: La méthode Regex doit être partielle, sans paramètre, non générique, et renvoyer une expression régulière
ko: Regex 메서드는 부분적이고 매개 변수가 없고 제네릭이 아니어야 하며 Regex를 반환해야 합니다.
ru: Метод Regex должен быть частичным, без параметров, неуниверсальным и возвращать регулярное выражение
zh_hans: Regex 方法必须是分部、无参数、非泛型，并返回 Regex

# ReplacementError
source: Replacement pattern error.
cs: Chyba vzorku pro náhradu.
de: Ersetzungsmusterfehler.
es: Error de patrón de reemplazo.
fr: Erreur de modèle de remplacement.
it: Errore nel criterio di sostituzione.
ja: 置換パターン エラーです。
ko: 교체 패턴 오류입니다.
pl: Błąd wzorca zastępczego.
pt_br: Erro no padrão de substituição.
ru: Ошибка шаблона замены.
tr: Değiştirme deseni hatası.
zh_hans: 替换模式错误。
zh_hant: 取代模式錯誤。

# ReversedCharacterRange
source: [x-y] range in reverse order.
cs: Rozsah [x-y] je v obráceném pořadí.
de: [x-y]-Bereich in umgekehrter Reihenfolge.
es: Intervalo [x-y] en orden inverso.
fr: Plage [x-y] en ordre inverse.
it: Intervallo [x-y] in ordine inverso.
ja: [x-y] 範囲の順序が逆です。
ko: [x-y] 범위가 역순으로 되어 있습니다.
pl: Zakres [x-y] w kolejności odwrotnej.
pt_br: Intervalo [x-y] em ordem inversa.
ru: Обратный порядок диапазона [x-y].
tr: [x-y] aralığı ters sırada.
zh_hans: [x-y] 范围的顺序颠倒。
zh_hant: 相反順序的 [x-y] 範圍。

# ReversedQuantifierRange
source: Illegal {x,y} with x > y.
cs: Rozsah {x,y}, kde x > y, je neplatný.
de: Unzulässige {x,y} mit x > y.
es: {x,y} no válidos con x > y.
fr: {x,y} non conforme avec x > y.
it: {x,y} non valido con x > y.
ja: {x,y} が無効です。x が y よりも大きい値です。
ko: x > y인 {x,y}를 사용할 수 없습니다.
pl: Niedozwolone wartości {x,y}, gdzie x > y.
pt_br: {x,y} incorreto com x > y.
ru: Недопустимая пара {x,y} с x > y.
tr: x > y olan geçersiz {x,y}.
zh_hans: {x,y} 在 x > y 时为非法。
zh_hant: 不合法的 {x,y}，因為 x > y。

# ShorthandClassInCharacterRange
source: Cannot include class \\{0} in character range.
cs: Do rozsahu znaků nejde zahrnout třídu \\{0}.
de: Die Klasse \\{0} kann nicht in den Zeichenbereich eingeschlossen werden.
es: No se puede incluir la clase \\{0} en el intervalo de caracteres.
fr: Impossible d'inclure la classe \\{0} dans la plage de caractères.
it: Non è possibile includere la classe \\{0} nell'intervallo di caratteri.
ja: 文字範囲にクラス \\{0} を含めることはできません。
ko: 문자 범위에 \\{0} 클래스를 포함할 수 없습니다.
pl: Nie można uwzględnić klasy \\{0} w zakresie znaków.
pt_br: Não é possível incluir classe \\{0} no intervalo de caracteres.
ru: Невозможно включить класс \\{0} в диапазон символов.
tr: Karakter aralığına \\{0} sınıfı dahil edilemez.
zh_hans: 不能在字符范围内包含类 \\{0}。
zh_hant: 無法在字元範圍內包含類別 \\{0}。

# ShorthandClassInCharacterRangeNoPlaceholder
source: Cannot include class in character range.
cs: Do rozsahu znaků nejde zahrnout třídu.
de: Die Klasse kann nicht in den Zeichenbereich eingeschlossen werden.
es: No se puede incluir la clase en el intervalo de caracteres.
fr: Impossible d'inclure la classe dans la plage de caractères.
it: Non è possibile includere la classe nell'intervallo di caratteri.
ja: 文字範囲にクラスを含めることはできません。
ko: 문자 범위에 클래스를 포함할 수 없습니다.
pl: Nie można uwzględnić klasy w zakresie znaków.
pt_br: Não pode incluir classe no intervalo de caracteres.
ru: Невозможно включить класс в диапазон символов.
tr: Karakter aralığına sınıf dahil edilemez.
zh_hans: 不能在字符范围内包含类。
zh_hant: 無法在字元範圍內包含類別。

# UndefinedNamedReference
source: Reference to undefined group name '{0}'.
cs: Odkaz na nedefinovaný název skupiny {0}.
de: Verweis auf nicht definierten Gruppennamen „{0}“.
es: Referencia al nombre de grupo no definido '{0}'.
fr: Référence au nom de groupe non défini « {0} ».
it: Riferimento a nome di gruppo indefinito: '{0}'.
ja: 未定義のグループ名 '{0}' への参照です。
ko: 정의되지 않은 그룹 이름 '{0}'에 대한 참조입니다.
pl: Odwołanie do niezdefiniowanej nazwy grupy „{0}”.
pt_br: Referência ao nome do grupo indefinido '{0}'.
ru: Ссылка на неопределенное имя группы "{0}".
tr: Tanımsız grup adı “{0}” başvurusu.
zh_hans: 对未定义的组名“{0}”的引用。
zh_hant: 未定義群組名稱 '{0}' 的參考。

# UndefinedNamedReferenceNoPlaceholder
source: Reference to undefined group name.
cs: Odkaz na nedefinovaný název skupiny.
de: Verweis auf nicht definierten Gruppennamen.
es: Referencia al nombre de grupo no definido.
fr: Référence au nom de groupe non défini.
it: Riferimento a nome di gruppo indefinito.
ja: 未定義のグループ名への参照です。
ko: 정의되지 않은 그룹 이름에 대한 참조입니다.
pl: Odwołanie do niezdefiniowanej nazwy grupy.
pt_br: Referência ao nome do grupo indefinido.
ru: Ссылка на неопределенное имя группы.
tr: Tanımsız grup adı başvurusu.
zh_hans: 对未定义的组名的引用。
zh_hant: 未定義群組名稱的參考。

# UndefinedNumberedReference
source: Reference to undefined group number {0}.
cs: Odkaz na nedefinované číslo skupiny. Číslo skupiny: {0}.
de: Verweis auf die nicht definierte Gruppenzahl {0}.
es: Referencia al número de grupo sin definir {0}.
fr: Référence à un numéro de groupe non défini {0}.
it: Riferimento a numero di gruppo indefinito: {0}.
ja: 未定義のグループ番号 {0} が参照されました。
ko: 정의되지 않은 그룹 번호 {0}을(를) 참조합니다.
pl: Odwołanie do niezdefiniowanego numeru grupy {0}.
pt_br: Referência a número de grupo {0} indefinido.
ru: Ссылка на неопределенный номер группы {0}.
tr: {0} tanımsız grup numarası başvurusu.
zh_hans: 对未定义的组成员 {0} 的引用。
zh_hant: 參考到未定義的群組編號 {0}。

# UndefinedNumberedReferenceNoPlaceholder
source: Reference to undefined group number.
cs: Odkaz na nedefinované číslo skupiny.
de: Verweis auf nicht definierte Gruppennummer.
es: Referencia al número de grupo no definido.
fr: Référence à un numéro de groupe non défini.
it: Riferimento a numero di gruppo indefinito.
ja: 未定義のグループ番号への参照です。
ko: 정의되지 않은 그룹 번호에 대한 참조입니다.
pl: Odwołanie do niezdefiniowanego numeru grupy.
pt_br: Referência ao número do grupo indefinido.
ru: Ссылка на неопределенный номер группы.
tr: Tanımsız grup numarası başvurusu.
zh_hans: 对未定义的组编号的引用。
zh_hant: 參考未定義的群組號碼。

# UnescapedEndingBackslash
source: Illegal \\ at end of pattern.
cs: Znak \\ na konci vzorku je neplatný.
de: Unzulässiger \\ am Ende des Musters.
es: \\ no válido al final del patrón.
fr: \\ non conforme à la fin du modèle.
it: Carattere \\ non valido alla fine del criterio.
ja: パターンの末尾に無効な \\ があります。
ko: 패턴 끝에 잘못된 \\가 있습니다.
pl: Niedozwolony znak \\ na końcu wzorca.
pt_br: \\ incorreto no final do padrão.
ru: Недопустимая обратная косая черта \\ в конце образца.
tr: Desenin sonunda geçersiz \\.
zh_hans: \\ 在模式末尾非法。
zh_hant: 模式結尾有不合法的 \\。

# UnexpectedOpcode
source: Unexpected opcode in regular expression generation: {0}.
cs: Při generování regulárního výrazu byl nalezen neočekávaný operační kód: {0}.
de: Unerwarteter "opcode" bei Generierung von regulärem Ausdruck: {0}.
fr: opcode inattendu dans la génération d'expressions régulières : {0}.
ko: 정규식 생성에 예기치 않은 opcode가 있습니다. {0}
ru: Неожиданный код операции при создании регулярного выражения: {0}.
zh_hans: 生成正则表达式时出现意外的操作码: {0}。

source: Unrecognized control character.
cs: Nerozpoznaný řídicí znak.
de: Unbekanntes Steuerzeichen.
es: Carácter de control no reconocido.
fr: Caractère de contrôle non reconnu.
it: Carattere di controllo non riconosciuto.
ja: 認識されない制御文字です。
ko: 인식할 수 없는 제어 문자입니다.
pl: Nierozpoznany znak kontrolny.
pt_br: Caractere de controle não reconhecido.
ru: Нераспознанный управляющий знак.
tr: Tanınmayan denetim karakteri.
zh_hans: 无法识别的控制字符。
zh_hant: 無法識別的控制字元。

# UnrecognizedEscape
source: Unrecognized escape sequence \\{0}.
cs: Nerozpoznaná řídicí sekvence \\{0}.
de: Unbekannte Escapesequenz \\{0}.
es: Secuencia de escape no reconocida \\{0}.
fr: Séquence d'échappement non reconnue \\{0}.
it: Sequenza di escape non riconosciuta: \\{0}.
ja: 認識できないエスケープ シーケンス \\{0} です。
ko: 인식할 수 없는 이스케이프 시퀀스 \\{0}.
pl: Nierozpoznana sekwencja ucieczki \\{0}.
pt_br: Sequência de escape não reconhecida \\{0}
ru: Не удалось распознать escape-последовательность \\{0}.
tr: Tanınmayan kaçış dizisi \\{0}.
zh_hans: 无法识别的转义序列 \\{0}。
zh_hant: 無法識別的逸出序列 \\{0}。

# UnrecognizedUnicodeProperty
source: Unknown property '{0}'.
cs: Neznámá vlastnost {0}.
de: Unbekannte Eigenschaft '{0}'.
es: Propiedad desconocida '{0}'.
fr: Propriété inconnue « {0} ».
it: Proprietà '{0}' sconosciuta.
ja: 不明なプロパティ '{0}' です。
ko: 알 수 없는 속성 '{0}'.
pl: Nieznana właściwość „{0}”.
pt_br: Propriedade desconhecida '{0}'.
ru: Неизвестное свойство "{0}".
tr: Bilinmeyen özellik “{0}”.
zh_hans: 未知的属性“{0}”。
zh_hant: 未知的屬性 '{0}'。

# UnrecognizedUnicodePropertyNoPlaceholder
source: Unknown property Unicode property.
cs: Neznámá vlastnost Unicode vlastnosti.
de: Unbekannte Eigenschaft Unicode-Eigenschaft.
es: Propiedad Unicode de propiedad desconocida.
fr: Propriété Unicode inconnue.
it: Proprietà Unicode della proprietà sconosciuta.
ja: 不明なプロパティの Unicode プロパティです。
ko: 알 수 없는 속성 유니코드 속성입니다.
pl: Nieznana właściwość Unicode.
pt_br: Propriedade Desconhecida Propriedade Unicode.
ru: Неизвестное свойство Unicode свойства.
tr: Bilinmeyen özellik Unicode özelliği.
zh_hans: 未知属性 - Unicode 属性。
zh_hant: 未知屬性 Unicode 屬性。

# UnterminatedBracket
source: Unterminated [] set.
cs: Nedokončená [] sada.
de: Nicht abgeschlossener []-Satz.
es: Conjunto [] sin terminar.
fr: Ensemble [] inachevé.
it: Set [] senza terminazione.
ja: 未終了の [] セットです。
ko: 종결되지 않은 [] 집합입니다.
pl: Nieskończony zestaw nawiasów [].
pt_br: Conjunto [] não finalizado.
ru: Набор [] без признака завершения.
tr: Sonlandırılmayan [] kümesi.
zh_hans: 未终止的 [] 集。
zh_hant: 未結束的 [] 集合。

source: Unterminated (?#...) comment.
cs: Neukončený komentář (?#...).
de: Nicht abgeschlossener (?#...)-Kommentar.
es: Comentario (?#...) sin terminar.
fr: Commentaire (?#...) inachevé.
it: Commento (?#...) non terminato.
ja: 未終了の (?#...) コメントです。
ko: 종결되지 않은 (?#...) 주석입니다.
pl: Niezakończony komentarz (?#...).
pt_br: Comentário (?#...) não finalizado.
ru: Комментарий (?#...) без признака завершения.
tr: Sonlandırılmayan (?#...) yorumu.
zh_hans: 未终止的(?#...)注释。
zh_hant: 未結束的 (?#...) 註解。

# InvalidLangVersionMessage
source: C# LangVersion of 11 or greater is required
es: Se requiere C# LangVersion de 11 o superior
it: LangVersion di C# 11 o superiore obbligatoria
pl: Wymagane jest wersja 11 lub nowsza języka C# LangVersion
pt_br: C# LangVersion de 11 ou superior é necessária
tr: C# LangVersion 11 veya üstü gereklidir

# LimitedSourceGenerationMessage
source: The RegexGenerator couldn't generate a complete source implementation for the specified regular expression due to an internal limitation.
es: RegexGenerator no pudo generar una implementación de origen completa para la expresión regular especificada debido a una opción no admitida o a una expresión regular demasiado compleja. La implementación interpretará la expresión regular en tiempo de ejecución.
tr: RegexGenerator, desteklenmeyen bir seçenek veya çok karmaşık bir normal ifade nedeniyle belirtilen normal ifade için tam kaynak uygulaması oluşturamadı. Uygulama, normal ifadeyi çalışma zamanında yorumlar.

# LimitedSourceGenerationTitle
source: RegexGenerator limitation reached.
es: Se alcanzó la limitación de RegexGenerator.
it: È stata raggiunta la limitazione di RegexGenerator.
ja: RegexGenerator の制限に達しました。
pl: Osiągnięto ograniczenie RegexGenerator.
pt_br: Limitação de RegexGenerator atingida.
tr: RegexGenerator sınırına ulaşıldı.
zh_hant: 已達 RegexGenerator 限制。
