Repository: dotnet/runtime
Catalog: src/libraries/System.Text.RegularExpressions/gen/Resources/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# RegexMethodMustHaveValidSignatureMessage
source: RegexGenerator method must be partial, parameterless, non-generic, non-abstract, and return Regex
es: El método RegexGenerator debe ser parcial, sin parámetros, no genérico, no abstracto y devolver Regex
it: Il metodo RegexGenerator deve essere parziale, senza parametri, non generico, non astratto e restituire Regex
pl: Metoda RegexGenerator musi być częściowa, bez parametrów, niestanowa, nieabstrakcyjna i zwracać wyrażenia regularne
pt_br: O método RegexGenerator deve ser parcial, sem parâmetros, não genérico, não abstrato e retornar Regex
tr: RegexGenerator yöntemi kısmi, parametresiz, genel olmayan, soyut olmayan özellikler taşımalıdır ve Normal ifade döndürmelidir
zh_hant: Regex 方法必須是部分、無參數、非泛型，並且傳回 Regex

# LimitedSourceGenerationMessage
source: The RegexGenerator couldn't generate a complete source implementation for the specified regular expression, due to an unsupported option or too complex a regular expression. The implementation will interpret the regular expression at run-time.
it: RegexGenerator non è riuscito a generare un'implementazione di origine completa per l'espressione regolare specificata a causa di un'opzione non supportata o di un'espressione regolare troppo complessa. L'implementazione interpreterà l'espressione regolare in fase di esecuzione.
ja: オプションがサポートされていないか、または正規表現が複雑すぎるため、RegexGenerator は指定された正規表現の完全なソース実装を生成できませんでした。 実装では、実行時に正規表現が解釈されます。
pl: Obiekt RegexGenerator nie może wygenerować pełnej implementacji źródła dla określonego wyrażenia regularnego z powodu nieobsługiwanych opcji lub zbyt złożonego wyrażenia regularnego. Implementacja będzie interpretować wyrażenie regularne w czasie wykonywania.
pt_br: O RegexGenerator não pôde gerar uma implementação de origem completa para a expressão regular especificada, devido a uma opção sem suporte ou a uma expressão regular muito complexa. A implementação interpretará a expressão regular em tempo de execução.
zh_hant: RegexGenerator 無法為指定的規則運算式產生完整的來源實作，因為不支援的選項或規則運算式太複雜。實作會在執行時間解譯規則運算式。
