Repository: dotnet/runtime
Catalog: src/libraries/System.Text.RegularExpressions/gen/Resources/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# AlternationHasComment
source: Alternation conditions cannot be comments.
cs: Podmínky alternativního výrazu nemohou být komentáře.
de: Alternierungsbedingungen können keine Kommentare sein.
es: Las condiciones de alternación no pueden ser comentarios.
fr: Les conditions d'alternative ne peuvent pas être des commentaires.
it: Le condizioni di alternanza non possono essere commenti.
ja: 選択条件をコメントにできません。
ko: 교체 조건은 주석이 될 수 없습니다.
pl: Wyrażenia warunkowe nie mogą być komentarzami.
pt_br: Condições de alternância não podem ser comentários.
ru: Условия чередования не могут быть комментариями.
tr: Değişim koşulları açıklama olamaz.
zh_hans: 替换条件不能是注释。
zh_hant: 替代條件不能為註解。

# AlternationHasMalformedCondition
source: Illegal conditional (?(...)) expression.
cs: Podmíněný výraz (?(...)) je neplatný.
de: Unzulässiger bedingter (?(...))-Ausdruck.
es: Expresión (?(...)) condicional no válida.
fr: Expression conditionnelle (?(...)) non conforme.
it: Espressione condizionale (?(...)) non valida.
ja: 条件付き (?(...)) 表現が無効です。
ko: 조건(?(...))식이 잘못되었습니다.
pl: Niedozwolone wyrażenie warunkowe (?(...)).
pt_br: Expressão condicional (?(...)) incorreta.
ru: Недопустимое условное выражение (?(...)).
tr: Geçersiz koşul (?(...)) ifadesi.
zh_hans: 非法的条件(?(...))表达式。
zh_hant: 不合法的條件 (?(...)) 運算式。

# AlternationHasMalformedReference
source: (?({0}) ) malformed.
cs: Odkaz (?({0}) ) byl poškozen.
de: (?({0}) ) falsch formatiert.
es: (? ({0}) ) con formato incorrecto.
fr: (?({0}) ) malformé.
it: (?({0}) ) non valido.
ja: (?({0}) ) の形式に誤りがあります。
ko: (?({0}) ) 형식이 잘못되었습니다.
pl: Zmiana (?({0}) ) ma nieprawidłową postać.
pt_br: (?({0}) ) malformado.
ru: Неверный формат (?({0}) ).
tr: (?({0}) ) hatalı biçimlendirilmiş.
zh_hans: (?({0}) )格式不正确。
zh_hant: (?({0}) ) 格式錯誤。

# AlternationHasMalformedReferenceNoPlaceholder
source: Alternation has malformed reference.
cs: Alternace má nesprávně vytvořený odkaz.
de: Der Wechsel weist einen ungültigen Verweis auf.
es: La alternancia tiene una referencia con formato incorrecto.
fr: L’alternative a une référence malformée.
it: L'alternanza contiene un riferimento non valido.
ja: 代替の参照の形式に誤りがあります。
ko: 대체에 잘못된 참조가 있습니다.
pl: Zmiana ma źle sformułowane odwołanie.
pt_br: A alternativa tem uma referência malformada.
ru: Чередование содержит неправильную ссылку.
tr: Değişimin hatalı biçimlendirilmiş başvurusu var.
zh_hans: 替换具有格式不正确的引用。
zh_hant: 替代具有格式錯誤的參考。

# AlternationHasNamedCapture
source: Alternation conditions do not capture and cannot be named.
cs: Podmínky alternativního výrazu nezachytávají a nelze je pojmenovat.
de: Alternierungsbedingungen werden nicht aufgefangen und können nicht benannt werden.
es: Error al representar el control.
fr: Les conditions d'alternative ne capturent pas et ne peuvent pas être nommées.
it: Le condizioni di alternanza non consentono l'acquisizione e non possono essere denominate.
ja: 選択条件が捕捉されないため、名前を指定できません。
ko: 교체 조건은 캡처하지 않고 이름을 지정할 수 없습니다.
pl: Wyrażenia warunkowe nie przechwytują i nie mogą być nazwane.
pt_br: Condições de alternância não fazem captura e não podem ser renomeadas.
ru: Условия чередования не записаны, и им невозможно присвоить имя.
tr: Değişim koşulları yakalamaz ve adlandırılamaz.
zh_hans: 替换条件不捕获且不能命名。
zh_hant: 替代條件無法擷取且無法命名。

# AlternationHasTooManyConditions
source: Too many | in (?()|).
cs: Příliš mnoho znaků | v řetězci (?()|).
de: Zu viele | in (?()|).
es: Demasiadas | en (?()|).
fr: Trop de | dans (?()|).
it: Troppi | in (?()|).
ja: (?()|) 内の | が多すぎます。
ko: (?()|)에 | 기호가 너무 많습니다.
pl: Za dużo | w (?()|).
pt_br: Número excessivo de | em (?()|).
ru: Слишком много | в (?()|).
tr: (?()|) içinde çok fazla | var.
zh_hans: (?()|)中的 | 过多。
zh_hant: 太多 | 符號於 (?()|)。

# AlternationHasUndefinedReference
source: (?({0}) ) reference to undefined group.
cs: Odkaz na nedefinovanou skupinu (?({0}) ).
de: (?({0}) )-Verweis auf nicht definierte Gruppe.
es: Referencia (?({0}) ) a un grupo no definido.
fr: (?({0}) ) référence à un groupe non défini.
it: (?({0}) ). Riferimento a gruppo indefinito.
ja: 未定義のグループへの (?({0}) ) 参照です。
ko: (?({0}) ) 정의되지 않은 그룹을 참조합니다.
pl: Odwołanie (?({0}) ) do niezdefiniowanej grupy.
pt_br: Referência (?({0}) ) a um grupo indefinido.
ru: (?({0}) ) ссылка на неопределенную группу.
tr: (?({0}) ) tanımsız gruba başvuru.
zh_hans: (?({0}) )引用未定义的组。
zh_hant: (?({0}) ) 參考到未定義的群組。

# AlternationHasUndefinedReferenceNoPlaceholder
source: Alternation has a reference to undefined group.
cs: Alternace obsahuje odkaz na nedefinovanou skupinu.
de: Der Wechsel weist einen Verweis auf eine nicht definierte Gruppe auf.
es: La alternancia tiene una referencia a un grupo no definido.
fr: L’alternative a une référence à un groupe non défini.
it: L'alternanza contiene un riferimento a un gruppo non definito.
ja: 代替には未定義のグループへの参照が含まれています。
ko: 대체에는 정의되지 않은 그룹에 대한 참조가 있습니다.
pl: Zmiana ma odwołanie do niezdefiniowanej grupy.
pt_br: A alternativa tem uma referência a um grupo indefinido.
ru: Чередование содержит ссылку на неопределенную группу.
tr: Değişimin tanımsız bir gruba başvurusu var.
zh_hans: 替换具有对未定义组的引用。
zh_hant: 替代具有未定義之群組的參考。

# Arg_ArrayPlusOffTooSmall
source: Destination array is not long enough to copy all the items in the collection. Check array index and length.
cs: Cílové pole není dostatečně dlouhé, aby bylo možné zkopírovat všechny položky v kolekci. Zkontrolujte index a délku pole.
de: Das Zielarray ist nicht lang genug, um alle Elemente in der Sammlung zu kopieren. Prüfen Sie den Index und die Länge des Arrays.
es: La matriz de destino no es lo suficientemente larga para copiar todos los elementos de la colección. Compruebe el índice y la longitud de la matriz.
fr: La taille du tableau de destination ne permet pas de copier tous les éléments de la collection. Vérifiez l'index et la longueur du tableau.
it: La lunghezza della matrice di destinazione non è sufficiente per copiare tutti gli elementi della raccolta. Controllare l'indice e la lunghezza della matrice.
ja: ターゲット配列の長さが不足しているため、コレクション内のすべての項目をコピーできません。配列のインデックスと長さをご確認ください。
ko: 대상 배열이 컬렉션의 모든 항목을 복사하기에 충분히 길지 않습니다. 배열 인덱스와 길이를 확인하세요.
pl: Tablica docelowa ma zbyt małą długość, aby móc skopiować wszystkie elementy kolekcji. Sprawdź indeks tablicy i jej długość.
pt_br: A matriz de destino não é longa o suficiente para copiar todos os itens da coleção. Verifique o índice e o tamanho da matriz.
ru: Длина конечного массива недостаточна для копирования всех элементов коллекции. Проверьте индекс и длину массива.
tr: Hedef dizi, koleksiyondaki tüm öğeleri kopyalamak için yeterince uzun değil. Dizi dizinini ve uzunluğunu denetleyin.
zh_hans: 目标数组不够长，无法复制集合中的所有项。请检查数组索引和长度。
zh_hant: 目的地陣列的長度不足以複製集合中的所有項目。請檢查陣列索引以及長度。

# ArgumentNull_ArrayWithNullElements
source: The array cannot contain null elements.
cs: Pole nemůže obsahovat elementy null.
de: Das Array kann keine NULL-Elemente enthalten.
fr: Le tableau ne peut pas contenir d'éléments null.
ko: 배열에는 null 요소가 포함될 수 없습니다.
ru: Массив не может содержать null-элементы.
zh_hans: 数组不能包含 null 元素。

# BeginIndexNotNegative
source: Start index cannot be less than 0 or greater than input length.
cs: Počáteční index nemůže být menší než nula nebo větší než délka vstupu.
de: Der Startindex darf nicht kleiner als 0 oder größer als die Eingabelänge sein.
es: El índice inicial no puede ser inferior a 0 ni superior a la longitud de entrada.
fr: L'index de début ne peut pas être inférieur à 0 ou supérieur à la longueur d'entrée.
it: L'indirizzo di inizio non può essere minore di zero o maggiore della lunghezza di input.
ja: 開始インデックスに 0 より小さい値または入力長より大きい値を指定することはできません。
ko: 시작 인덱스는 0보다 작거나 입력 길이보다 클 수 없습니다.
pl: Indeks początkowy nie może być mniejszy od 0 ani większy od długości danych wejściowych.
pt_br: Índice inicial não pode ser menor que 0 ou maior que o comprimento de entrada.
ru: Начальный индекс не может быть меньше 0 или больше длины ввода.
tr: Başlangıç dizini sıfırdan küçük veya giriş uzunluğundan büyük olamaz.
zh_hans: 起始索引不能小于 0 或大于输入长度。
zh_hant: 起始索引不能小於 0 或大於輸入長度。

# CaptureGroupNameInvalid
source: Invalid group name: Group names must begin with a word character.
cs: Neplatný název skupiny. Názvy skupin musí začínat písmenem.
de: Ungültiger Gruppenname: Gruppennamen müssen mit einem Buchstaben beginnen.
es: Nombre de grupo no válido: los nombres de grupos deben empezar con un carácter de palabra.
fr: Nom de groupe non valide : les noms de groupes doivent commencer par un caractère alphabétique.
it: Nome di gruppo non valido: i nomi di gruppo devono iniziare con un carattere alfanumerico.
ja: グループ名が無効です。グループ名は語句で始めなければなりません。
ko: 그룹 이름이 잘못되었습니다. 그룹 이름은 문자로 시작해야 합니다.
pl: Nieprawidłowa nazwa grupy: nazwy grup muszą się zaczynać od litery.
pt_br: Nome de grupo inválido: nomes de grupo deve iniciar por um caractere alfabético.
ru: Недопустимое имя группы: Имена групп должны начинаться с буквы.
tr: Geçersiz grup adı. Grup adları sözcük karakteriyle başlamalıdır.
zh_hans: 无效的组名: 组名必须以单词字符开头。
zh_hant: 無效的群組名稱: 群組名稱必須以文字字元為開頭。

# CaptureGroupOfZero
source: Capture number cannot be zero.
cs: Počet zachytávání nemůže být nulový.
de: Aufzeichnungsnummer darf nicht 0 (null) sein.
es: El número de capturas no puede ser cero.
fr: Le nombre de captures ne peut pas être égal à zéro.
it: Il numero di acquisizioni non può essere zero.
ja: キャプチャ番号を 0 にすることはできません。
ko: 캡처 번호는 0일 수 없습니다.
pl: Numer przechwytywania nie może być równy zeru.
pt_br: Número de captura não pode ser zero.
ru: Номер захвата не может быть равен нулю.
tr: Yakalama numarası sıfır olamaz.
zh_hans: 捕获数不能为零。
zh_hant: 擷取的數字不能為零。

# CountTooSmall
source: Count cannot be less than -1.
cs: Počet nemůže být menší než hodnota -1.
de: Die Anzahl darf nicht kleiner als -1 sein.
es: El recuento no puede ser inferior a -1.
fr: Le nombre ne peut pas être inférieur à -1.
it: Il valore di count non può essere minore di -1.
ja: カウントを -1 未満にすることはできません。
ko: 개수는 -1보다 작을 수 없습니다.
pl: Wartość licznika nie może być mniejsza od -1.
pt_br: Contagem não pode ser menor que -1.
ru: Не может быть меньше -1.
tr: Sayı -1'den küçük olamaz.
zh_hans: 计数不能小于 -1。
zh_hant: 計數不能小於 -1。

# EnumNotStarted
source: Enumeration has either not started or has already finished.
cs: Výčet buď nebyl spuštěn, nebo již byl dokončen.
de: Entweder wurde die Enumeration noch nicht gestartet oder bereits beendet.
es: La enumeración no ha empezado o ya ha finalizado.
fr: L'énumération n'a pas commencé ou est déjà terminée.
it: Enumerazione non avviata o già terminata.
ja: 列挙が開始していないか、または既に完了しています。
ko: 열거가 시작되지 않았거나 이미 완료되었습니다.
pl: Wyliczanie nie zostało uruchomione lub zostało już zakończone.
pt_br: A enumeração não foi iniciada ou já foi concluída.
ru: Перечисление либо не началось, либо уже закончилось.
tr: Sabit listesi işlemi başlamamış ya da zaten bitmiş.
zh_hans: 枚举尚未开始或者已经结束。
zh_hant: 列舉尚未啟動或已經完成。

# ExclusionGroupNotLast
source: A subtraction must be the last element in a character class.
cs: Odčítání musí být posledním prvkem ve třídě znaků.
de: Eine Subtraktion muss das letzte Element in einer Zeichenklasse sein.
es: La resta debe ser el último elemento de una clase de caracteres.
fr: Un retrait doit être le dernier élément dans une classe de caractères.
it: L'ultimo elemento di una classe di caratteri deve essere una sottrazione.
ja: 減算は、文字クラスの最後の要素でなければなりません。
ko: 빼기는 문자 클래스의 마지막 요소여야 합니다.
pl: Odejmowanie musi być ostatnim elementem w klasie znaków.
pt_br: Uma subtração deve ser o último elemento em uma classe de caracteres.
ru: Вычитание должно быть последним элементом в классе знаков.
tr: Çıkarma, karakter sınıfında en son öğe olmalıdır.
zh_hans: 负号必须是字符类中的最后一个元素。
zh_hant: 減法必須是字元類別中的最後一個項目。

# Generic
source: Regular expression parser error '{0}' at offset {1}.
cs: Chyba analyzátoru regulárního výrazu {0} na posunu {1}.
de: Analysefehler des regulären Ausdrucks "{0}" bei Offset {1}.
es: Error del analizador de expresiones regulares '{0}' en el desplazamiento {1}.
fr: Erreur de l’analyseur d’expression régulière « {0} » au décalage {1}.
it: Errore del parser dell'espressione regolare '{0}' alla posizione di offset {1}.
ja: オフセット {1} の正規表現パーサー エラー '{0}'。
ko: 오프셋 {1}에서 정규식 파서 오류 '{0}'.
pl: Błąd analizatora wyrażeń regularnych „{0}” przy przesunięciu {1}.
pt_br: Erro de análise de expressão regular '{0}' no deslocamento {1}.
ru: Ошибка синтаксического анализатора регулярных выражений "{0}" при смещении {1}.
tr: {1} ofsetinde normal ifade ayrıştırıcı hatası “{0}”.
zh_hans: 偏移 {0} 处的正则表达式分析程序错误“{1}”。
zh_hant: 規則運算式剖析器錯誤 '{0}' 位於位移 {1}。

# IllegalDefaultRegexMatchTimeoutInAppDomain
source: AppDomain data '{0}' contains the invalid value or object '{1}' for specifying a default matching timeout for System.Text.RegularExpressions.Regex.
cs: Data domény aplikace {0} obsahují neplatnou hodnotu nebo objekt {1} pro určení výchozího časového limitu porovnávání pro třídu System.Text.RegularExpressions.Regex.
de: AppDomain-Daten '{0}' enthalten einen ungültigen Wert oder ein ungültiges Objekt '{1}' für die Angabe eines übereinstimmenden Standardtimeouts für System.Text.RegularExpressions.Regex.
es: Los datos de AppDomain '{0}' contienen el valor no válido o el objeto '{1}' para especificar un tiempo de espera coincidente predeterminado para System.Text.RegularExpressions.Regex.
fr: Les données AppDomain « {0} » contiennent une valeur ou un objet « {1} » incorrect pour la spécification d'un délai de mise en correspondance par défaut pour System.Text.RegularExpressions.Regex.
it: I dati '{0}' di AppDomain contengono il valore o l'oggetto non valido '{1}' per specificare un timeout di corrispondenza predefinito per System.Text.RegularExpressions.Regex.
ja: AppDomain データ '{0}' には、System.Text.RegularExpressions.Regex の既定の適切なタイムアウトを指定するうえで無効な値またはオブジェクト '{1}' が含まれています。
ko: AppDomain 데이터 '{0}'에 System.Text.RegularExpressions.Regex에 대한 기본 일치 제한 시간을 지정하기 위한 잘못된 값 또는 개체 '{1}'이(가) 있습니다.
pl: Dane AppDomain „{0}” zawierają nieprawidłową wartość lub obiekt „{1}” do określenia domyślnego zgodnego limitu czasu dla elementu System.Text.RegularExpressions.Regex.
pt_br: Os dados AppDomain '{0}' contêm o valor inválido ou objeto '{1}' para especificar um tempo limite de correspondência padrão para System.Text.RegularExpressions.Regex.
ru: Данные домена приложения "{0}" содержат недопустимые значение или объект "{1}", указывающие время ожидания сопоставления по умолчанию для объекта System.Text.RegularExpressions.Regex.
tr: “{0}” AppDomain verileri, System.Text.RegularExpressions.Regex için varsayılan bir eşleştirme zaman aşımı belirtmek için geçersiz “{1}” değeri veya nesnesi içeriyor.
zh_hans: AppDomain 数据“{0}”包含为 System.Text.RegularExpressions.Regex 指定默认匹配超时的无效值或对象“{1}”。
zh_hant: AppDomain 資料 '{0}' 包含用於為 System.Text.RegularExpressions.Regex 指定預設相符逾時的無效值或物件 '{1}'。

# InsufficientClosingParentheses
source: Not enough )'s.
cs: Nedostatek uzavíracích závorek ).
de: Nicht genügend )-Zeichen.
es: No hay suficientes ).
fr: Nombre de ) insuffisant.
it: Parentesi di chiusura insufficienti.
ja: )' が足りません。
ko: )가 부족합니다.
pl: Za mało nawiasów zamykających.
pt_br: Não há )'s suficientes.
ru: Нет парных закрывающих скобок ).
tr: Yeterli ) yok.
zh_hans: ) 不足。
zh_hant: 沒有足夠的 ) 符號。

# InsufficientOpeningParentheses
source: Too many )'s.
cs: Příliš mnoho zavíracích závorek ).
de: Zu viele )-Zeichen.
es: Demasiados ).
fr: Trop de ).
it: Troppe parentesi di chiusura.
ja: )' が多すぎます。
ko: )가 너무 많습니다.
pl: Za dużo nawiasów zamykających.
pt_br: Número excessivo de )'s.
ru: Лишние закрывающие скобки ).
tr: Çok fazla ) var.
zh_hans: ) 过多。
zh_hant: 太多 ) 符號。

# InsufficientOrInvalidHexDigits
source: Insufficient hexadecimal digits.
cs: Nedostatek šestnáctkových číslic.
de: Nicht genügend Hexadezimalziffern.
es: Dígitos hexadecimales insuficientes.
fr: Chiffres hexadécimaux insuffisants.
it: Cifre esadecimali insufficienti.
ja: 不十分な 16 進数の数字です。
ko: 16진수가 충분하지 않습니다.
pl: Za mało cyfr szesnastkowych.
pt_br: Dígitos hexadecimais insuficientes.
ru: Недостаточно шестнадцатеричных цифр.
tr: Yetersiz sayıda onaltılık basamak.
zh_hans: 十六进制位数不足。
zh_hant: 十六進位數字不足。

# InternalError_ScanRegex
source: Internal error in ScanRegex.
cs: Vnitřní chyba v modulu ScanRegex.
de: Interner Fehler in ScanRegex.
es: Error interno en ScanRegex.
fr: Erreur interne dans ScanRegex.
it: Errore interno in ScanRegex.
ja: ScanRegex に内部エラーが発生しました。
ko: ScanRegex에 내부 오류가 있습니다.
pl: Błąd wewnętrzny w elemencie ScanRegex.
pt_br: Erro interno em ScanRegex.
ru: Внутренняя ошибка в ScanRegex.
tr: ScanRegex iç hatası.
zh_hans: ScanRegex 中的内部错误。
zh_hant: ScanRegex 發生內部錯誤。

# InvalidEmptyArgument
source: Argument {0} cannot be zero-length.
cs: Argument {0} nemůže mít nulovou délku.
de: Das Argument {0} darf nicht die Länge null haben.
es: El argumento {0} no puede ser de longitud cero.
fr: La valeur de l’argument {0} ne peut pas être nulle.
it: L'argomento {0} non può avere lunghezza zero.
ja: 引数 {0} は長さゼロにすることはできません。
ko: 인수 {0}은(는) 길이가 0일 수 없습니다.
pl: Argument {0} nie może mieć zerowej długości.
pt_br: O argumento {0} não pode ter comprimento zero.
ru: Аргумент {0} не может иметь нулевую длину.
tr: Bağımsız değişken {0}, sıfır uzunluğunda olamaz.
zh_hans: 自变量 {0} 长度不能为零。
zh_hant: 引數 {0} 長度不可以為零。

# InvalidGroupingConstruct
source: Unrecognized grouping construct.
cs: Nerozpoznaný seskupovací konstrukt.
de: Unbekanntes Gruppierungskonstrukt.
es: Construcción de agrupación no reconocida.
fr: Construction de regroupement non reconnue.
it: Costrutto di raggruppamento non riconosciuto.
ja: 認識されないグループ化構成体です。
ko: 인식할 수 없는 그룹화 구성입니다.
pl: Nierozpoznana konstrukcja grupowania.
pt_br: Construção de agrupamento não reconhecida.
ru: Нераспознанная конструкция группирования.
tr: Tanınmayan gruplama yapısı.
zh_hans: 无法识别的分组构造。
zh_hant: 無法識別的分組建構。

# InvalidLangVersionMessage
source: C# LangVersion of 10 or greater is required
cs: Je požadována verze jazyku C# LangVersion 10 nebo vyšší.
de: C#-LangVersion von 10 oder höher ist erforderlich
fr: C# LangVersion supérieur ou égal à 10 est requis
ko: 10 이상의 C# LangVersion이 필요합니다.
ru: Требуется C# LangVersion 10 или выше
zh_hans: 需要 C# LangVersion 10 或更高版本

# InvalidRegexArgumentsMessage
source: The specified regex is invalid. '{0}'
cs: Zadaný regulární výraz je neplatný. {0}
de: Der angegebene Regex ist ungültig. "{0}"
es: La expresión regular especificada no es válida. '{0}'
fr: L’expression régulière spécifiée n’est pas valide. « {0} »
it: L'espressione regolare specificata non è valida. '{0}'
ja: 指定された正規表現が無効です。'{0}'
ko: 지정한 regex가 잘못되었습니다. '{0}'
pl: Określone wyrażenie regularne jest nieprawidłowe. „{0}”
pt_br: O regex especificado é inválido. '{0}'
ru: Указанное регулярное выражение недопустимо. "{0}"
tr: Belirtilen normal ifade geçersiz. ''{0}”
zh_hans: 指定的正则表达式无效。“{0}”
zh_hant: 指定的 RegEx 無效。'{0}'

# InvalidRegexGeneratorAttributeMessage
source: The RegexGeneratorAttribute is malformed
cs: Atribut RegexGeneratorAttribute je nesprávný.
de: Das RegexGeneratorAttribute ist falsch formatiert.
es: RegexGeneratorAttribute tiene un formato incorrecto
fr: RegexGeneratorAttribute est malformé
it: RegexGeneratorAttribute non è valido
ja: RegexGeneratorAttribute の形式に誤りがあります
ko: RegexGeneratorAttribute의 형식이 잘못되었습니다.
pl: Atrybut RegexGeneratorAttribute jest źle sformułowany
pt_br: O RegexGeneratorAttribute está malformado
ru: Ошибка в регулярном выражении RegexGeneratorAttribute
tr: RegexGeneratorAttribute hatalı biçimlendirilmiş
zh_hans: RegexGeneratorAttribute 格式不正确
zh_hant: RegexGeneratorAttribute 格式錯誤

# InvalidRegexGeneratorAttributeTitle
source: Invalid RegexGenerator usage
cs: Neplatné použití RegexGenerator
de: Ungültige RegexGenerator-Verwendung
es: Uso de RegexGenerator no válido
fr: Utilisation de RegexGenerator non valide
it: Utilizzo di RegexGenerator non valido
ja: RegexGenerator の使用法が無効です
ko: 잘못된 RegexGenerator 사용
pl: Nieprawidłowe użycie atrybutu RegexGenerator
pt_br: Uso Inválido do RegexGenerator
ru: Недопустимое использование RegexGenerator
tr: Geçersiz RegexGenerator kullanımı
zh_hans: 无效的 RegexGenerator 用法
zh_hant: 無效的 RegexGenerator 使用方式

# InvalidUnicodePropertyEscape
source: Incomplete \\p{X} character escape.
cs: Neúplné uvození znaků \\p{X}.
de: Unvollständiges \\p{X}-Escape-Zeichen.
es: Escape de caracteres \\p{X} incompleto.
fr: Échappement de caractère \\p{X} incomplet.
it: Sequenza di caratteri di escape \\p{X} incompleta.
ja: 不完全な \\p{X} 文字エスケープです。
ko: \\p{X} 문자 이스케이프가 완전하지 않습니다.
pl: Niekompletny znak ucieczki \\p{X}.
pt_br: Caractere de escape \\p{X} incompleto.
ru: Неполная esc-последовательность \\p{X}.
tr: Tamamlanmamış \\p{X} karakter kaçışı.
zh_hans: 不完整的 \\p{X} 字符转义。
zh_hant: 不完整的 \\p{X} 逸出字元。

# LengthNotNegative
source: Length cannot be less than 0 or exceed input length.
cs: Délka nemůže být menší než 0 nebo přesáhnout délku vstupu.
de: Die Länge darf nicht kleiner als 0 sein oder die Eingabelänge überschreiten.
es: La longitud no puede ser inferior a 0 ni superar la longitud de entrada.
fr: La longueur ne peut pas être inférieure à 0 ou supérieure à la longueur d'entrée.
it: Lenght non può essere minore di zero o superare la lunghezza di input.
ja: 長さを 0 未満に設定したり、入力の長さを超えることはできません。
ko: 길이는 0보다 작거나 입력 길이를 초과할 수 없습니다.
pl: Długość nie może być mniejsza od 0 ani przekraczać długości danych wejściowych.
pt_br: Comprimento não pode ser menor que 0 ou exceder o comprimento de entrada.
ru: Длина не может быть меньше 0 или превышать длину ввода.
tr: Uzunluk sıfırdan küçük olamaz ve giriş uzunluğunu aşamaz.
zh_hans: 长度不能小于 0 或超过输入长度。
zh_hant: 長度不能小於零或超過輸入長度。

# MakeException
source: Invalid pattern '{0}' at offset {1}. {2}
cs: Neplatný vzor {0} u posunu {1}. {2}
de: Ungültiges Muster "{0}" bei Offset {1}. {2}
es: Patrón '{0}' no válido en el desplazamiento {1}. {2}
fr: Modèle « {0} » non valide au niveau du décalage {1}. {2}
it: Criterio '{0}' non valido alla posizione di offset {1}. {2}
ja: オフセット {1} に無効なパターン '{0}' があります。{2}
ko: 오프셋 {1}에서 잘못된 패턴 '{0}'. {2}
pl: Nieprawidłowy wzorzec „{0}” przy przesunięciu {1}. {2}
pt_br: Padrão inválido '{0}' no deslocamento {1}. {2}
ru: Недопустимый шаблон "{0}" со смещением {1}. {2}
tr: {1} ofsetinde geçersiz “{0}” deseni. {2}
zh_hans: 偏移 {0} 处的模式“{1}”无效。{2}
zh_hant: 位移 {1} 的模式 '{0}' 無效。{2}

# MalformedNamedReference
source: Malformed \\k<...> named back reference.
cs: Chybně naformátovaný pojmenovaný zpětný odkaz \\k<...>.
de: Falsch formatierter \\k<...> benannter Rückverweis.
es: Referencia inversa \\k<...> con nombre en formato incorrecto.
fr: Référence arrière nommée \\k<...> maformée.
it: Il backreference denominato \\k<...> non è valido.
ja: 形式に誤りがある \\k<...> 名前付き逆参照です。
ko: \\k<...> 역참조 형식이 잘못되었습니다.
pl: Źle sformułowany znak \\k<...> nazwany odwołaniem wstecznym.
pt_br: Referência inversa \\k<...> mal formada.
ru: Искажена именованная обратная ссылка \\k<...>.
tr: Hatalı biçimlendirilmiş \\k<...> adlı geri başvuru.
zh_hans: 名为“向后引用”的 \\k<...> 格式不正确。
zh_hant: 格式錯誤 \\k<...> 命名的反向參考。

# MalformedUnicodePropertyEscape
source: Malformed \\p{X} character escape.
cs: Chybně formátovaná řídicí sekvence znaků \\p{X}.
de: Falsch formatiertes \\p{X}-Escape-Zeichen.
es: Escape de caracteres \\p{X} con formato incorrecto.
fr: Échappement de caractère \\p{X} malformé.
it: Sequenza di caratteri di escape \\p{X} non valida.
ja: 形式に誤りがある \\p{X} エスケープ文字です。
ko: \\p{X} 문자 이스케이프 형식이 잘못되었습니다.
pl: Źle sformułowany znak ucieczki \\p{X}.
pt_br: Caractere de escape \\p{X} mal formado.
ru: Неверный формат esc-последовательности \\p{X}.
tr: Hatalı biçimlendirilmiş \\p{X} karakter kaçışı.
zh_hans: 格式不正确的 \\p{X} 字符转义。
zh_hant: 格式錯誤的 \\p{X} 逸出字元。

source: Missing control character.
cs: Řídicí znak chybí.
de: Fehlendes Steuerzeichen.
es: Falta el carácter de control.
fr: Caractère de contrôle manquant.
it: Carattere di controllo mancante.
ja: 制御文字がありません。
ko: 제어 문자가 없습니다.
pl: Brak znaku kontrolnego.
pt_br: Caractere de controle ausente.
ru: Отсутствует управляющий символ.
tr: Eksik denetim karakteri.
zh_hans: 缺少控制字符。
zh_hant: 缺少控制字元。
