Repository: dotnet/runtime
Catalog: src/libraries/System.Runtime.InteropServices/gen/Common/Resources/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# InvalidGeneratedComClassAttributeUsageMissingPartialModifier
source: Class '{0}' with 'GeneratedComClassAttribute' or one of its containing types is not marked 'partial'.
cs: Třída {0} s atributem GeneratedComClassAttribute nebo jedním z jejích obsahujících typů není označen klíčovým slovem partial.
de: Die Klasse '{0}' mit 'GeneratedComClassAttribute' oder einer der sie enthaltenden Typen ist nicht als 'partiell' gekennzeichnet.
es: La clase "{0}" con "GeneratedComClassAttribute" o uno de sus tipos contenedores no está marcada como "partial".
fr: La classe « {0} » avec « GeneratedComClassAttribute » ou l’un de ses types conteneurs n’est pas marqué comme « partielle ».
it: La classe '{0}' con 'GeneratedComClassAttribute' o uno dei tipi che lo contengono non è contrassegnata come 'partial'.
ja: 'GeneratedComClassAttribute' を含むクラス '{0}'、またはそのクラスを含む型の 1 つが 'partial' としてマークされていません。
ko: 'GeneratedComClassAttribute'가 있는 클래스 '{0}' 또는 포함된 형식 중 하나가 'partial'로 표시되어 있지 않습니다.
pl: Klasa „{0}” z atrybutem „GeneratedComClassAttribute” lub jeden z jej typów zawierających nie jest oznaczony jako „częściowy”.
pt_br: A classe "{0}" com "GeneratedComClassAttribute" ou um de seus tipos contidos não está marcada como "parcial".
ru: Класс "{0}" с "GeneratedComClassAttribute" или один из его содержащих типов не помечен как "частичный".
tr: 'GeneratedComClassAttribute' veya bunun kapsayan türlerinden birini içeren '{0}' sınıfı 'kısmi' olarak işaretli değil.
zh_hans: 具有“GeneratedComClassAttribute”或其包含类型之一的类“{0}”未标记为“部分”。
zh_hant: 具有 'GeneratedComClassAttribute' 或其中一個包含類型的類別 '{0}' 未標示為 'partial'。

# InvalidGeneratedComClassAttributeUsageTitle
source: Invalid 'GeneratedComClassAttribute' usage
cs: Neplatné použití GeneratedComClassAttribute
de: Ungültige Verwendung von "GeneratedComClassAttribute"
es: Uso de "GeneratedComClassAttribute" no válido
fr: Utilisation de 'GeneratedComClassAttribute' non valide
it: Utilizzo di 'GeneratedComClassAttribute' non valido
ja: 'GeneratedComClassAttribute' の使用法が無効です
ko: 'GeneratedComClassAttribute' 사용이 잘못되었습니다.
pl: Nieprawidłowe użycie elementu „GeneratedComClassAttribute”
pt_br: Uso inválido de 'GeneratedComClassAttribute'
ru: Недопустимое использование "GeneratedComClassAttribute"
tr: Geçersiz 'GeneratedComClassAttribute' kullanımı
zh_hans: “GeneratedComClassAttribute”用法无效
zh_hant: 'GeneratedComClassAttribute' 使用方式無效

# InvalidGeneratedComInterfaceAttributeUsageDescription
source: Interfaces attributed with 'GeneratedComInterfaceAttribute' must have 'public' or 'internal' accessibility and be partial, non-generic, and must specify a GUID with 'System.Runtime.InteropServices.GuidAttribute'.
cs: Rozhraní s atributem GeneratedComInterfaceAttribute musí mít přístupnost public nebo internal a musí být částečná, neobecná a musí určovat identifikátor GUID s atributem System.Runtime.InteropServices.GuidAttribute.
de: Schnittstellen, die mit 'GeneratedComInterfaceAttribute' attributiert sind, müssen über 'public' oder 'internal' verfügen und teilweise, nicht generisch sein und eine GUID mit 'System.Runtime.InteropServices.GuidAttribute' angeben.
es: Las interfaces con atributos "GeneratedComInterfaceAttribute" deben tener accesibilidad "publica" o "interna" y ser parciales, no genéricas, y deben especificar un GUID con "System.Runtime.InteropServices.GuidAttribute".
fr: Les interfaces attribuées avec 'GeneratedComInterfaceAttribute' doivent avoir une accessibilité 'publique' ou "interne" et être partielles, non génériques, et doivent spécifier un GUID avec 'System.Runtime.InteropServices.GuidAttribute'.
it: Le interfacce con attributo 'GeneratedComInterfaceAttribute' devono avere accessibilità "pubblica" o "interna" ed essere parziali, non generiche e devono specificare un GUID con 'System.Runtime.InteropServices.GuidAttribute'.
ja: 'GeneratedComInterfaceAttribute' の属性を持つインターフェイスは、'public' または 'internal アクセシビリティを持ち、部分的で、非ジェネリックである必要があり、'System.Runtime.InteropServices.GuidAttribute' で GUID を指定する必要があります。
ko: 'GeneratedComInterfaceAttribute'로 특성이 지정된 인터페이스에는 'public' 또는 'internal' 접근성이 있어야 하며 부분적이고 제네릭이 아니어야 하며 'System.Runtime.InteropServices.GuidAttribute'를 사용하여 GUID를 지정해야 합니다.
pl: Interfejsy z atrybutem „GeneratedComInterfaceAttribute” muszą mieć ułatwienia dostępu „publiczny” lub „wewnętrzny”, muszą być częściowe, nie być ogóle, i muszą określać identyfikator GUID z atrybutem „System.Runtime.InteropServices.GuidAttribute”.
pt_br: As interfaces atribuídas com 'GeneratedComInterfaceAttribute' devem ter acessibilidade 'pública' ou 'interna' e ser parciais, não genéricas e devem especificar um GUID com 'System.Runtime.InteropServices.GuidAttribute'.
ru: Интерфейсы с атрибутом GeneratedComInterfaceAttribute должны обеспечивать уровень доступности public или internal, быть частичными, не универсальными и должны указывать GUID с помощью System.Runtime.InteropServices.GuidAttribute.
tr: 'GeneratedComInterfaceAttribute' özniteliğine sahip arabirimler 'public' veya 'internal' erişilebilirlik özelliğine sahip olmalı, kısmi olmalı, genel olmamalı ve 'System.Runtime.InteropServices.GuidAttribute' ile bir GUID belirtmelidir.
zh_hans: 通过 "GeneratedComInterfaceAttribute" 特性化的接口必须具有 "public" 或 "internal" 可访问性，必须是部分的、非泛型的，并且必须使用 "System.Runtime.InteropServices.GuidAttribute" 指定 GUID。
zh_hant: 屬性為 'GeneratedComInterfaceAttribute' 的介面必須具有 'public' 或 'internal' 存取範圍，且是部分的非泛型介面，且必須使用 'System.Runtime.InteropServices.GuidAttribute' 指定 GUID。

# InvalidGeneratedComInterfaceAttributeUsageInterfaceIsGeneric
source: Interface '{0}' is attributed with 'GeneratedComInterfaceAttribute' but is generic.
cs: Rozhraní „{0}“ má atribut GeneratedComInterfaceAttribute, ale je obecné.
de: Die Schnittstelle "{0}" wird mit "GeneratedComInterfaceAttribute" attributiert, ist aber generisch.
es: La interfaz “{0}” tiene el atributo ”GeneratedComInterfaceAttribute”, pero es genérica.
fr: L’interface '{0}' est attribuée à 'GeneratedComInterfaceAttribute', mais est générique.
it: L'interfaccia '{0}' ha l'attributo 'GeneratedComInterfaceAttribute' ma è generico.
ja: インターフェイス '{0}' は 'GeneratedComInterfaceAttribute' で属性付けされていますが、ジェネリックです。
ko: '{0}' 인터페이스는 'GeneratedComInterfaceAttribute'로 특성이 지정되지만 제네릭입니다.
pl: Interfejs „{0}” ma atrybut „GeneratedComInterfaceAttribute”, ale jest ogólny.
pt_br: A interface "{0}" é atribuída com "GeneratedComInterfaceAttribute", mas é genérica.
ru: Интерфейс "{0}" использует атрибут GeneratedComInterfaceAttribute, но является универсальным.
tr: '{0}' 'GeneratedComInterfaceAttribute' özniteliğine sahip ancak genel.
zh_hans: “{0}”接口通过 "GeneratedComInterfaceAttribute" 特性化，但为泛型接口。
zh_hant: 介面 '{0}' 的屬性為 'GeneratedComInterfaceAttribute'，但為泛型介面。

# InvalidGeneratedComInterfaceAttributeUsageInterfaceNotAccessible
source: Interface '{0}' is attributed with 'GeneratedComInterfaceAttribute' but is not accessible by generated code. The interface and all containing types must have accessibility 'internal' or 'public' for generated code to access it. {1}
cs: Rozhraní „{0}“ má atribut „GeneratedComInterfaceAttribute“, ale není přístupný přes generovaný kód. Rozhraní a všechny obsahující typy musí mít přístupnost „internal“ nebo „public“, aby k němu vygenerovaný kód mohl přistupovat. {1}
de: Die Schnittstelle '{0}' ist mit 'GeneratedComInterfaceAttribute' attributiert, kann aber nicht durch generierten Code zugegriffen werden. Die Schnittstelle und alle enthaltenden Typen müssen über den Zugriff 'internal' oder 'public' verfügen, damit generierter Code darauf zugreifen kann. {1}
es: La interfaz '{0}' tiene el atributo 'GeneratedComInterfaceAttribute', pero el código generado no puede acceder a ella. La interfaz y todos los tipos contenedores deben tener accesibilidad "interna" o "publico" para que el código generado tenga acceso a ella. {1}
fr: L’interface '{0}' est attribuée à 'GeneratedComInterfaceAttribute' mais n’est pas accessible par le code généré. L’interface et tous les types contenants doivent avoir l’accessibilité 'interne' ou 'publique' pour que le code généré y accède. {1}
it: '{0}' dell'interfaccia è con attributo 'GeneratedComInterfaceAttribute' ma non è accessibile dal codice generato. L'interfaccia e tutti i tipi contenitore devono avere l'accessibilità "interna" o "pubblica" per consentire al codice generato di accedervi. {1}
ja: インターフェイス '{0}' には 'GeneratedComInterfaceAttribute' 属性が設定されていますが、生成されたコードからはアクセスできません。生成されたコードがこのインターフェイスとそのすべての包含型にアクセスするには、アクセシビリティ 'internal' または 'public' が必要です。{1}
ko: 인터페이스 '{0}'은(는) 'GeneratedComInterfaceAttribute'로 특성이 지정되었지만 생성된 코드에서 액세스할 수 없습니다. 인터페이스와 포함된 모든 형식에는 액세스하기 위해 생성된 코드에 대한 접근성 'internal' 또는 'public'이 있어야 합니다. {1}
pl: Interfejs „{0}” ma atrybut „GeneratedComInterfaceAttribute”, ale nie jest dostępny za pomocą wygenerowanego kodu. Interfejs i wszystkie zawierające go typy muszą mieć ułatwienia dostępu „wewnętrzny” lub „publiczny”, aby wygenerowany kod mógł uzyskać do niego dostęp. {1}
pt_br: A interface '{0}' é atribuída com 'GeneratedComInterfaceAttribute', mas não é acessível pelo código gerado. A interface e todos os tipos de conteúdo devem ter acessibilidade 'interna' ou 'pública' para que o código gerado possa acessá-lo. {1}
ru: Интерфейс "{0}" содержит атрибут GeneratedComInterfaceAttribute, но недоступен с помощью созданного кода. Для доступа с помощью созданного кода к интерфейсу и всем содержащим типам они должны обеспечивать уровень доступности internal или public. {1}
tr: '{0}' arabirimi 'GeneratedComInterfaceAttribute' özniteliğine sahip ancak oluşturulan kod ile bu arabirime erişilemiyor. Arabirim ve tüm kapsayan türler, oluşturulan kodun bu arabirime erişebilmesi için 'internal' veya 'public' erişilebilirlik özelliğine sahip olmalıdır. {1}
zh_hans: 接口 "GeneratedComInterfaceAttribute" 通过“{0}”进行特性化，但生成的代码无法访问它。该接口和所有包含类型必须具有 "internal" 或 "public" 可访问下，生成的代码才能访问它。{1}
zh_hant: 介面 '{0}' 的屬性為 'GeneratedComInterfaceAttribute'，但無法由產生的程式碼存取。介面和所有包含的類型的必須具有 'internal' 或 'public' 存取範圍，產生的程式碼才能存取它。{1}

# InvalidGeneratedComInterfaceAttributeUsageMissingGuidAttribute
source: Interface '{0}' is attributed with 'GeneratedComInterfaceAttribute' but is missing 'System.Runtime.InteropServices.GuidAttribute'.
cs: Rozhraní {0} má atribut GeneratedComInterfaceAttribute, ale chybí atribut System.Runtime.InteropServices.GuidAttribute.
de: Die Schnittstelle „{0}“ ist mit „GeneratedComInterfaceAttribute“ attribuiert, aber „System.Runtime.InteropServices.GuidAttribute“ fehlt.
es: La interfaz '{0}' tiene atribuido 'GeneratedComInterfaceAttribute', pero falta 'System.Runtime.InteropServices.GuidAttribute'.
fr: L’interface « {0} » est attribuée à « GeneratedComInterfaceAttribute » mais « System.Runtime.InteropServices.GuidAttribute » est manquant.
it: L'interfaccia '{0}' è attribuita con 'GeneratedComInterfaceAttribute' ma 'System.Runtime.InteropServices.GuidAttribute' è mancante.
ja: インターフェイス '{0}' の属性は 'GeneratedComInterfaceAttribute' ですが、'System.Runtime.InteropServices.GuidAttribute' がありません。
ko: 인터페이스 '{0}'에 'GeneratedComInterfaceAttribute'이(가) 지정되었지만 'System.Runtime.InteropServices.GuidAttribute'이(가) 누락되었습니다.
pl: Interfejs „{0}” ma atrybut „GeneratedComInterfaceAttribute”, ale brakuje atrybutu „System.Runtime.InteropServices.GuidAttribute”.
pt_br: A interface "{0}" é atribuída com "GeneratedComInterfaceAttribute", mas "System.Runtime.InteropServices.GuidAttribute" está ausente.
ru: Для "{0}" интерфейса указан атрибут GeneratedComInterfaceAttribute, но отсутствует атрибут System.Runtime.InteropServices.GuidAttribute.
tr: '{0}' arabirimi 'GeneratedComInterfaceAttribute' özniteliğine sahip ancak 'System.Runtime.InteropServices.GuidAttribute' eksik.
zh_hans: 接口“{0}”会通过 “GeneratedComInterfaceAttribute” 特性化，但缺少“System.Runtime.InteropServices.GuidAttribute”。
zh_hant: 介面 '{0}' 的屬性為 'GeneratedComInterfaceAttribute'，但遺漏 'System.Runtime.InteropServices.GuidAttribute'。

# InvalidGeneratedComInterfaceAttributeUsageTitle
source: Invalid 'GeneratedComInterfaceAttribute' usage.
cs: Neplatné použití atributu GeneratedComInterfaceAttribute
de: Ungültige Verwendung von "GeneratedComInterfaceAttribute".
es: Uso de 'GeneratedComInterfaceAttribute' no válido.
fr: Utilisation de « GeneratedComInterfaceAttribute » non valide.
it: Utilizzo di 'GeneratedComInterfaceAttribute' non valido.
ja: 'GeneratedComInterfaceAttribute' の使用法が無効です。
ko: 잘못된 'GeneratedComInterfaceAttribute' 사용법입니다.
pl: Nieprawidłowe użycie atrybutu „GeneratedComInterfaceAttribute”.
pt_br: Uso de "GeneratedComInterfaceAttribute" inválido.
ru: Недопустимое применение GeneratedComInterfaceAttribute.
tr: Geçersiz 'GeneratedComInterfaceAttribute' kullanımı.
zh_hans: “GeneratedComInterfaceAttribute” 使用无效。
zh_hant: 無效的 'GeneratedComInterfaceAttribute' 使用方式。

# InvalidGeneratedComInterfaceUsageMissingPartialModifier
source: The interface '{0}' or one of its containing types is missing the 'partial' keyword. Code will not be generated for '{0}'.
cs: V rozhraní „{0}“ nebo jednom z jeho obsahujících typů chybí klíčové slovo „partial“. Pro „{0}“ se nevygeneruje kód.
de: In der Schnittstelle "{0}" oder einem der enthaltenden Typen fehlt das Schlüsselwort "Partiell". Für "{0}" wird kein Code generiert.
es: Falta la palabra clave 'partial' en la interfaz '{0}' o en uno de sus tipos contenedores. No se generará código para '{0}'.
fr: Le mot clé 'partial' est manquant dans l’interface '{0}' ou l’un de ses types conteneurs. Le code ne sera pas généré pour '{0}'.
it: Nell'interfaccia '{0}' o in uno dei tipi che lo contengono manca la parola chiave 'partial'. Il codice non verrà generato per '{0}'.
ja: インターフェイス '{0}' またはそのインターフェイスを含む型の 1 つに 'partial' キーワードがありません。'{0}' のコードは生成されません。
ko: '{0}' 인터페이스 또는 해당 포함된 형식 중 하나에 'partial' 키워드가 없습니다. '{0}'에 대한 코드가 생성되지 않습니다.
pl: W interfejsie „{0}” lub jednym z jego typów zawierających brakuje słowa kluczowego „partial”. Kod nie zostanie wygenerowany dla „{0}”.
pt_br: A interface '{0}' ou um de seus tipos contém a palavra-chave 'parcial' ausente. O código não será gerado para '{0}'.
ru: В интерфейсе "{0}" или одном из его содержащих типов отсутствует ключевое слово "partial". Код не будет создан для "{0}".
tr: '{0}' arabirimi veya kapsayan türlerden birinde 'partial' anahtar sözcüğü eksik. '{0}' için kod üretilmeyecek.
zh_hans: 接口“{0}”或其包含类型之一缺少“partial”关键字。不会为“{0}”生成代码。
zh_hant: 介面 '{0}' 或其中一個包含類型的介面遺漏 'partial' 關鍵字。將不會為 '{0}' 產生程式碼。

# InvalidLibraryImportAttributeUsageTitle
source: Invalid 'LibraryImportAttribute' usage
cs: Neplatné použití atributu LibraryImportAttribute
de: Ungültige Verwendung von "LibraryImportAttribute"
es: Uso de “LibraryImportAttribute” no válido
fr: Utilisation de « LibraryImportAttribute » non valide
it: Utilizzo di 'LibraryImportAttribute' non valido
ja: 'LibraryImportAttribute' の使用状況が無効です
ko: 잘못된 'LibraryImportAttribute' 사용
pl: Nieprawidłowe użycie atrybutu „LibraryImportAttribute”
pt_br: Uso de 'LibraryImportAttribute' inválido
ru: Недопустимое использование "LibraryImportAttribute"
tr: Geçersiz 'LibraryImportAttribute' kullanımı
zh_hans: “LibraryImportAttribute” 用法无效
zh_hant: 'LibraryImportAttribute' 使用方式無效

# InvalidManagedTypeTitle
source: Specified managed type is invalid
cs: Zadaný spravovaný typ je neplatný
de: Der angegebene verwaltete Typ ist ungültig.
es: El tipo administrado especificado no es válido
fr: Le type managé spécifié n’est pas valide
it: Il tipo gestito specificato non è valido
ja: 指定されたマネージド型が無効です
ko: 지정된 관리 유형이 잘못되었습니다.
pl: Określony typ zarządzany jest nieprawidłowy
pt_br: O tipo gerenciado especificado é inválido
ru: Указан недопустимый управляемый тип
tr: Belirtilen yönetilen tür geçersiz
zh_hans: 指定的托管类型无效
zh_hant: 指定的受控類型無效

# InvalidMarshalModeTitle
source: Invalid 'MarshalMode' value.
cs: Neplatná hodnota „MarshalMode“.
de: Ungültiger Wert für "MarshalMode"
es: Valor 'MarshalMode' no válido.
fr: Valeur 'MarshalMode' non valide.
it: Valore 'MarshalMode' non valido.
ja: 'MarshalMode' 値が無効です。
ko: 'MarshalMode' 값이 잘못되었습니다.
pl: Nieprawidłowa wartość „MarshalMode”.
pt_br: Valor 'MarshalMode' inválido.
ru: Недопустимое значение "MarshalMode".
tr: Geçersiz 'MarshalMode' değeri.
zh_hans: “MarshalMode”值无效。
zh_hant: 'MarshalMode' 值無效。

# InvalidMarshallerTypeTitle
source: Specified marshaller type is invalid
cs: Zadaný zařazovací typ je neplatný
de: Der angegebene Marshallertyp ist ungültig.
es: El tipo de serializador especificado no es válido
fr: Le type de marshaleur spécifié n’est pas valide
it: Il tipo di marshaller specificato non è valido
ja: 指定されたマーシャラー型が無効です
ko: 지정된 마샬러 유형이 잘못되었습니다.
pl: Określony typ marshallera jest nieprawidłowy
pt_br: O tipo de empacotador especificado é inválido
ru: Указан недопустимый тип маршалера
tr: Belirtilen hazırlayıcı türü geçersiz
zh_hans: 指定的封送处理程序类型无效
zh_hant: 指定的封送處理器類型無效

# InvalidNativeMarshallingAttributeUsageTitle
source: Invalid 'NativeMarshallingAttribute' usage
cs: Neplatné použití atributu NativeMarshallingAttribute
de: Ungültige Verwendung von "NativeMarshallingAttribute"
es: Uso de "NativeMarshallingAttribute" no válido
fr: Utilisation de 'NativeMarstribuingAttribute' non valide
it: Utilizzo di 'NativeMarshallingAttribute' non valido
ja: 'NativeMarshallingAttribute' の使用状況が無効です
ko: 잘못된 'NativeMarshallingAttribute' 사용
pl: Nieprawidłowe użycie atrybutu „NativeMarshallingAttribute”
pt_br: Uso de 'NativeMarshallingAttribute' inválido
ru: Недопустимое использование "NativeMarsingAttribute"
tr: Geçersiz 'NativeMarshallingAttribute' kullanımı
zh_hans: “NativeMarshallingAttribute”用法无效
zh_hant: 'NativeMarshallingAttribute' 使用方式無效

# InvalidOptionsOnInterfaceDescription
source: The specified 'ComInterfaceOptions' are invalid.
cs: Zadaný parametr ComInterfaceOptions není platný.
de: Die angegebenen 'ComInterfaceOptions' sind ungültig.
es: El elemento ''ComInterfaceOptions'' especificado no es válido.
fr: Les 'ComInterfaceOptions' spécifiées ne sont pas valides.
it: L’elemento 'ComInterfaceOptions' specificato non è valido.
ja: 指定された 'ComInterfaceOptions' が無効です。
ko: 지정한 'ComInterfaceOptions'가 잘못되었습니다.
pl: Określone opcje „ComInterfaceOptions” są nieprawidłowe.
pt_br: As 'ComInterfaceOptions' especificadas são inválidas.
ru: Указанный параметр "ComInterfaceOptions" недопустим.
tr: Belirtilen 'ComInterfaceOptions' geçersiz.
zh_hans: 指定的 "ComInterfaceOptions" 无效。
zh_hant: 指定的 'ComInterfaceOptions' 無效。

# InvalidOptionsOnInterfaceMessage
source: The specified 'ComInterfaceOptions' on '{0}' are invalid. {1}
cs: Zadaný parametr ComInterfaceOptions pro {0} není platný. {1}
de: Die angegebenen 'ComInterfaceOptions' auf '{0}' sind ungültig. {1}
es: El elemento ''ComInterfaceOptions'' especificado en ''{0}'' no es válido. {1}
fr: Les 'ComInterfaceOptions' spécifiées sur « {0} » ne sont pas valides. {1}
it: L’elemento 'ComInterfaceOptions' specificato in '{0}' non è valido. {1}
ja: '' で指定された '{0}' の 'ComInterfaceOptions' が無効です。{1}
ko: '{0}'에 지정한 'ComInterfaceOptions'가 잘못되었습니다. {1}
pl: Określone opcje „ComInterfaceOptions” w „{0}” są nieprawidłowe. {1}
pt_br: As 'ComInterfaceOptions' especificadas em '{0}' são inválidas. {1}
ru: Указанный параметр "ComInterfaceOptions" в "{0}" недопустим. {1}
tr: '{0}' üzerinde 'ComInterfaceOptions' geçersiz. {1}
zh_hans: “{0}”上指定的 "ComInterfaceOptions" 无效。{1}
zh_hant: '{0}' 上指定的 'ComInterfaceOptions' 無效。{1}

# InvalidSignaturesInMarshallerShapeTitle
source: Marshaller type has incompatible method signatures
cs: Zařazovací typ má nekompatibilní signatury metod
de: Der Marshaller-Typ weist inkompatible Methodensignaturen auf
es: El tipo de serializador tiene firmas de método incompatibles
fr: Le type Marshaller a des signatures de méthode incompatibles
it: Il tipo marshaller ha firme di metodo incompatibili
ja: マーシャラー型に互換性のないメソッド シグネチャがあります
ko: 마샬러 형식에 호환되지 않는 메서드 시그니처가 있습니다.
pl: Typ marshallera ma niezgodne sygnatury metody
pt_br: O tipo de marshaller tem assinaturas de método incompatíveis
ru: Тип маршалер имеет несовместимые сигнатуры методов
tr: Sıralayıcı türü uyumsuz metot imzaları içeriyor
zh_hans: 封送程序类型具有不兼容的方法签名
zh_hant: 封送處理器類型有不相容的方法簽章

# InvalidStringMarshallingConfigurationDescription
source: The configuration of 'StringMarshalling' and 'StringMarshallingCustomType' is invalid.
cs: Konfigurace StringMarshalling a StringMarshallingCustomType je neplatná.
de: Die Konfiguration von \"StringMarshalling\" und \"StringMarshallingCustomType\" ist ungültig.
es: La configuración de “StringMarshalling” y “StringMarshallingCustomType” no es válida.
fr: La configuration de « StringMarshalling » et de « StringMarshallingCustomType » n’est pas valide.
it: La configurazione di 'StringMarshalling' e 'StringMarshallingCustomType' non è valida.
ja: 'StringMarshalling' と 'StringMarshallingCustomType' の構成が無効です。
ko: 'StringMarshalling' 및 'StringMarshallingCustomType'의 구성이 잘못되었습니다.
pl: Konfiguracja elementów „StringMarshalling” i „StringMarshallingCustomType” jest nieprawidłowa.
pt_br: A configuração de 'StringMarshalling' e 'StringMarshallingCustomType' é inválida.
ru: Конфигурация \"StringMarshalling\" и \"StringMarshallingCustomType\" недопустима.
tr: 'StringMarshalling' ve 'StringMarshallingCustomType' yapılandırması geçersiz.
zh_hans: “StringMarshalling” 和 “StringMarshallingCustomType” 的配置无效。
zh_hant: 'StringMarshalling' 和 'StringMarshallingCustomType' 的設定無效。

# InvalidStringMarshallingConfigurationMessageCom
source: The configuration of 'StringMarshalling' and 'StringMarshallingCustomType' on interface '{0}' is invalid. {1}
cs: Konfigurace „StringMarshalling“ a „StringMarshallingCustomType“ v rozhraní „{0}“ je neplatná. {1}
de: Die Konfiguration von "StringMarshalling" und "StringMarshallingCustomType" für die Schnittstelle "{0}" ist ungültig. {1}
es: La configuración de "StringMarshalling" y "StringMarshallingCustomType" en la interfaz "{0}" no es válida. {1}
fr: La configuration de « StringMarshalling » et de « StringMarshallingCustomType » n’est sur l’interface ’{0}’ pas valide. {1}
it: La configurazione di 'StringMarshalling' e 'StringMarshallingCustomType' nell’interfaccia '{0}' non è valida. {1}
ja: インターフェイス '{0}' の 'StringMarshalling' および 'StringMarshallingCustomType' の構成が無効です。 {1}
ko: '{0}' 인터페이스의 'StringMarshalling' 및 'StringMarshallingCustomType' 구성이 잘못되었습니다. {1}
pl: Konfiguracja elementów „StringMarshalling” i „StringMarshallingCustomType” w interfejsie „{0}” jest nieprawidłowa. {1}
pt_br: A configuração de 'StringMarshalling' e 'StringMarshallingCustomType' na interface '{0}' é inválida. {1}
ru: Конфигурация "StringMarshalling" и "StringMarshallingCustomType" в интерфейсе "{0}" недопустима. {1}
tr: '{0}' arabirimindeki 'StringMarshalling' ve 'StringMarshallingCustomType' yapılandırması geçersiz. {1}
zh_hans: 接口 "{0}" 上的 "StringMarshalling" 和 "StringMarshallingCustomType" 的配置无效。{1}
zh_hant: 介面 '{0}' 上的 'StringMarshalling' 和 'StringMarshallingCustomType' 設定無效。{1}
