Repository: dotnet/runtime
Catalog: src/libraries/System.Runtime.InteropServices/gen/Common/Resources/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# MarshallerTypeMustBeStaticClassOrStruct
source: The marshaller type '{0}' for managed type '{1}' must be a static class or a struct.
cs: Typ zařazovače {0} pro spravovaný typ {1} musí být statický.
de: Der Marshallertyp '{0}' für den verwalteten Typ '{1}' muss eine statische Klasse oder eine Struktur sein.
es: El tipo de serializador "{0}" para el tipo administrado "{1}" debe ser una clase estática o un struct.
fr: Le type marshaleur « {0} » pour le type managé « {1} » doit être une classe statique ou un struct.
it: Il tipo di marshaller '{0}' per il tipo gestito '{1}' deve essere una classe statica o uno struct.
ja: マネージド型 '{1}' のマーシャラー型 '{0}' は、静的クラスまたは構造体である必要があります。
ko: 관리되는 형식 '{0}'의 마샬러 형식 '{1}'은(는) 정적 클래스 또는 구조체여야 합니다.
pl: Typ marshallera „{0}” dla typu zarządzanego „{1}” musi być statyczny.
pt_br: O tipo de empacotador '{0}' para o tipo gerenciado '{1}' deve ser uma classe estática ou uma estrutura.
ru: Тип маршаллера "{0}" для управляемого типа "{1}" должен быть статическим классом или структурой.
tr: Yönetilen '{1}' türü için hazırlayıcı türü '{0}' statik bir sınıf veya yapı olmalıdır.
zh_hans: 托管类型 "{1}" 的封送程序类型 "{0}" 必须为静态类或结构。
zh_hant: 受控型別 '{1}' 的封送處理器類型 '{0}' 必須是靜態類別或結構。

# MarshallerTypeMustBeStaticClassOrStructDescription
source: A marshaller type must either be a stateless static class or a stateful value type. A non-static class is not allowed.
cs: Typ zařazovače musí být bezstavová statická třída nebo stavový typ hodnoty. Nestatická třída není povolena.
de: Ein Marshallertyp muss entweder eine zustandslose statische Klasse oder ein zustandsbehafteter Werttyp sein. Eine nicht statische Klasse ist nicht zulässig.
es: Un tipo de serializador debe ser una clase estática sin estado o un tipo de valor con estado. No se permite una clase no estática.
fr: Un type de marshaleur doit être une classe statique sans état ou un type valeur avec état. Une classe non statique n’est pas autorisée.
it: Un tipo di marshaller deve essere una classe statica senza stato o un tipo di valore con stato. Una classe non statica non è consentita.
ja: マーシャラー型は、ステートレスな静的クラスまたはステートフルな値の型である必要があります。非静的クラスは使用できません。
ko: 마샬러 형식은 상태 비저장 정적 클래스 또는 상태 저장 값 형식이어야 합니다. 비정적 클래스는 사용할 수 없습니다.
pl: Typ organizatora musi być bezstanową klasą statyczną lub stanowym typem wartości. Klasa niestatyczna jest niedozwolona.
pt_br: Um tipo de marshaller deve ser uma classe estática sem estado ou um tipo de valor com estado. Uma classe não estática não é permitida.
ru: Тип маршалера должен быть статическим классом без сохранения состояния или типом значения с отслеживанием состояния. Нестатический класс не допускается.
tr: Sıralayıcı türü ya durum bilgisi olmayan bir statik sınıf ya da durum bilgisi olan bir değer türü olmalıdır. Statik olmayan sınıfa izin verilmez.
zh_hans: 封送程序类型必须为无状态静态类或有状态值类型。不允许使用非静态类。
zh_hant: 封送處理程式類型必須是無狀態靜態類型或具狀態的數值類型。不允許非靜態類型。

# MarshallerTypeMustBeStaticClassOrStructMessage
source: The type '{0}' must be a static class or a value type
cs: Typ {0} musí být statická třída nebo typ hodnoty.
de: Der Typ „{0}“ muss eine statische Klasse oder ein Werttyp sein
es: El tipo "{0}" debe ser una clase estática o un tipo de valor
fr: Le type '{0}' doit être une classe statique ou un type valeur
it: Il tipo '{0}' deve essere una classe statica o un tipo valore
ja: 型 '{0}' は静的クラスまたは値の型である必要があります
ko: '{0}' 형식은 정적 클래스 또는 값 형식이어야 합니다.
pl: Typ „{0}” musi być klasą statyczną lub typem wartości
pt_br: O tipo “{0}” deve ser uma classe estática ou um tipo de valor
ru: Тип "{0}" должен быть статическим классом или типом значения
tr: '{0}' türü statik bir sınıf veya değer türü olmalıdır
zh_hans: 类型“{0}”必须为静态类或值类型
zh_hant: 類型 '{0}' 必須是靜態類別或數值類型

# MarshallerTypeMustSpecifyManagedTypeDescription
source: A type with a 'System.Runtime.InteropServices.CustomMarshallerAttribute' must specify a non-'null' managed type
cs: Typ s atributem System.Runtime.InteropServices.CustomMarshallerAttribute musí určovat spravovaný typ, který nenabývá hodnoty null.
de: Ein Typ mit einem "System.Runtime.InteropServices.CustomMarshallerAttribute" muss einen verwalteten Typ, der nicht "NULL" ist, angeben
es: Un tipo con un "System.Runtime.InteropServices.CustomMarshallerAttribute" debe especificar un tipo administrado no nulo
fr: Un type avec un « System.Runtime.InteropServices.CustomMarshallerAttribute » doit spécifier un type managé non 'null'
it: Un tipo con 'System.Runtime.InteropServices.CustomMarshallerAttribute' deve specificare un tipo gestito diverso da 'null'
ja: 'System.Runtime.InteropServices.CustomMarshallerAttribute' を持つ型には、非 'null' のマネージド型を指定する必要があります
ko: 'System.Runtime.InteropServices.CustomMarshallerAttribute'가 있는 유형은 'null'이 아닌 관리 유형을 지정해야 합니다.
pl: Typ z atrybutem „System.Runtime.InteropServices.CustomMarshaellerAttribute” musi określać typ zarządzany inny niż „null”
pt_br: Um tipo com um 'System.Runtime.InteropServices.CustomMarshallerAttribute' deve especificar um tipo gerenciado não 'null'
ru: Тип с атрибутом "System.Runtime.InteropServices.CustomMarshallerAttribute" должен указывать управляемый тип, отличный от "NULL"
tr: 'System.Runtime.InteropServices.CustomMarshallerAttribute' değerine sahip bir tür, 'null' olmayan bir yönetilen tür belirtmelidir
zh_hans: 具有“System.Runtime.InteropServices.CustomMarshallerAttribute”的类型必须指定非空的托管类型
zh_hant: 具有 'System.Runtime.InteropServices.CustomMarshallerAttribute' 的類型必須指定非 Null 受控類型

# MarshallerTypeMustSpecifyManagedTypeMessage
source: The type '{0}' does not specify a managed type in the 'System.Runtime.InteropServices.CustomMarshallerAttribute' applied to the type
cs: Typ {0} neurčuje spravovaný typ v atributu System.Runtime.InteropServices.CustomMarshallerAttribute uplatněném na tento typ.
de: Der Typ "{0}" gibt keinen verwalteten Typ im "System.Runtime.InteropServices.CustomMarshallerAttribute" an, der auf den Typ angewendet wird
es: El tipo "{0}" no especifica un tipo administrado en el "System.Runtime.InteropServices.CustomMarshallerAttribute" aplicado al tipo
fr: Le type « {0} » ne spécifie pas de type managé dans « System.Runtime.InteropServices.CustomMarshallerAttribute » appliqué au type
it: Il tipo '{0}' non specifica un tipo gestito nell’elemento 'System.Runtime.InteropServices.CustomMarshallerAttribute' applicato al tipo
ja: 型 '{0}' は、型に適用される 'System.Runtime.InteropServices.CustomMarshallerAttribute' でマネージド型を指定しません
ko: 유형 '{0}'은(는) 유형에 적용된 'System.Runtime.InteropServices.CustomMarshallerAttribute'에서 관리되는 유형을 지정하지 않습니다.
pl: Typ „{0}” nie określa typu zarządzanego w atrybucie „System.Runtime.InteropServices.CustomTypeMarshallerAttribute” zastosowanym do typu
pt_br: O tipo '{0}' não especifica um tipo gerenciado no 'System.Runtime.InteropServices.CustomMarshallerAttribute' aplicado ao tipo
ru: Тип "{0}" не указывает управляемый тип в примененном к нему атрибуте "System.Runtime.InteropServices.CustomMarshallerAttribute"
tr: Tür '{0}', türe uygulanan 'System.Runtime.InteropServices.CustomMarshallerAttribute' içinde yönetilen bir tür belirtmiyor
zh_hans: 类型“{0}”未在应用于该类型的 “System.Runtime.InteropServices.CustomMarshallerAttribute”中指定托管类型
zh_hant: 類型 '{0}' 未在套用至類型的 'System.Runtime.InteropServices.CustomMarshallerAttribute' 中指定受控類型

# MarshallingBoolAsUndefinedNotSupported
source: Marshalling bool without explicit marshalling information is not supported. Specify either 'MarshalUsingAttribute' or 'MarshalAsAttribute'.
cs: Logická hodnota zařazování bez výslovných informací zařazování se nepodporuje. Určete buď MarshalUsingAttribute nebo MarshalAsAttribute.
de: Marshalling eines booleschen Werts ohne explizite Marshallinginformationen wird nicht unterstützt. Geben Sie entweder \"MarshalUsingAttribute\" oder \"MarshalAsAttribute\" an.
es: No se admite la serialización booleana sin información de serialización explícita. Especifique “MarshalUsingAttribute” o “MarshalAsAttribute”.
fr: Le marshaling bool sans informations de marshaling explicite n’est pas pris en charge. Spécifiez « MarshalUsingAttribute » ou « MarshalAsAttribute ».
it: Il marshalling del tipo di dati bool senza informazioni di marshalling esplicito non è supportato. Specificare 'MarshalUsingAttribute' o 'MarshalAsAttribute'.
ja: 明示的なマーシャリング情報を含まないブール値のマーシャリングはサポートされていません。'MarshalUsingAttribute' または 'MarshalAsAttribute' のいずれかを指定してください。
ko: 명시적 마샬링 정보가 없는 마샬링 bool은 지원되지 않습니다. 'MarshalUsingAttribute' 또는 'MarshalAsAttribute'를 지정하세요.
pl: Skierowanie wartości logicznej bez wyraźnych informacji o skierowaniu nie jest obsługiwane. Określ atrybut „MarshalUsingAttribute” lub atrybut „MarshalAsAttribute”.
pt_br: Não há suporte para marshalling bool sem informações de marshalling explícitas. Especifique 'MarshalUsingAttribute' ou 'MarshalAsAttribute'.
ru: Маршализация типа bool объекта без явного указания сведений маршализации не поддерживается. Укажите \"MarshalUsingAttribute\" или \"MarshalAsAttribute\".
tr: Açık sıralama bilgileri olmadan bool sıralama desteklenmiyor. 'MarshalUsingAttribute' veya 'MarshalAsAttribute' bilgilerini belirtin.
zh_hans: 不支持在没有显式封送信息的情况下封送布尔值。请指定 “MarshalUsingAttribute” 或 “MarshalAsAttribute”。
zh_hant: 不支援沒有明確排列資訊的封送處理布林值。指定 'MarshalUsingAttribute' 或 'MarshalAsAttribute'。

# MarshallingCharAsSpecifiedStringMarshallingNotSupported
source: Marshalling char with 'StringMarshalling.{0}' is not supported. Instead, manually convert the char type to the desired byte representation and pass to the source-generated P/Invoke.
cs: Zařazování datového typu char se StringMarshalling.{0} se nepodporuje. Místo toho ručně převeďte datový typ char na požadovanou bajtovou reprezentaci a předejte do zdrojem generovaného volání P/Invoke.
de: Das Marshalling von Zeichen mit „StringMarshalling.{0}“ wird nicht unterstützt. Konvertieren Sie stattdessen den Zeichentyp manuell in die gewünschte Bytedarstellung, und übergeben Sie diesen an P/Invoke, das von der Quelle generiert wurde.
es: No se admite la serialización de caracteres con \"StringMarshalling.{0}\". En su lugar, convierta manualmente el tipo de carácter en la representación de bytes deseada y pase al P/Invoke de generador de código fuente.
fr: Le marshaling de char avec « StringMarshalling.{0} » n’est pas pris en charge. Convertissez plutôt manuellement le type de caractère en représentation d’octet souhaitée et passez au P/Invoke généré par la source.
it: Il carattere di marshalling con 'StringMarshalling.{0}' non è supportato. Convertire invece manualmente il tipo carattere nella rappresentazione di byte desiderata e passare al P/Invoke generato dall'origine.
ja: 'StringMarshalling.{0}' を使用した文字のマーシャリングはサポートされていません。代わりに、手動で char 型を必要なバイト表現に変換し、ソース生成済みの P/Invoke に渡します。
ko: 'StringMarshalling.{0}을(를) 사용한 마샬링 문자는 지원되지 않습니다. 대신 char 형식을 원하는 바이트 표현으로 수동으로 변환하고 소스 생성 P/Invoke에 전달하세요.
pl: Znak marshallingu o wartości „StringMarshalling.{0}” nie jest obsługiwany. Zamiast tego ręcznie przekonwertuj typ znaków na żądaną reprezentację bajtów i przekaż do wygenerowanego źródła funkcji P/Invoke.
pt_br: Não há suporte para marshaling de caracteres com 'StringMarshalling.{0}'. Em vez disso, converta manualmente o tipo de caractere para a representação de byte desejada e passe para o P/Invoke gerado pela origem.
ru: Маршализация типа char с \"StringMarshalling.{0}\" не поддерживается. Вместо этого следует вручную преобразовать тип char в требуемое представление байтов и передать в P/Invoke с созданием источника.
tr: 'StringMarshalling.{0}' ile karakter sıralama desteklenmiyor. Bunun yerine, karakter türünü el ile istenen bayt gösterimine dönüştürerek kaynak tarafından oluşturulan P/Invoke'a geçirin.
zh_hans: 不支持使用 \"StringMarshalling.{0}\" 封送字符。请改用手动方式将字符类型转换为所需的字节表示形式，并传递到源生成的 P/Invoke。
zh_hant: 不支援具有 'StringMarshalling.{0}' 的封送字元。請改為手動將字元類型轉換為想要的位元組表示法，並傳遞至來源產生的 P/Invoke。

# MarshallingCharAsStringMarshallingCustomNotSupported
source: Marshalling char with 'StringMarshalling.Custom' is not supported. To use a custom type marshaller, specify 'MarshalUsingAttribute'.
cs: Zařazování datového typu char se StringMarshalling.Custom se nepodporuje. Pokud chcete použít zařazování vlastního typu, zadejte MarshalUsingAttribute.
de: Das Marshalling von Zeichen mit „StringMarshalling.Custom“ wird nicht unterstützt. Geben Sie „MarshalUsingAttribute“ an, um einen benutzerdefinierten Typ-Marshaller zu verwenden.
es: No se admite la serialización de caracteres con \"StringMarshalling.Custom\". Para usar un serializador de tipo personalizado, especifique \"MarshalUsingAttribute\".
fr: Le marshaling de caractère avec « StringMarshalling.Custom » n’est pas pris en charge. Pour utiliser un marshaleur de type personnalisé, spécifiez « MarshalUsingAttribute ».
it: Il marshalling del carattere con 'StringMarshalling.Custom' non è supportato. Per usare un marshaller di tipo personalizzato, specificare 'MarshalUsingAttribute'.
ja: 'StringMarshalling.Custom' を使用した文字のマーシャリングはサポートされていません。カスタム型のマーシャラーを使用するには、'MarshalUsingAttribute' を指定します。
ko: 'StringMarshalling.Custom'으로 문자를 마샬링하는 것은 지원되지 않습니다. 사용자 지정 형식 마샬러를 사용하려면 'MarshalUsingAttribute'를 지정합니다.
pl: Znak marshallingu o wartości „StringMarshalling.Custom” nie jest obsługiwany. Aby użyć marshallera typu niestandardowego, określ atrybut „MarshalUsingAttribute”.
pt_br: Não há suporte para marshaling de caracteres com 'StringMarshalling.Custom'. Para usar um marshaller de tipo personalizado, especifique 'MarshalUsingAttribute'.
ru: Маршалинг char с \"StringMarshalling.Custom\" не поддерживается. Чтобы использовать маршалер пользовательского типа, укажите \"MarshalUsingAttribute\".
tr: 'StringMarshalling.Custom' ile karakter sıralama desteklenmiyor. Özel bir tür sıralayıcısı kullanmak için 'MarshalUsingAttribute' belirtin.
zh_hans: 不支持使用 \"StringMarscharing.Custom\" 封送 char。若要使用自定义类型封送程序，请指定 \"MarshalUsingAttribute\"。
zh_hant: 不支援具有 'StringMarshalling.Custom' 的封送處理字元。若要使用自訂類型封送處理器，請指定 'MarshalUsingAttribute'。

# MarshallingStringOrCharAsUndefinedNotSupported
source: Marshalling string or char without explicit marshalling information is not supported. Specify '{0}.StringMarshalling', '{0}.StringMarshallingCustomType', 'MarshalUsingAttribute' or 'MarshalAsAttribute'.
cs: Zařazování řetězce nebo znaku bez explicitních informací o zařazování se nepodporuje. Zadejte „{0}. StringMarshalling“, „{0}. StringMarshallingCustomType“, „MarshalUsingAttribute“ nebo „MarshalAsAttribute.“
de: Das Marshalling von Zeichenfolgen oder Zeichen ohne explizite Marshalling-Informationen wird nicht unterstützt. Geben Sie "{0}.StringMarshalling", "{0}.StringMarshallingCustomType", "MarshalUsingAttribute" oder "MarshalAsAttribute" an.
es: No se admite la serialización de cadenas o caracteres sin información de serialización explícita. Especifique '{0}. StringMarshalling', '{0}. StringMars slaingCustomType", "MarshalUsingAttribute" o "MarshalAsAttribute".
fr: Le marshalling d’une chaîne ou d’un caractère sans information explicite sur le marshalling n’est pas pris en charge. Spécifiez '{0}.StringMarshalling', '{0}.StringMarshallingCustomType', 'MarshalUsingAttribute' ou 'MarshalAsAttribute'.
it: Il marshalling di stringa o carattere senza informazioni di marshalling esplicite non è supportato. Specificare '{0}.StringMarshalling', '{0}.StringMarshallingCustomType', 'MarshalUsingAttribute' o 'MarshalAsAttribute'.
ja: 明示的なマーシャリング情報を含まない文字列または文字のマーシャリングはサポートされていません。'{0}.StringMarshalling'、'{0}.StringMarshallingCustomType'、'MarshalUsingAttribute'、または 'MarshalAsAttribute'を指定します。
ko: 명시적 마샬링 정보 없이 문자열 또는 char을 마샬링할 수 없습니다. '{0}.StringMarshalling', '{0}.StringMarshallingCustomType', 'MarshalUsingAttribute' 또는 'MarshalAsAttribute'를 지정합니다.
pl: Kierowanie ciągu lub znaku bez jawnych informacji o kierowaniu nie jest obsługiwane. Określ „{0}.StringMarshalling”, „{0}.StringMarshallingCustomType”, „MarshalUsingAttribute” lub „MarshalAsAttribute”.
pt_br: Não há suporte para marshalling de cadeia de caracteres ou char sem informações de marshalling explícitas. Especifique ''{0}. StringMarshalling'', ''{0}. StringMarshallingCustomType'', ''MarshalUsingAttribute'' ou ''MarshalAsAttribute''.
ru: Строка или символ со строкой или символом без явных сведений о маршалинге не поддерживаются. Укажите "{0}.StringMarshalling", "{0}.StringMarshallingCustomType", "MarshalUsingAttribute" или "MarshalAsAttribute".
tr: Açık hazırlama bilgileri olmadan dize veya karakter hazırlama desteklenmiyor. '{0}.StringMarshalling', '{0}.StringMarshallingCustomType', 'MarshalUsingAttribute' veya 'MarshalAsAttribute' belirtin.
zh_hans: 不支持没有明确封送信息的封送字符串或字符。请指定“{0}.StringMarshalling”、“{0}.StringMarshallingCustomType”、“MarshalUsingAttribute”或“MarshalAsAttribute”。
zh_hant: 不支援沒有明確封送處理資訊的封送處理字串或字元。請指定 '{0}.StringMarshalling、'{0}.StringMarshallingCustomType'、'MarshalUsingAttribute' 或 'MarshalAsAttribute'。

# MethodNotDeclaredInAttributedInterfaceDescription
source: All methods must be declared in the same partial definition of a 'GeneratedComInterface'-attributed interface type to ensure reliable calculation for virtual method table offsets.
cs: Všechny metody musí být deklarované ve stejné částečné definici typu rozhraní GeneratedComInterface s atributy, aby se zajistil spolehlivý výpočet pro posuny tabulky virtuálních metod.
de: Alle Methoden müssen in derselben partiellen Definition eines Schnittstellentyps mit Attributen vom Typ "GeneratedComInterface" deklariert werden, um eine zuverlässige Berechnung für Tabellenoffsets virtueller Methoden sicherzustellen.
es: Todos los métodos deben declararse en la misma definición parcial de un tipo de interfaz con atributos "GeneratedComInterface" para garantizar un cálculo confiable de los desplazamientos de la tabla de métodos virtuales.
fr: Toutes les méthodes doivent être déclarées dans la même définition partielle d’un type d’interface avec attribut « GeneratedComInterface » pour garantir un calcul fiable des décalages de table de méthodes virtuelles.
it: Tutti i metodi devono essere dichiarati nella stessa definizione parziale di un tipo di interfaccia con attributo 'GeneratedComInterface' per garantire un calcolo affidabile per gli offset della tabella dei metodi virtuali.
ja: 仮想メソッド テーブルのオフセットを確実に計算するには、'GeneratedComInterface' 属性インターフェイスの種類の同じ部分定義で、すべてのメソッドを宣言する必要があります。
ko: 모든 메서드는 가상 메서드 테이블 오프셋에 대한 신뢰할 수 있는 계산을 보장하기 위해 'GeneratedComInterface' 속성 인터페이스 유형의 동일한 부분 정의에서 선언되어야 합니다.
pl: Wszystkie metody muszą być zadeklarowane w tej samej częściowej definicji przypisanego typu interfejsu „GeneratedComInterface” w celu zapewnienia niezawodnego obliczania przesunięć tabeli metod wirtualnych.
pt_br: Todos os métodos devem ser declarados na mesma definição parcial de um tipo de interface atribuído a "GeneratedComInterface" para garantir um cálculo confiável para deslocamentos de tabela de métodos virtuais.
ru: Все методы должны быть объявлены в одном частичном определении типа интерфейса с атрибутом GeneratedComInterface, чтобы обеспечить надежное вычисление смещений таблицы виртуальных методов.
tr: Tüm yöntemler, sanal yöntem tablosu uzaklıkları için güvenilir hesaplamayı sağlamak amacıyla 'GeneratedComInterface' özniteliğine sahip arabirim türünün aynı kısmi tanımında bildirilmiş olmalıdır.
zh_hans: 所有方法都必须在 “GeneratedComInterface” 特性化接口类型的同一部分定义中声明，以确保对虚拟方法表偏移进行可靠的计算。
zh_hant: 所有方法都必須在 'GeneratedComInterface' 屬性化介面類型的相同部分定義中宣告，以確保對虛擬方法資料表位移進行可靠的計算。

# MethodNotDeclaredInAttributedInterfaceMessage
source: The method '{0}' is declared on a different partial definition of the interface '{1}' than the definition that has the 'GeneratedComInterface' attribute
cs: Metoda {0} je deklarována v jiné částečné definici rozhraní {1} než definice s atributem GeneratedComInterface.
de: Die Methode "{0}" ist für eine andere partielle Definition der Schnittstelle "{1}" als die Definition deklariert, die über das GeneratedComInterface-Attribut verfügt.
es: El método "{0}" está declarado en una definición parcial diferente de la interfaz "{1}" que la definición que tiene el atributo "GeneratedComInterface"
fr: La méthode « {0} » est déclarée sur une autre définition partielle de l’interface « {1} » que la définition qui a l’attribut « GeneratedComInterface »
it: Il metodo '{0}' è dichiarato in una definizione parziale diversa dell'interfaccia '{1}' rispetto alla definizione con l'attributo 'GeneratedComInterface'
ja: メソッド '{0}' は、'GeneratedComInterface' 属性を持つ定義とは異なるインターフェイス '{1}' の部分定義で宣言されています
ko: 메서드 '{0}'은(는) 'GeneratedComInterface' 특성이 있는 정의가 아닌 인터페이스 '{1}'의 다른 부분 정의에서 선언되었습니다.
pl: Metoda „{0}” jest zadeklarowana w innej częściowej definicji interfejsu „{1}” niż definicja, która ma atrybut „GeneratedComInterface”
pt_br: O método "{0}" é declarado em uma definição parcial diferente da interface "{1}" que a definição que tem o atributo "GeneratedComInterface"
ru: Метод "{0}" объявлен в частичном определении интерфейса "{1}", отличном от определения с атрибутом GeneratedComInterface
tr: '{0}' metodu, 'GeneratedComInterface' özniteliğinin sahip olduğu tanımdan daha farklı '{1}' arabiriminin kısmi tanımında bildirilmiştir.
zh_hans: 方法“{0}”是在接口“{1}”的不同部分定义上声明的，而不是在具有 “GeneratedComInterface” 属性的定义上声明的
zh_hant: 方法 '{0}' 是在介面 '{1}' 的不同部分定義上宣告的，而不是在具有 'GeneratedComInterface' 屬性的定義上宣告

# MethodNotDeclaredInAttributedInterfaceTitle
source: Method is declared in different partial declaration than the 'GeneratedComInterface' attribute.
cs: Metoda je deklarovaná v jiné částečné deklaraci než atribut GeneratedComInterface.
de: Die Methode wird in einer anderen partiellen Deklaration als das GeneratedComInterface-Attribut deklariert.
es: El método se declara en una declaración parcial diferente a la del atributo "GeneratedComInterface".
fr: La méthode est déclarée dans une déclaration partielle différente de l’attribut « GeneratedComInterface ».
it: Il metodo è dichiarato in una dichiarazione parziale diversa rispetto all'attributo 'GeneratedComInterface'.
ja: メソッドは、'GeneratedComInterface' 属性とは異なる部分宣言で宣言されています。
ko: 메소드가 'GeneratedComInterface' 속성과 다른 부분 선언에서 선언되었습니다.
pl: Metoda jest zadeklarowana w innej deklaracji częściowej niż atrybut „GeneratedComInterface”.
pt_br: O método é declarado em uma declaração parcial diferente do atributo "GeneratedComInterface".
ru: Метод объявлен в частичном объявлении, отличном от атрибута GeneratedComInterface.
tr: Metot, 'GeneratedComInterface' özniteliğinden farklı bir kısmi bildirimde bildirilmiş.
zh_hans: 方法是在不同于 “GeneratedComInterface” 属性的部分声明中声明的。
zh_hant: 方法是在不同於 'GeneratedComInterface' 屬性的部分宣告中宣告。
