Repository: dotnet/runtime
Catalog: src/libraries/System.Runtime.InteropServices/gen/Common/Resources/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# InvalidStringMarshallingConfigurationMessageLibraryImport
source: The configuration of 'StringMarshalling' and 'StringMarshallingCustomType' on method '{0}' is invalid. {1}
cs: Konfigurace StringMarshalling a StringMarshallingCustomType u metody {0} je neplatná. {1}
de: Die Konfiguration von \"StringMarshalling\" und \"StringMarshallingCustomType\" für die Methode \"{0}\" ist ungültig. {1}
es: La configuración de “StringMarshalling” y “StringMarshallingCustomType” en el método “{0}” no es válida. {1}
fr: La configuration de « StringMarshalling » et de « StringMarshallingCustomType » n’est sur la méthode « {0} » pas valide. {1}
it: La configurazione di 'StringMarshalling' e 'StringMarshallingCustomType' nel metodo '{0}' non è valida. {1}
ja: メソッド '{0}' の 'StringMarshalling' と 'StringMarshallingCustomType' の構成が無効です。{1}
ko: '{0}' 메서드의 'StringMarshalling' 및 'StringMarshallingCustomType' 구성이 잘못되었습니다. {1}
pl: Konfiguracja elementów „StringMarshalling” i „StringMarshallingCustomType” w metodzie „{0}” jest nieprawidłowa. {1}
pt_br: A configuração de 'StringMarshalling' e 'StringMarshallingCustomType' no método '{0}' é inválida. {1}
ru: Конфигурация \"StringMarshalling\" и \"StringMarshallingCustomType\" в методе \"{0}\" недопустима. {1}
tr: '{0}' metodundaki 'StringMarshalling' ve 'StringMarshallingCustomType' yapılandırması geçersiz. {1}
zh_hans: 方法“{0}”上的 “StringMarshalling” 和 “StringMarshallingCustomType” 的配置无效。{1}
zh_hant: 方法 '{0}' 上的 'StringMarshalling' 和 'StringMarshallingCustomType' 設定無效。{1}

# InvalidStringMarshallingConfigurationMissingCustomType
source: 'StringMarshallingCustomType' must be specified when 'StringMarshalling' is set to 'StringMarshalling.Custom'.
cs: StringMarshallingCustomType musí být určený, pokud je StringMarshalling nastavený na StringMarshalling.Custom.
de: \"StringMarshallingCustomType\" muss angegeben werden, wenn \"StringMarshalling\" auf \"StringMarshalling.Custom\" festgelegt ist.
es: Se debe especificar “StringMarshallingCustomType” cuando “StringMarshalling” esté establecido en “StringMarshalling.Custom”.
fr: « StringMarshallingCustomType » doit être spécifié quand « StringMarshalling » a la valeur « StringMarshalling.Custom ».
it: È necessario specificare 'StringMarshallingCustomType' quando 'StringMarshalling' è impostato su 'StringMarshalling.Custom'.
ja: 'StringMarshalling' が 'StringMarshalling.Custom' に設定されている場合は、'StringMarshallingCustomType' を指定する必要があります。
ko: 'StringMarshalling'이 'StringMarshalling.Custom'으로 설정된 경우 'StringMarshallingCustomType'을 지정해야 합니다.
pl: Element „StringMarshallingCustomType” należy określić, gdy element „StringMarshalling” ma wartość „StringMarshalling.Custom”.
pt_br: 'StringMarshallingCustomType' deve ser especificado quando 'StringMarshalling' está definido como 'StringMarshalling.Custom'.
ru: Если для \"StringMarshalling\" задано значение \"StringMarshalling.Custom\", необходимо указать \"StringMarshallingCustomType\".
tr: 'StringMarshalling' 'StringMarshalling.Custom' olarak ayarlandığında 'StringMarshallingCustomType' belirtilmelidir.
zh_hans: 在 “StringMarshalling” 设置为 “StringMarshalling.Custom” 时，必须指定 “StringMarshallingCustomType”。
zh_hant: 當 'StringMarshalling' 設定為 'StringMarshalling.Custom' 時，必須指定 'StringMarshallingCustomType'。

# InvalidStringMarshallingConfigurationNotCustom
source: 'StringMarshalling' should be set to 'StringMarshalling.Custom' when 'StringMarshallingCustomType' is specified.
cs: StringMarshalling by měl být nastavený na StringMarshalling.Custom, když je pokud je určený StringMarshallingCustomType.
de: \"StringMarshalling\" muss auf \"StringMarshalling.Custom\" festgelegt werden, wenn \"StringMarshallingCustomType\" angegeben ist.
es: “StringMarshalling” debe establecerse en “StringMarshalling.Custom” cuando “StringMarshallingCustomType” esté especificado.
fr: « StringMarshalling » doit être défini sur « StringMarshalling.Custom » quand « StringMarshallingCustomType » est spécifié.
it: 'StringMarshalling' deve essere impostato su 'StringMarshalling.Custom' quando è specificato 'StringMarshallingCustomType'.
ja: 'StringMarshallingCustomType' が指定されている場合、'StringMarshalling' を 'StringMarshalling.Custom' に設定する必要があります。
ko: 'StringMarshallingCustomType'이 지정된 경우 'StringMarshalling'은 'StringMarshalling.Custom'으로 설정되어야 합니다.
pl: Element „StringMarshalling” należy ustawić na wartość „StringMarshalling.Custom”, gdy określono element „StringMarshallingCustomType”.
pt_br: 'StringMarshalling' deve ser definido como 'StringMarshalling.Custom' quando 'StringMarshallingCustomType' for especificado.
ru: Если указано \"StringMarshallingCustomType\", для \"StringMarshalling\" следует задать значение \"StringMarshalling.Custom\".
tr: 'StringMarshallingCustomType' belirtilirken 'StringMarshalling', 'StringMarshalling.Custom' olarak ayarlanmalıdır.
zh_hans: 在指定 “StringMarshallingCustomType” 时，应将 “StringMarshalling” 设置为 “StringMarshalling.Custom”。
zh_hant: 指定 'StringMarshallingCustomType' 時，'StringMarshalling' 應設定為 'StringMarshalling.Custom'。

# InvalidStringMarshallingConfigurationOnInterfaceMessage
source: The configuration of 'StringMarshalling' and 'StringMarshallingCustomType' on interface '{0}' is invalid. {1}
cs: Konfigurace „StringMarshalling“ a „StringMarshallingCustomType“ v rozhraní „{0}“ je neplatná. {1}
de: Die Konfiguration von "StringMarshalling" und "StringMarshallingCustomType" für die Schnittstelle "{0}" ist ungültig. {1}
es: La configuración de "StringMarshalling" y "StringMarshallingCustomType" en la interfaz "{0}" no es válida. {1}
fr: La configuration de « StringMarshalling » et de « StringMarshallingCustomType » n’est sur l’interface ’{0}’ pas valide. {1}
it: La configurazione di 'StringMarshalling' e 'StringMarshallingCustomType' nell’interfaccia '{0}' non è valida. {1}
ja: インターフェイス '{0}' の 'StringMarshalling' および 'StringMarshallingCustomType' の構成が無効です。 {1}
ko: '{0}' 인터페이스의 'StringMarshalling' 및 'StringMarshallingCustomType' 구성이 잘못되었습니다. {1}
pl: Konfiguracja elementów „StringMarshalling” i „StringMarshallingCustomType” w interfejsie „{0}” jest nieprawidłowa. {1}
pt_br: A configuração de 'StringMarshalling' e 'StringMarshallingCustomType' na interface '{0}' é inválida. {1}
ru: Конфигурация "StringMarshalling" и "StringMarshallingCustomType" в интерфейсе "{0}" недопустима. {1}
tr: '{0}' arabirimindeki 'StringMarshalling' ve 'StringMarshallingCustomType' yapılandırması geçersiz. {1}
zh_hans: 接口 "{0}" 上的 "StringMarshalling" 和 "StringMarshallingCustomType" 的配置无效。{1}
zh_hant: 介面 '{0}' 上的 'StringMarshalling' 和 'StringMarshallingCustomType' 設定無效。{1}

# InvalidStringMarshallingConfigurationOnMethodMessage
source: The configuration of 'StringMarshalling' and 'StringMarshallingCustomType' on method '{0}' is invalid. {1}
cs: Konfigurace StringMarshalling a StringMarshallingCustomType u metody {0} je neplatná. {1}
de: Die Konfiguration von \"StringMarshalling\" und \"StringMarshallingCustomType\" für die Methode \"{0}\" ist ungültig. {1}
es: La configuración de “StringMarshalling” y “StringMarshallingCustomType” en el método “{0}” no es válida. {1}
fr: La configuration de « StringMarshalling » et de « StringMarshallingCustomType » n’est sur la méthode « {0} » pas valide. {1}
it: La configurazione di 'StringMarshalling' e 'StringMarshallingCustomType' nel metodo '{0}' non è valida. {1}
ja: メソッド '{0}' の 'StringMarshalling' と 'StringMarshallingCustomType' の構成が無効です。{1}
ko: '{0}' 메서드의 'StringMarshalling' 및 'StringMarshallingCustomType' 구성이 잘못되었습니다. {1}
pl: Konfiguracja elementów „StringMarshalling” i „StringMarshallingCustomType” w metodzie „{0}” jest nieprawidłowa. {1}
pt_br: A configuração de 'StringMarshalling' e 'StringMarshallingCustomType' no método '{0}' é inválida. {1}
ru: Конфигурация \"StringMarshalling\" и \"StringMarshallingCustomType\" в методе \"{0}\" недопустима. {1}
tr: '{0}' metodundaki 'StringMarshalling' ve 'StringMarshallingCustomType' yapılandırması geçersiz. {1}
zh_hans: 方法“{0}”上的 “StringMarshalling” 和 “StringMarshallingCustomType” 的配置无效。{1}
zh_hant: 方法 '{0}' 上的 'StringMarshalling' 和 'StringMarshallingCustomType' 設定無效。{1}

source: Invalid 'VirtualMethodIndexAttribute' usage
cs: Neplatné použití atributu VirtualMethodIndexAttribute
de: Ungültige Verwendung von "VirtualMethodIndexAttribute"
es: Uso de ”VirtualMethodIndexAttribute” no válido
fr: Utilisation de « VirtualMethodIndexAttribute » non valide
it: Utilizzo di 'VirtualMethodIndexAttribute' non valido
ja: 'VirtualMethodIndexAttribute' の使用法が無効です
ko: 잘못된 'VirtualMethodIndexAttribute' 사용
pl: Nieprawidłowe użycie atrybutu „VirtualMethodIndexAttribute”
pt_br: Uso de 'VirtualMethodIndexAttribute' inválido
ru: Недопустимое использование VirtualMethodIndexAttribute
tr: Geçersiz 'VirtualMethodIndexAttribute' kullanımı
zh_hans: “VirtualMethodIndexAttribute” 使用情况无效
zh_hant: 'VirtualMethodIndexAttribute' 使用方式無效

# LibraryImportUsageDoesNotFollowBestPracticesMessageWithDetails
source: The usage of 'LibraryImportAttribute' does not follow recommendations. {0}
cs: Použití „LibraryImportAttribute“ není v souladu s doporučeními. {0}
de: Die Verwendung von "LibraryImportAttribute" entspricht nicht den Empfehlungen. {0}
es: El uso de "LibraryImportAttribute" no sigue las recomendaciones. {0}
fr: L'utilisation de « LibraryImport Attribute » ne suit pas les recommandations. {0}
it: L'utilizzo di 'LibraryImportAttribute' non segue le raccomandazioni. {0}
ja: 'LibraryImportAttribute' の使用は推奨事項に従っていません。{0}
ko: 'LibraryImportAttribute' 사용법이 권장 사항을 따르지 않습니다. {0}
pl: Użycie atrybutu „LibraryImportAttribute” nie jest zgodne z zaleceniami. {0}
pt_br: O uso de 'LibraryImportAttribute' não segue as recomendações. {0}
ru: Использование "LibraryImportAttribute" не соответствует рекомендациям. {0}
tr: 'LibraryImportAttribute' kullanımı önerilere uygun değil. {0}
zh_hans: “LibraryImportAttribute”的使用未遵循建议。{0}
zh_hant: 'LibraryImportAttribute' 的使用方式未遵循建議。{0}

# LibraryImportUsageDoesNotFollowBestPracticesTitle
source: The usage of 'LibraryImportAttribute' does not follow recommendations.
cs: Použití LibraryImportAttribute není v souladu s doporučeními.
de: Die Verwendung von "LibraryImportAttribute" entspricht nicht den Empfehlungen.
es: El uso de "LibraryImportAttribute" no sigue las recomendaciones.
fr: L'utilisation de « LibraryImport Attribute » ne suit pas les recommandations.
it: L'utilizzo di 'LibraryImportAttribute' non segue le raccomandazioni.
ja: 'LibraryImportAttribute' の使用は推奨事項に従っていません。
ko: 'LibraryImportAttribute' 사용법이 권장 사항을 따르지 않습니다.
pl: Użycie atrybutu „LibraryImportAttribute” nie jest zgodne z zaleceniami.
pt_br: O uso de 'LibraryImportAttribute' não segue as recomendações.
ru: Использование "LibraryImportAttribute" не соответствует рекомендациям.
tr: 'LibraryImportAttribute' kullanımı önerilere uygun değil.
zh_hans: “LibraryImportAttribute”的使用未遵循建议。
zh_hant: 'LibraryImportAttribute' 的使用方式未遵循建議。

# LinearCollectionElementTypesMustMatchDescription
source: The element type of the 'ReadOnlySpan' returned by 'GetManagedValuesSource' must be the same as the element type returned by 'GetManagedValuesDestination'.
cs: Typ prvku ReadOnlySpan vrácený GetManagedValuesSource musí být stejný, jako typ prvku vrácený GetManagedValuesDestination.
de: Der von \"GetManagedValuesSource\" zurückgegebene Elementtyp \"ReadOnlySpan\" muss mit dem Elementtyp identisch sein, der von \"GetManagedValuesDestination\" zurückgegeben wird.
es: El tipo de elemento del “ReadOnlySpan” devuelto por “GetManagedValuesSource” debe ser el mismo que el tipo de elemento devuelto por “GetManagedValuesDestination”.
fr: Le type d’élément de « ReadOnlySpan » retourné par « GetManagedValuesSource » doit être identique au type d’élément retourné par « GetManagedValuesDestination ».
it: Il tipo di elemento di 'ReadOnlySpan' restituito da 'GetManagedValuesSource' deve essere uguale al tipo di elemento restituito da 'GetManagedValuesDestination'.
ja: 'GetManagedValuesSource' によって返される 'ReadOnlySpan' の要素型は、'GetManagedValuesDestination' によって返される要素型と同じである必要があります。
ko: 'GetManagedValuesSource'에서 반환된 'ReadOnlySpan'의 요소 형식은 'GetManagedValuesDestination'에서 반환된 요소 형식과 동일해야 합니다.
pl: Typ elementu „ReadOnlySpan” zwracany przez element „GetManagedValuesSource” musi być taki sam jak typ elementu zwracany przez element „GetManagedValuesDestination”.
pt_br: O tipo de elemento de 'ReadOnlySpan' retornado por 'GetManagedValuesSource' deve ser igual ao tipo de elemento retornado por 'GetManagedValuesDestination'.
ru: Тип элемента \"ReadOnlySpan\", возвращенный методом \"GetManagedValuesSource\", должен совпадать с типом элемента, возвращаемым методом \"GetManagedValuesDestination\".
tr: 'GetManagedValuesSource' tarafından döndürülen 'ReadOnlySpan' öğe türü, 'GetManagedValuesDestination' tarafından döndürülen öğe türüyle aynı olmalıdır.
zh_hans: “GetManagedValuesSource” 返回的 “ReadOnlySpan” 的元素类型必须与 “GetManagedValuesDestination” 返回的元素类型相同。
zh_hant: 'GetManagedValuesSource' 傳回的 'ReadOnlySpan' 元素類型必須與 'GetManagedValuesDestination' 傳回的元素類型相同。

# LinearCollectionElementTypesMustMatchMessage
source: The element type of the 'ReadOnlySpan' returned by 'GetManagedValuesSource' must be the same as the element type returned by 'GetManagedValuesDestination'
cs: Typ prvku ReadOnlySpan vrácený GetManagedValuesSource musí být stejný, jako typ prvku vrácený GetManagedValuesDestination
de: Der von \"GetManagedValuesSource\" zurückgegebene Elementtyp \"ReadOnlySpan\" muss mit dem Elementtyp identisch sein, der von \"GetManagedValuesDestination\" zurückgegeben wird.
es: El tipo de elemento de “ReadOnlySpan” devuelto por “GetManagedValuesSource” debe ser el mismo que el tipo de elemento devuelto por “GetManagedValuesDestination”
fr: Le type d’élément de « ReadOnlySpan » retourné par « GetManagedValuesSource » doit être identique au type d’élément retourné par « GetManagedValuesDestination »
it: Il tipo di elemento di 'ReadOnlySpan' restituito da 'GetManagedValuesSource' deve essere uguale al tipo di elemento restituito da 'GetManagedValuesDestination'
ja: 'GetManagedValuesSource' によって返される 'ReadOnlySpan' の要素型は、'GetManagedValuesDestination' によって返される要素型と同じである必要があります
ko: 'GetManagedValuesSource'에서 반환된 'ReadOnlySpan'의 요소 형식은 'GetManagedValuesDestination'에서 반환된 요소 형식과 동일해야 합니다.
pl: Typ elementu „ReadOnlySpan” zwracany przez element „GetManagedValuesSource” musi być taki sam jak typ elementu zwracany przez element „GetManagedValuesDestination”
pt_br: O tipo de elemento de 'ReadOnlySpan' retornado por 'GetManagedValuesSource' deve ser igual ao tipo de elemento retornado por 'GetManagedValuesDestination'
ru: Тип элемента \"ReadOnlySpan\", возвращаемый методом \"GetManagedValuesSource\", должен совпадать с типом элемента, возвращаемым методом \"GetManagedValuesDestination\"
tr: 'GetManagedValuesSource' tarafından döndürülen 'ReadOnlySpan' öğe türü, 'GetManagedValuesDestination' tarafından döndürülen öğe türüyle aynı olmalıdır
zh_hans: “GetManagedValuesSource” 返回的 “ReadOnlySpan” 的元素类型必须与 “GetManagedValuesDestination” 返回的元素类型相同
zh_hant: 'GetManagedValuesSource' 傳回的 'ReadOnlySpan' 元素類型必須與 'GetManagedValuesDestination' 傳回的元素類型相同

# LinearCollectionInCallerAllocatedBufferRequiresSpanConstructorDescription
source: A 'LinearCollection'-kind native type that supports the 'CallerAllocatedBuffer' feature must provide a three-parameter constructor taking the managed type as the first parameter, a 'Span<byte>' as the second parameter, and the native size of the element as the third parameter
cs: Nativní typ druhu LinearCollection, který podporuje funkci CallerAllocatedBuffer musí poskytovat tříparametrový konstruktor přebírající spravovaný prvek jako první parametr, „Span<byte>“ jako druhý parametr a nativní velikost prvku jako třetí parametr
de: Ein nativer Typ vom Typ \"LinearCollection\", der das Feature \"CallerAllocatedBuffer\" unterstützt, muss einen Konstruktor mit drei Parametern bereitstellen, der den verwalteten Typ als ersten Parameter verwendet, einen \"Span<byte>\" als zweiten Parameter und die native Größe des Elements als dritten Parameter.
es: Un tipo nativo de variante “LinearCollection” que admita la característica “CallerAllocatedBuffer” debe proporcionar un constructor de tres parámetros que tome el tipo administrado como primer parámetro, un “Span<byte>” como segundo parámetro y el tamaño nativo del elemento como tercer parámetro
fr: Un type natif de type «LinearCollection» qui prend en charge la fonctionnalité «CallerAllocatedBuffer» doit fournir un constructeur à trois paramètres prenant le type managé comme premier paramètre, un «Span<byte>» comme deuxième paramètre et la taille native de l’élément comme troisième paramètre
it: Un tipo nativo di tipo 'LinearCollection' che supporta la funzionalità 'CallerAllocatedBuffer' deve fornire un costruttore a tre parametri che accetta il tipo gestito come primo parametro, un elemento 'Span<byte>' come secondo parametro e la dimensione nativa dell'elemento come terzo parametro
ja: 'CallerAllocatedBuffer' 機能をサポートする 'LinearCollection' 型のネイティブ型は、マネージド型を最初のパラメーターとして、'Span<byte>' を 2 番目のパラメーターとして、要素のネイティブ サイズを 3 番目のパラメーターとして、3 つのパラメーター コンストラクターを指定する必要があります
ko: 'CallerAllocatedBuffer' 기능을 지원하는 'LinearCollection' 종류의 네이티브 형식은 관리되는 형식을 첫 번째 매개 변수로 사용하고, 'Span<byte>'을 두 번째 매개 변수로 사용하고, 요소의 네이티브 크기를 세 번째 매개 변수로 사용하는 세 개의 매개 변수 생성자를 제공해야 합니다.
pl: Typ natywny rodzaju „LinearCollection”, który obsługuje funkcję „CallerAllocatedBuffer”, musi zapewniać konstruktora z trzema parametrami, przyjmującego typ zarządzany jako pierwszy parametr, wartość „Span<byte>” jako drugi parametr i natywny rozmiar elementu jako trzeci parametr
pt_br: Um tipo nativo do tipo 'LinearCollection' que dá suporte ao recurso 'CallerAllocatedBuffer' deve fornecer um construtor de três parâmetros usando o tipo gerenciado como o primeiro parâmetro, um 'Span<byte>' como o segundo parâmetro e o tamanho nativo do elemento como o terceiro parâmetro
ru: Собственный тип вида \"LinearCollection\", который поддерживает функцию CallerAllocatedBuffer, должен предоставлять конструктор с тремя параметрами, управляемый тип, \"Span<byte>\" и собственный размер элемента
tr: 'CallerAllocatedBuffer' özelliğini destekleyen 'LinearCollection' tipi bir yerel türde, yönetilen türü birinci parametre, 'Span<byte>' değerini ikinci parametre ve öğenin yerel boyutunu ise üçüncü parametre olarak alan üç parametreli bir oluşturucu belirtilmelidir
zh_hans: 支持 “CallerAllocatedBuffer” 功能的 “LinearCollection” 种类本机类型必须提供一个三参数构造函数，该构造函数将托管类型作为第一个参数、“Span<byte>” 作为第二个参数，并将元素本机大小作为第三个参数
zh_hant: 支援 'CallerAllocatedBuffer' 功能的 'LinearCollection'-kind 原生類型必須提供以 Managed 類型作為第一個參數的三個參數建構函式、將 'Span<byte>' 作為第二個參數，以及元素的原生大小作為第三個參數

# LinearCollectionInCallerAllocatedBufferRequiresSpanConstructorMessage
source: The type '{0}' specifies that it supports 'In' marshalling with the 'CallerAllocatedBuffer' feature for '{1}' but does not provide a three-parameter constructor that takes a '{1}' , a 'Span<byte>', and an 'int'
cs: Typ {0} konkrétně určuje, že podporuje zařazování „In“ s funkcí CallerAllocatedBuffer pro {1}, ale neposkytuje tříparametrový konstruktor, který přebírá {1}, „Span<byte>“ a „int“
de: Der Typ \"{0}\" gibt an, dass er das Marshalling \"In\" mit der Funktion \"CallerAllocatedBuffer\" für \"{1}\" unterstützt, aber keinen Konstruktor mit drei Parametern bereitstellt, der einen \"{1}\", einen \"Span<byte>\" und einen \"int\" akzeptiert.
es: El tipo “{0}” especifica que admite serializar “In” con la característica “CallerAllocatedBuffer” para “{1}” pero no provee un constructor de tres parámetros que incluya un “{1}”, un “Span<byte>”, y un “int”
fr: Le type «{0}» spécifie qu’il prend en charge le marshaling «In» avec la fonctionnalité «CallerAllocatedBuffer» pour «{1}» mais ne fournit pas de constructeur à trois paramètres qui accepte un «{1}», un «Span<byte>» et un «int»
it: Il tipo '{0}' specifica che supporta il marshalling 'In' con la funzionalità 'CallerAllocatedBuffer' per '{1}', ma non fornisce un costruttore a tre parametri che accetta '{1}', 'Span<byte>' e 'int'
ja: 型 '{0}' は、'{1}' の 'CallerAllocatedBuffer' 機能を使用した 'In' マーシャリングをサポートすることを指定していますが、'{1}'、'Span<byte>'、'int' を受け取る 3 つのパラメーター コンストラクターを指定しません
ko: 형식 '{0}'은(는) '{1}'에 대한 'CallerAllocatedBuffer' 기능을 사용하여 'In' 마샬링을 지원하지만 '{1}', 'Span<byte>' 및 'int'를 사용하는 3개의 매개 변수 생성자를 제공하지 않습니다.
pl: Typ „{0}” określa, że obsługuje funkcję skierowania „In” z funkcją „CallerAllocatedBuffer” dla elementu „{1}”, ale nie udostępnia konstruktora z trzema parametrami, który przyjmuje wartość „{1}”, \"Span<byte>\" i „int”
pt_br: O tipo '{0}' especifica que dá suporte ao empacotamento 'In' com o recurso 'CallerAllocatedBuffer' para o '{1}', mas não fornece um construtor de três parâmetros que recebe um '{1}', um 'Span<byte>' e um 'int'
ru: \"{0}\" указывает, что поддерживает маршализацию в направлении \"внутрь\" с функцией \"CallerAllocatedBuffer\" для \"{1}\", но не предоставляет конструктор, принимающий три параметра: \"{1}\", \"Span<byte>\" и \"int\"
tr: '{0}' türünde '{1}' için 'CallerAllocatedBuffer' özelliğiyle 'In' sıralamasının desteklendiği belirtiliyor, ancak '{1}', 'Span<byte>' ve 'int' parametrelerini dahil eden üç parametreli bir oluşturucu sağlanmıyor
zh_hans: 类型“{0}”指定它支持使用 “CallerAllocatedBuffer” 功能对“{1}”进行 “In” 封送，但不提供采用“{1}”、“Span<byte>” 和 “int” 的三参数构造函数
zh_hant: 類型 '{0}' 指定其支援 'In' 封送處理，且'{1}'的 'CallerAllocatedBuffer' 功能，但不提供接受'{1}'、'Span<byte>' 和 'int' 的三個參數建構函示
