Repository: dotnet/runtime
Catalog: src/libraries/System.Runtime.InteropServices/gen/Common/Resources/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# BaseInterfaceMustGenerateAtLeastSameWrappers
source: A 'GeneratedComInterface' cannot specify 'ComInterfaceOptions.ManagedObjectWrapper' or 'ComInterfaceOptions.ComObjectWrapper' unless the base interface type did not specify options or specified at least the same options.
cs: GeneratedComInterface nemůže určovat ComInterfaceOptions.ManagedObjectWrapper nebo ComInterfaceOptions.ComObjectWrapper, pokud základní typ rozhraní neurčil možnosti nebo nezadal alespoň stejné možnosti.
de: Ein "GeneratedComInterface" kann nur dann "ComInterfaceOptions.ManagedObjectWrapper" oder "ComInterfaceOptions.ComObjectWrapper" angeben, wenn der Basisschnittstellentyp keine Optionen angegeben oder mindestens dieselben Optionen angegeben hat.
es: ''GeneratedComInterface'' no puede especificar ''ComInterfaceOptions.ManagedObjectWrapper'' o ''ComInterfaceOptions.ComObjectWrapper'' a menos que el tipo de interfaz base no especifique opciones o especifique al menos las mismas opciones.
fr: Un 'GeneratedComInterface' ne peut pas spécifier 'ComInterfaceOptions.ManagedObjectWrapper' ou 'ComInterfaceOptions.ComObjectWrapper' sauf si le type d’interface de base n’a pas spécifié d’options ou spécifié au moins les mêmes options.
it: Un elemento 'GeneratedComInterface' non può specificare 'ComInterfaceOptions.ManagedObjectWrapper' o 'ComInterfaceOptions.ComObjectWrapper' a meno che il tipo di interfaccia di base non specifichi opzioni o non specifichi almeno le stesse opzioni.
ja: 基底インターフェイスの型でオプションが指定されていないか、少なくとも同じオプションが指定されていない限り、'GeneratedComInterface' では 'ComInterfaceOptions.ManagedObjectWrapper' または 'ComInterfaceOptions.ComObjectWrapper' を指定できません。
ko: 기본 인터페이스 형식이 옵션을 지정하지 않았거나, 최소한 동일한 옵션을 지정하지 않은 경우 'GeneratedComInterface'는 'ComInterfaceOptions.ManagedObjectWrapper' 또는 'ComInterfaceOptions.ComObjectWrapper'를 지정할 수 없습니다.
pl: Element „GeneratedComInterface” nie może określać elementu „ComInterfaceOptions.ManagedObjectWrapper” lub „ComInterfaceOptions.ComObjectWrapper”, chyba że podstawowy typ interfejsu nie określił opcji lub określił co najmniej te same opcje.
pt_br: Um 'GeneratedComInterface' não pode especificar 'ComInterfaceOptions.ManagedObjectWrapper' ou 'ComInterfaceOptions.ComObjectWrapper' a menos que o tipo de interface base não especifique opções ou especifique pelo menos as mesmas opções.
ru: Параметр "GeneratedComInterface" не может указывать "ComInterfaceOptions.ManagedObjectWrapper" или "ComInterfaceOptions.ComObjectWrapper" кроме случаев, когда базовый тип интерфейса не указывает параметры или указывает по крайней мере те же параметры.
tr: Temel arabirim seçenekleri belirtmediği veya en azından aynı seçenekleri belirttiği sürece bir 'GeneratedComInterface' arabirimi 'ComInterfaceOptions.ManagedObjectWrapper' veya 'ComInterfaceOptions.ComObjectWrapper' seçeneğini belirtemez.
zh_hans: "GeneratedComInterface" 不能指定 "ComInterfaceOptions.ManagedObjectWrapper" 或 "ComInterfaceOptions.ComObjectWrapper"，除非基接口类型未指定选项或至少指定了相同的选项。
zh_hant: 除非基本介面類型未指定選項或至少指定了相同的選項，否則 'GeneratedComInterface' 不能指定 'ComInterfaceOptions.ManagedObjectWrapper' 或 'ComInterfaceOptions.ComObjectWrapper'。

# BidirectionalMissingRequiredMarshaller
source: The specified parameter needs to be marshalled from managed to unmanaged and unmanaged to managed, but the marshaller type '{0}' does not support it.
cs: Zadaný parametr musí být zařazený ze spravovaného do nespravovaného a z nespravovaného do spravovaného, ale zařazovací typ {0} to nepodporuje.
de: Der angegebene Parameter muss von verwaltet zu nicht verwaltet und von nicht verwaltet zu verwaltet gemarshallt werden, aber der Marshaller-Typ ‚{0}‘ unterstützt dies nicht.
es: El parámetro especificado debe serializarse de administrado a no administrado y de no administrado a administrado, pero el tipo de serializador "{0}" no lo admite.
fr: Le paramètre spécifié doit être marshalé de managé à non managé et non managé à managé, mais le type marshaleur « {0} » ne le prend pas en charge.
it: È necessario effettuare il marshalling del parametro specificato da gestito a non gestito e da non gestito a gestito, ma il tipo di gestore del marshalling '{0}' non lo supporta.
ja: 指定されたパラメーターはマネージドからアンマネージドに、およびアンマネージドからマネージドにマーシャリングする必要がありますが、マーシャラー型 '{0}' ではそれはサポートされていません。
ko: 지정된 매개 변수를 관리형에서 비관리형으로, 비관리형에서 관리형으로 마샬링해야 하지만 마샬러 유형 '{0}'은(는) 지원하지 않습니다.
pl: Określony parametr musi być kierowany z zarządzanego do niezarządzanego i niezarządzanego do zarządzanego, ale typ marszałka „{0}” go nie obsługuje.
pt_br: O parâmetro especificado precisa ser marshalled de gerenciado para não gerenciado e não gerenciado para gerenciado, mas o tipo de marshaller '{0}' não dá suporte a ele.
ru: Указанный параметр необходимо маршалировать из управляемого в неуправляемый и из неуправляемого в управляемый, но тип маршаллера "{0}" не поддерживает это.
tr: Belirtilen parametrenin yönetilenden yönetilmeyene ve yönetilmeyenden yönetilene doğru hazırlanması gerekiyor, ancak '{0}' hazırlayıcı türü bunu desteklemiyor.
zh_hans: 需要将指定的参数从托管封送到非托管和从非托管封送到托管，但封送程序类型“{0}”不支持它。
zh_hant: 指定的參數必須從受控封送處理到非受控，以及從非受控封送處理到受控，但封送處理程式類型 '{0}' 不支援。

# CallerAllocFromManagedMustHaveBufferSizeDescription
source: When the 'Managed to Unmanaged with Caller-Allocated Buffer' shape is used by providing a 'FromManaged' method that takes a 'Span<T>' on the marshaller type, the type must provide a static 'BufferSize' property to provide the number of elements in the caller-allocated buffer.
cs: Pokud se obrazec „Ze spravovaných na nespravované s vyrovnávací pamětí přidělenou volajícímu“ používá metodou FromManaged, která přebírá Span<T> u zařazovacího typu, musí typ poskytovat statickou vlastnost BufferSize, která určuje počet elementů ve vyrovnávací paměti přidělené volajícímu.
de: Wenn die Form "Verwaltet bis nicht verwaltet mit Caller-Allocated Buffer" verwendet wird, indem eine Methode "FromManaged" bereitgestellt wird, die eine "Span<T>" für den Marshallertyp akzeptiert, muss der Typ eine statische Eigenschaft "BufferSize" bereitstellen, um die Anzahl von Elementen im vom Aufrufer zugewiesenen Puffer anzugeben.
es: Cuando la forma "Administrado a no administrado con búfer asignado por el llamador" se usa con un método "FromManaged" que toma un "Span<T>" en el tipo de serializador, el tipo debe proporcionar una propiedad estática "BufferSize" para proporcionar el número de elementos en el búfer asignado por el llamador.
fr: Lorsque la forme « Managée à non managée avec mémoire tampon allouée par l’appelant » est utilisée en fournissant une méthode « FromManaged » qui prend un « Span<T> » sur le type marshaler, le type doit fournir une propriété « BufferSize » statique pour fournir le nombre d’éléments dans la mémoire tampon allouée par l’appelant.
it: Quando si usa la forma 'Managed to Unmanaged with Caller-Allocated Buffer', fornendo un metodo "FromManaged" che accetta un elemento "Span<T>" per il tipo di marshaller, il tipo deve fornire una proprietà statica "BufferSize" per fornire il numero di elementi nel buffer allocato dal chiamante.
ja: マーシャラー型で 'Span<T>' を取る 'FromManaged' メソッドを指定して 'Managed to Unmanaged with Caller-Allocated Buffer' 図形を使用する場合、呼び出し元に割り当てられたバッファー内の要素の数を提供するには、静的な 'BufferSize' プロパティを型で指定する必要があります。
ko: 마샬러 형식에서 'Span<T>'을 사용하는 'FromManaged' 메서드를 제공하여 '호출자 할당 버퍼로 관리되지 않음' 셰이프를 사용하는 경우 형식은 숫자를 제공하기 위해 정적 'BufferSize' 속성을 제공해야 합니다. 호출자 할당 버퍼의 요소 수
pl: Gdy kształt „Zarządzane do niezarządzanego za pomocą buforu przydzielonego przez wywołującego” jest używany przez podanie metody „FromManaged”, która przyjmuje element „Span< T>” w typie marshallera, typ musi udostępniać statyczną właściwość „BufferSize”, aby podać liczbę elementów w buforze przydzielonym przez wywołującego.
pt_br: Quando a forma 'Managed to Unmanaged com Caller-Allocated Buffer' é usada fornecendo um método 'FromManaged' que usa um 'Span<T>' no tipo de empacotador, o tipo deve fornecer uma propriedade estática 'BufferSize' para fornecer o número de elementos no buffer alocado pelo chamador.
ru: Если фигура "Из управляемого в неуправляемый с буфером, выделяемым вызывающим объектом" используется путем предоставления метода "FromManaged", выполняющего "Span<T>" для типа маршалера, этот тип должен предоставлять статическое свойство "BufferSize", чтобы предоставить количество элементов в буфере, выделенном вызывающим объектом.
tr: Hazırlayıcı türünde 'Span<T>' alan bir 'FromManaged' yöntemi sağlanarak 'Çağıran Tarafından Ayrılan Arabellek ile Yönetilenden Yönetilmeyene' şekli kullanıldığında tür, çağıran tarafından ayrılan arabellekteki öğe sayısını sağlamak için statik bir 'BufferSize' özelliği belirtmelidir.
zh_hans: 如果通过提供从封送处理程序类型提取“Span<T>”的“FromManaged”方法来使用“Managed to Unmanaged with Caller-Allocated Buffer”形状，则该类型必须提供一个静态的“BufferSize”属性才能提供已分配调用方缓冲。
zh_hant: 當透過提供在封送處理器類型上採用 'Span<T>' 的 'FromManaged' 方法來使用 'Managed to Unmanaged with Caller-Allocated Buffer' 圖形時，該類型必須提供靜態 'BufferSize' 屬性以提供 caller-allocated 緩衝區中的元素數字。

# CallerAllocFromManagedMustHaveBufferSizeMessage
source: The marshaller type '{0}' must have a static read-only 'int' 'BufferSize' property to specify the size of the caller-allocated buffer because it has a FromManaged method that takes a caller-allocated 'Span<{1}>'
cs: Zařazovací typ {0} musí obsahovat statickou celočíselnou vlastnost BufferSize určenou jen pro čtení, která určuje velikost vyrovnávací paměti přidělené volajícímu, protože obsahuje metodu FromManaged, která přebírá Span<{1}> přidělený volajícímu.
de: Der Marshallertyp "{0}" muss eine statische schreibgeschützte "int"-Eigenschaft "BufferSize" aufweisen, um die Größe des vom Aufrufer zugewiesenen Puffers anzugeben, da er eine FromManaged-Methode aufweist, die eine vom Aufrufer zugewiesene "Span<{1}>" akzeptiert
es: El tipo de serializador "{0}" debe tener una propiedad "int" "BufferSize" estática de solo lectura para especificar el tamaño del búfer asignado por el autor de la llamada porque tiene un método FromManaged que toma una propiedad "Span<{1}>" asignada por el autor de la llamada.
fr: Le type de marshaleur « {0} » doit avoir une propriété « BufferSize » en lecture seule « int » statique pour spécifier la taille de la mémoire tampon allouée par l’appelant, car elle a une méthode FromManaged qui accepte un « Span<{1}> » alloué par l’appelant
it: Il tipo di marshaller '{0}' deve avere una proprietà 'int' 'BufferSize' di sola lettura statica per specificare le dimensioni del buffer allocato dal chiamante perché dispone di un metodo FromManaged che accetta un elemento 'Span<{1}>' allocato dal chiamante
ja: マーシャラー型 '{0}' には、呼び出し元が割り当てた 'Span<{1}>' を受け取る FromManaged メソッドがあるため、呼び出し元が割り当てたバッファーのサイズを指定するには、静的な読み取り専用の 'int' 'BufferSize' プロパティが必要です
ko: 마샬러 유형 '{0}'에는 호출자 할당 'Span<{1}>'를 사용하는 FromManaged 메서드가 있으므로 호출자 할당 버퍼의 크기를 지정하려면 정적 읽기 전용 'int' 'BufferSize' 속성이 있어야 합니다.
pl: Typ marshallera „{0}” musi mieć statyczną właściwość „int” „BufferSize” tylko do odczytu, aby określić rozmiar buforu przydzielonego przez wywołującego, ponieważ ma metodę FromManaged, która przyjmuje przydzielony przez wywołującego element „Span<{1}>”
pt_br: O tipo de empacotador '{0}' deve ter uma propriedade estática somente leitura 'int' 'BufferSize' para especificar o tamanho do buffer alocado pelo chamador porque ele tem um método FromManaged que recebe um 'Span' alocado pelo chamador<{1}>'
ru: У типа маршалера "{0}" должно быть статическое доступное только для чтения свойство "BufferSize" со значением типа "int", чтобы указывать размер буфера, выделенного вызывающим объектом, поскольку у этого типа есть метод FromManaged, выполняющий "Span<{1}>", выделяемый вызывающим объектом.
tr: Hazırlayıcı türü '{0}', çağıran tarafından ayrılan arabelleğin boyutunu belirtmek için statik bir salt okunur 'int' 'BufferSize' özelliğine sahip olmalıdır çünkü çağıran tarafından ayrılan 'Span<{1}>' alan bir 'FromManaged' yöntemine sahiptir.
zh_hans: 封送处理程序类型“{0}”必须拥有静态的只读“int”“BufferSize”属性，才能指定已分配调用方缓冲的大小，因为它具有提取已分配调用方“Span<{1}>”的 FromManaged 方法
zh_hant: 封送處理器類型 '{0}' 必須有靜態唯讀 'int' 'BufferSize' 屬性，以指定 caller-allocated 緩衝區的大小，因為它具有採用 caller-allocated 'Span<{1}>' 的 FromManaged 方法

# CannotForwardToDllImportDescription
source: The generated 'DllImportAttribute' will not have a value corresponding to '{0}'.
cs: Vygenerovaný atribut DllImportAttribute nebude mít hodnotu odpovídající {0}.
de: Das generierte \"DllImportAttribute\" weist keinen Wert auf, der \"{0}\" entspricht.
es: El “DllImportAttribute” generado no tendrá un valor correspondiente a “{0}”.
fr: Le « DllImportAttribute » généré n’aura pas de valeur correspondant à « {0} ».
it: L'elemento 'DllImportAttribute' generato non avrà un valore corrispondente a '{0}'.
ja: 生成された 'DllImportAttribute' には、'{0}' に対応する値がありません。
ko: 생성된 'DllImportAttribute'에는 '{0}'에 해당하는 값이 없습니다.
pl: Wygenerowany atrybut „DllImportAttribute” nie będzie miał wartości odpowiadającej elementowi „{0}”.
pt_br: O 'DllImportAttribute' gerado não terá um valor correspondente a '{0}'.
ru: Созданный атрибут \"DllImportAttribute\" не будет иметь значения, соответствующего \"{0}\".
tr: Oluşturulan 'DllImportAttribute' üzerinde '{0}' için karşılık gelen bir değer bulunmaz.
zh_hans: 生成的 “DllImportAttribute” 将不具有与“{0}”对应的值。
zh_hant: 產生的 'DllImportAttribute' 將不會有對應至 '{0}' 的值。

# CannotForwardToDllImportMessage
source: '{0}' has no equivalent in 'DllImportAttribute' and will not be forwarded
cs: {0} nemá žádný ekvivalent v DllImportAttribute a nepřesměruje se
de: „{0}“ hat keine Entsprechung in „DllImportAttribute“ und wird nicht weitergeleitet.
es: “{0}” no tiene equivalente en “DllImportAttribute” y no se reenviará
fr: '{0}' n’a pas d’équivalent dans 'DllImportAttribute' et ne sera pas transféré.
it: '{0}' non ha equivalenti in 'DllImportAtttribute' e non verrà inoltrato
ja: '{0}' には、'DllImportAtttribute' に相当するものがないため、転送されません
ko: '{0}'에는 'DllImportAttribute'에 해당하는 항목이 없으며 전달되지 않습니다.
pl: Element „{0}” nie ma odpowiednika w atrybucie „DllImportAtttribute” i nie zostanie przekazany
pt_br: '{0}' não tem equivalente em 'DllImportAttribute' e não será encaminhado
ru: "{0}" не имеет эквивалента в "DllImportAtttribute" и не будет перенаправляться
tr: '{0}' için 'DllImportAttribute' içinde herhangi bir eşdeğer yok ve iletilemiyor
zh_hans: "{0}" 在 "DllImportAtttribute" 中没有等效项，并且将不会被转发
zh_hant: '{0}'在 'DllImportAttribute' 中没有相等項目，將不會轉寄

# CannotForwardToDllImportTitle
source: Specified 'LibraryImportAttribute' arguments cannot be forwarded to 'DllImportAttribute'
cs: Určené argumenty LibraryImportAttribute nelze přesměrovat do DllImportAttribute
de: Die angegebenen LibraryImportAttribute-Argumente können nicht an \"DllImportAttribute\" weitergeleitet werden.
es: Los argumentos “LibraryImportAttribute” especificados no se pueden reenviar a “DllImportAttribute”
fr: Les arguments « LibraryImportAttribute » spécifiés ne peuvent pas être transférés à « DllImportAttribute »
it: Gli argomenti 'LibraryImportAttribute' specificati non possono essere inoltrati a 'DllImportAttribute'
ja: 指定された 'LibraryImportAttribute' 引数を 'DllImportAttribute' に転送することはできません
ko: 지정된 'LibraryImportAttribute' 인수는 'DllImportAttribute'로 전달할 수 없습니다.
pl: Określonych argumentów „LibraryImportAttribute” nie można przekazać do elementu „DllImportAttribute”
pt_br: Os argumentos 'LibraryImportAttribute' especificados não podem ser encaminhados para 'DllImportAttribute'
ru: Указанные аргументы \"LibraryImportAttribute\" не могут быть перенаправлены в \"DllImportAttribute\"
tr: Belirtilen 'LibraryImportAttribute' bağımsız değişkenleri 'DllImportAttribute' öğesine iletilemez
zh_hans: 指定的 “LibraryImportAttribute” 参数无法转发到 “DllImportAttribute”
zh_hant: 指定的 'LibraryImportAttribute' 自變量無法轉送到 'DllImportAttribute'

# CastsBetweenRuntimeComAndSourceGeneratedComNotSupportedDescription
source: Casting between a 'ComImport' type and a source-generated COM type is not supported and will fail at runtime
cs: Převod mezi typem „ComImport“ a typem COM generovaným zdrojem není podporováno a za běhu selže.
de: Die Umwandlung zwischen einem ComImport-Typ und einem quellgenerierten COM-Typ wird nicht unterstützt und wird zur Laufzeit fehlschlagen.
es: No se admite la conversión entre un tipo "ComImport" y un tipo COM generado por el origen y se producirá un error en tiempo de ejecución.
fr: La conversion entre un type 'ComImport' et un type COM généré par la source n’est pas prise en charge et échouera au moment de l’exécution.
it: Il cast tra un tipo 'ComImport' e un tipo COM generato dall'origine non è supportato e avrà esito negativo in fase di esecuzione
ja: 'ComImport' 型とソース生成 COM 型の間でのキャストはサポートされていないため、実行時に失敗します
ko: 'ComImport' 형식과 소스 생성 COM 형식 간의 캐스팅은 지원되지 않으며 런타임에 실패합니다.
pl: Rzutowanie między typem „ComImport” i wygenerowanym przez źródło typem COM nie jest obsługiwane i zakończy się niepowodzeniem w czasie wykonywania
pt_br: A conversão entre um tipo 'ComImport' e um tipo COM gerado pela fonte não é suportada e falhará no tempo de execução
ru: Приведение типа "ComImport" к типу COM, созданному источником, не поддерживается и завершится ошибкой во время выполнения.
tr: 'ComImport' türü ile kaynak tarafından oluşturulan COM türü arasında dönüştürme desteklenmiyor ve çalışma zamanında başarısız olacak
zh_hans: 不支持在“ComImport”类型和源生成的 COM 类型之间强制转换，并且会在运行时失败
zh_hant: 不支援在 'ComImport' 類型與來源產生的 COM 類型之間轉換,且將在執行階段失敗

# CastsBetweenRuntimeComAndSourceGeneratedComNotSupportedMessage
source: Casting between a 'ComImport' type and a source-generated COM type is not supported
cs: Převod mezi typem „ComImport“ a typem COM generovaným zdrojem není podporováno.
de: Die Umwandlung zwischen einem ComImport-Typ und einem quellgenerierten COM-Typ wird nicht unterstützt.
es: No se admite la conversión entre un tipo 'ComImport' y un tipo COM generado por origen
fr: La conversion entre un type 'ComImport' et un type COM généré par la source n'est pas prise en charge.
it: Il cast tra un tipo 'ComImport' e un tipo COM generato dall'origine non è supportato
ja: 'ComImport' 型とソース生成 COM 型の間でのキャストはサポートされていません
ko: 'ComImport' 형식과 소스 생성 COM 형식 간 캐스팅은 지원되지 않습니다.
pl: Rzutowanie między typem „ComImport” i wygenerowanym przez źródło typem COM nie jest obsługiwane
pt_br: Não há suporte para a conversão entre um tipo 'ComImport' e um tipo COM gerado pela origem
ru: Приведение типа "ComImport" к типу COM, созданному источником, не поддерживается
tr: 'ComImport' türü ile kaynak tarafından oluşturulan COM türü arasında dönüştürme desteklenmiyor
zh_hans: 不支持在“ComImport”类型和源生成的 COM 类型之间强制转换
zh_hant: 不支援在 'ComImport' 類型與來源產生的 COM 類型之間轉換

# CastsBetweenRuntimeComAndSourceGeneratedComNotSupportedTitle
source: Casting between a 'ComImport' type and a source-generated COM type is not supported
cs: Převod mezi typem „ComImport“ a typem COM generovaným zdrojem není podporováno.
de: Die Umwandlung zwischen einem ComImport-Typ und einem quellgenerierten COM-Typ wird nicht unterstützt.
es: No se admite la conversión entre un tipo 'ComImport' y un tipo COM generado por origen
fr: La conversion entre un type 'ComImport' et un type COM généré par la source n'est pas prise en charge.
it: Il cast tra un tipo 'ComImport' e un tipo COM generato dall'origine non è supportato
ja: 'ComImport' 型とソース生成 COM 型の間でのキャストはサポートされていません
ko: 'ComImport' 형식과 소스 생성 COM 형식 간 캐스팅은 지원되지 않습니다.
pl: Rzutowanie między typem „ComImport” i wygenerowanym przez źródło typem COM nie jest obsługiwane
pt_br: Não há suporte para a conversão entre um tipo 'ComImport' e um tipo COM gerado pela origem
ru: Приведение типа "ComImport" к типу COM, созданному источником, не поддерживается
tr: 'ComImport' türü ile kaynak tarafından oluşturulan COM türü arasında dönüştürme desteklenmiyor
zh_hans: 不支持在“ComImport”类型和源生成的 COM 类型之间强制转换
zh_hant: 不支援在 'ComImport' 類型與來源產生的 COM 類型之間轉換

# ClassDoesNotImplementAnyGeneratedComInterfacesDescription
source: A class with 'GeneratedComClassAttribute' must implement at least one interface with 'GeneratedComInterfaceAttribute' or else the generated code with not have an effect.
cs: Třída s atributem GeneratedComClassAttribute musí implementovat alespoň jedno rozhraní s GeneratedComInterfaceAttribute, jinak nebude mít generovaný kód žádný efekt.
de: Eine Klasse mit 'GeneratedComClassAttribute' muss mindestens eine Schnittstelle mit 'GeneratedComInterfaceAttribute' implementieren, sonst hat der generierte Code keine Wirkung.
es: Una clase con "GeneratedComClassAttribute" debe implementar al menos una interfaz con "GeneratedComInterfaceAttribute" o el código generado sin efecto.
fr: Une classe avec « GeneratedComClassAttribute » doit implémenter au moins une interface avec « GeneratedComInterfaceAttribute » ou le code généré n’aura pas d’effet.
it: Una classe con 'GeneratedComClassAttribute' deve implementare almeno un'interfaccia con 'GeneratedComInterfaceAttribute' oppure il codice generato senza alcun effetto.
ja: 'GeneratedComClassAttribute' を持つクラスは、'GeneratedComInterfaceAttribute' を持つインターフェイスを少なくとも 1 つ実装する必要があります。そうでない場合、生成されたコードの効果がなくなります。
ko: 'GeneratedComClassAttribute'가 있는 클래스는 'GeneratedComInterfaceAttribute'가 있는 하나 이상의 인터페이스를 구현해야 합니다. 그렇지 않으면 생성된 코드가 효과가 없습니다.
pl: Klasa z atrybutem „GeneratedComClassAttribute” musi implementować co najmniej jeden interfejs z atrybutem „GeneratedComInterfaceAttribute”. W przeciwnym wypadku wygenerowany kod nie będzie miał efektu.
pt_br: Uma classe com "GeneratedComClassAttribute" deve implementar pelo menos uma interface com "GeneratedComInterfaceAttribute" ou então o código gerado não terá efeito.
ru: Класс с "GeneratedComClassAttribute" должен реализовывать по крайней мере один интерфейс с "GeneratedComInterfaceAttribute", иначе сгенерированный код не будет иметь эффекта.
tr: 'GeneratedComClassAttribute' içeren bir sınıf, 'GeneratedComInterfaceAttribute' özniteliğine sahip en az bir arabirim uygulamalıdır. Aksi halde oluşturulan kodun etkisi yoktur.
zh_hans: 具有“GeneratedComClassAttribute”的类必须至少实现一个具有“GeneratedComInterfaceAttribute”的接口，否则生成的代码不起作用。
zh_hant: 具有 'GeneratedComClassAttribute' 的類別必須使用 'GeneratedComInterfaceAttribute' 來實作至少一個介面，否則產生的程式碼將沒有效果。
