Repository: dotnet/runtime
Catalog: src/libraries/System.Runtime.InteropServices/gen/Common/Resources/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# LinearCollectionInRequiresCollectionMethodsDescription
source: A contiguous collection marshaller that supports marshalling from managed to unmanaged must provide a 'GetManagedValuesSource' that returns a 'ReadOnlySpan<>' and a 'GetUnmanagedValuesDestination' method that returns a 'Span<>'.
cs: Souvislý zařazovací modul kolekce, který podporuje zařazování ze spravovaného do nespravovaného, musí poskytovat metodu GetManagedValuesSource, která vrací metodu ReadOnlySpan<> a GetUnmanagedValuesDestination, která vrací hodnotu Span<>.
de: Ein zusammenhängender Sammlungsmarshaller, der das Marshallen von verwaltet zu nicht verwaltet unterstützt, muss eine „GetManagedValuesSource“ bereitstellen, die ein „ReadOnlySpan<>“ und eine „GetUnmanagedValuesDestination“-Methode zurückgibt, die ein „Span<>“ zurückgibt.
es: Un serializador de colección contigua que admita la serialización de administrado a no administrado debe proporcionar un "GetManagedValuesSource" que devuelva un valor de "ReadOnlySpan<>" y un método "GetUnmanagedValuesDestination" que devuelva un valor de "Span<>".
fr: Un marshaleur de collection contigu qui prend en charge le marshaling de managé à non managé doit fournir un 'GetManagedValuesSource' qui retourne un 'ReadOnlySpan<>' et une méthode 'GetUnmanagedValuesDestination' qui retourne un 'Span<>'.
it: Un marshaller di raccolta contiguo che supporta il marshalling da gestito a non gestito deve fornire un 'GetManagedValuesSource' che restituisce 'ReadOnlySpan<>' e un metodo 'GetUnmanagedValuesDestination' che restituisce un 'Span<>'.
ja: マネージドからアンマネージドへのマーシャリングをサポートする連続したコレクション マーシャラーは、'ReadOnlySpan<>' を返す 'GetManagedValuesSource' と 'Span<>' を返す 'GetUnmanagedValuesDestination' メソッドを提供する必要があります。
ko: 관리형 컬렉션부터 비관리형까지 마샬링까지 지원하는 연속 컬렉션 마샬러는 'ReadOnlySpan<>'을 반환하는 'GetManagedValuesSource'와 'Span<>'을 반환하는 'GetUnmanagedValuesDestination' 메서드를 제공해야 합니다.
pl: Organizator zwartej kolekcji, który obsługuje przeprowadzanie marshalingu z zarządzanych do niezarządzanych, musi zapewniać metodę „GetManagedValuesSource”, która zwraca wartość „ReadOnlySpan<>” oraz metodę „GetUnmanagedValuesDestination”, która zwraca wartość „Span<>”.
pt_br: Um marshaller de coleção contíguo que dê suporte ao marshaling de gerenciado para não gerenciado deve fornecer um 'GetManagedValuesSource' que retorna um método 'ReadOnlySpan<>' e um método 'GetUnmanagedValuesDestination' que retorna um 'Span<>'.
ru: Непрерывный маршалер коллекции, поддерживающий маршалинг из управляемого в неуправляемый, должен предоставлять метод "GetManagedValuesSource", который возвращает "ReadOnlySpan<>" и метод "GetUnmanagedValuesDestination", возвращающий "Span<>".
tr: Yönetilenden yönetilmeyene sıralamayı destekleyen bitişik bir koleksiyon sıralayıcı, 'ReadOnlySpan<>' döndüren bir 'GetManagedValuesSource' ve 'Span<>' döndüren bir 'GetUnmanagedValuesDestination' metodu sağlamalıdır.
zh_hans: 支持从托管到非托管的封送的连续集合封送程序必须提供返回“ReadOnlySpan<>”的“GetManagedValuesSource”和返回“Span<>”的“GetUnmanagedValuesDestination”方法。
zh_hant: 支援從非受控到受控封送處理的連續集合封送處理程式必須提供傳回 'ReadOnlySpan<>' 的 'GetManagedValuesSource' 和傳回 'Span<>' 的 'GetNativeValuesDestination' 方法。

# LinearCollectionInRequiresCollectionMethodsMessage
source: The type '{0}' specifies that it supports the '{1}' marshal mode, but it does not provide a 'GetManagedValuesSource' that returns a 'ReadOnlySpan<>' and a 'GetUnmanagedValuesDestination' method that returns a 'Span<>'
cs: Typ {0} určuje, že podporuje režim zařazování {1}, ale neposkytuje metodu GetManagedValuesSource, která vrací metodu ReadOnlySpan<> a GetUnmanagedValuesDestination, která vrací Span<>.
de: Der Typ „{0}“ gibt an, dass der Marshalling-Modus „{1}“ unterstützt wird. Er stellt jedoch keine „GetManagedValuesSource“ bereit, die ein „ReadOnlySpan<>“ und eine „GetUnmanagedValuesDestination“-Methode zurückgibt, die ein „Span<>“ zurückgibt.
es: El tipo "{0}" especifica que admite el modo de serialización "{1}", pero no proporciona un "GetManagedValuesSource" que devuelva un "ReadOnlySpan<>" y un método "GetNativeValuesDestination" que devuelva un "Span<>"
fr: Le type '{0}' spécifie qu’il prend en charge le mode marshal '{1}', mais il ne fournit pas de 'GetManagedValuesSource' qui retourne un 'ReadOnlySpan<>' et une méthode 'GetUnmanagedValuesDestination' qui retourne 'Span<>'
it: Il tipo '{0}' specifica che supporta la modalità di marshalling '{1}', ma non fornisce 'GetManagedValuesSource' che restituisce 'ReadOnlySpan<>' e un metodo 'GetUnmanagedValuesDestination' che restituisce un 'Span<>'
ja: 型 '{0}' は、'{1}' マーシャリング モードをサポートすることを指定しますが、'ReadOnlySpan<>' を返す 'GetManagedValuesSource' と 'Span<>' を返す 'GetUnmanagedValuesDestination' メソッドを提供しません
ko: 형식 '{0}'은(는) '{1}' 마샬 모드를 지원하지만 'Span<>'을 반환하는 'ReadOnlySpan<>' 및 'GetUnmanagedValuesDestination' 메서드를 반환하는 'GetManagedValuesSource'를 제공하지 않습니다.
pl: Typ „{0}” określa, że obsługuje tryb przeprowadzenia marshalingu „{1}”, ale nie zapewnia metody „GetManagedValuesSource”, która zwraca wartość „ReadOnlySpan<>” ani metody „GetNativeValuesDestination”, która zwraca wartość „Span<>”
pt_br: O tipo “{0}” especifica que é compatível com o modo marshal “{1},” mas não fornece um 'GetManagedValuesSource' que retorna um método 'ReadOnlySpan<>' e um método 'GetUnmanagedValuesDestination' que retorna um 'Span<>'
ru: Тип "{0}" указывает, что он поддерживает режим маршалирования "{1}", но не предоставляет метод "GetManagedValuesSource", возвращающий "ReadOnlySpan<>", и метод GetUnmanagedValuesDestination, возвращающий "Span<>".
tr: '{0}' türü, '{1}' sıralama modunu desteklediğini belirtiyor, ancak 'ReadOnlySpan<>' döndüren bir 'GetManagedValuesSource' ve 'Span<>' döndüren bir ''GetUnmanagedValuesDestination' metodu sağlamıyor.
zh_hans: 类型“{0}”指定它支持“{1}”封送模式，但不提供返回“ReadOnlySpan<>”的“GetManagedValuesSource”和返回“Span<>”的“GetUnmanagedValuesDestination”方法
zh_hant: 類型 '{0}' 指定它支援 '{1}' 封送處理模式，但未提供傳回 'ReadOnlySpan<>' 的 'GetManagedValuesSource' 和傳回 'Span<>' 的 'GetNativeValuesDestination' 方法

# LinearCollectionOutRequiresCollectionMethodsDescription
source: A contiguous collection marshaller that supports marshalling from unmanaged to managed must provide a 'GetManagedValuesDestination' that takes an 'int' and returns a 'Span<>' and a 'GetUnmanagedValuesSource' method that takes an 'int' and returns a 'ReadOnlySpan<>'.
cs: Souvislý zařazovací modul kolekce, který podporuje zařazování z nespravovaného do spravovaného, musí poskytovat metodu GetManagedValuesDestination, která přijímá int a vrací metodu Span<> a GetUnmanagedValuesSource, která přijímá int a vrací readOnlySpan<>.
de: Ein zusammenhängender Sammlungsmarshaller, der das Marshallen von nicht verwaltet zu verwaltet unterstützt, muss ein „GetManagedValuesDestination“ bereitstellen, das ein „int“ akzeptiert und ein „Span<>“ und eine „GetUnmanagedValuesSource“-Methode zurückgibt, die ein „ReadOnlySpan<>“ zurückgibt.
es: Un serializador de colección contigua que admita serializaciones de no administrado a administrado debe proporcionar un método 'GetManagedValuesDestination' que tome "int" y devuelva un "Span<>" y un método "GetUnmanagedValuesSource" que tome "int" y devuelva "ReadOnlySpan<>".
fr: Un marshaleur de collection contigu qui prend en charge le marshaling de non managé à managé doit fournir un 'GetManagedValuesDestination' qui prend un 'int' et retourne 'Span<>' et une méthode 'GetUnmanagedValuesSource' qui prend un 'int' et retourne un 'ReadOnlySpan<>'.
it: Un marshaller di raccolta contiguo che supporta il marshalling da non gestito a gestito deve fornire un 'GetManagedValuesDestination' che accetta un 'int' e restituisce un 'Span<>' e un metodo 'GetUnmanagedValuesSource' che accetta 'int' e restituisce 'ReadOnlySpan<>'.
ja: アンマネージドからマネージドへのマーシャリングをサポートする連続したコレクション マーシャラーは、'int' を受け取り、'Span<>' を返す 'GetManagedValuesDestination' メソッドと、'int' を受け取って 'ReadOnlySpan<>' を返す 'GetUnmanagedValuesSource' メソッドを提供する必要があります。
ko: 비관리형부터 관리형까지 마샬링을 지원하는 연속 컬렉션 마샬러는 'int'를 입력하면 'Span<>'을 반환하는 'GetManagedValuesDestination'과 'Int'를 입력하면 'ReadOnlySpan<>'을 반환하는 'GetUnmanagedValuesSource' 메서드를 제공해야 합니다.
pl: Organizator zwartej kolekcji, który obsługuje przeprowadzanie marshalingu z niezarządzanych do zarządzanych, musi zapewniać metodę „GetManagedValuesDestination”, która przyjmuje wartość „int” i zwraca wartość „Span<>”, oraz metodę „GetUnmanagedValuesSource”, która przyjmuje wartość „int” i zwraca wartość „ReadOnlySpan<>”.
pt_br: Um marshaller de coleção contíguo que dê suporte ao marshaling de não gerenciado para gerenciado deve fornecer um método 'GetManagedValuesDestination' que aceita um 'int' e retorna um método 'Span<>' e um método 'GetUnmanagedValuesSource' que aceita um 'int' e retorna um 'ReadOnlySpan<>'.
ru: Непрерывный маршалер коллекции, поддерживающий маршалинг из управляемого в неуправляемый, должен предоставлять метод "GetManagedValuesDestination", который принимает "int" и возвращает "Span"<>, и метод "GetUnmanagedValuesSource", который принимает "int" и возвращает "ReadOnlySpan<>".
tr: Yönetilmeyenden yönetilene sıralamayı destekleyen bitişik bir koleksiyon sıralayıcı, 'int' alan ve 'Span<>' döndüren bir 'GetManagedValuesDestination' ile 'int' alan ve 'ReadOnlySpan<>' döndüren bir 'GetUnmanagedValuesSource' metodu sağlamalıdır.
zh_hans: 支持从非托管封送封送到托管的连续集合封送程序必须提供采用“int”并返回“Span<>”的“GetManagedValuesDestination”和采用“int”并返回“ReadOnlySpan<>”的“GetUnmanagedValuesSource”方法。
zh_hant: 支援從非受控到受控封送處理的連續集合封送處理程式必須提供接受 'int' 和傳回 'Span<>' 的 'GetManagedValuesDestination'，和接受 'int' 和傳回 'ReadOnlySpan<>' 的 'GetNativeValuesSource' 方法。

# LinearCollectionOutRequiresCollectionMethodsMessage
source: The type '{0}' specifies that it supports the '{1}' marshal mode, but it does not provide a 'GetManagedValuesDestination' that takes an 'int' and returns a 'Span<>' and a 'GetUnmanagedValuesSource' method that takes an 'int' and returns a 'ReadOnlySpan<>'
cs: Typ {0} určuje, že podporuje režim zařazování {1}, ale neposkytuje metodu GetManagedValuesDestination, která přijímá int a vrací metodu Span<> a GetUnmanagedValuesSource, která přijímá int a vrací readOnlySpan<>
de: Der Typ „{0}“ gibt an, dass der Marshalling-Modus „{1}“ unterstützt wird. Er stellt jedoch kein „GetManagedValuesDestination“ bereit, das ein „int“ akzeptiert und ein „Span<>“ und eine „GetUnmanagedValuesSource“-Methode zurückgibt, die ein „int“ und ein „ReadOnlySpan<>“ akzeptiert.
es: El tipo "{0}" especifica que admite el modo de serialización "{1}", pero no proporciona un "GetManagedValuesDestination" que tome un "int" y devuelva un "Span<>" y un método "GetUnmanagedValuesSource" que tome un "int" y devuelva un "ReadOnlySpan<>"
fr: Le type '{0}' spécifie qu’il prend en charge le mode marshal '{1}', mais il ne fournit pas de 'GetManagedValuesDestination' qui prend un 'int' et retourne 'Span<>' et une méthode 'GetUnmanagedValuesSource' qui prend un 'int' et retourne un 'ReadOnlySpan<>'
it: Il tipo '{0}' specifica che supporta la modalità di marshalling '{1}', ma non fornisce un 'GetManagedValuesDestination' che accetta 'int' e restituisce 'Span<>' e un metodo 'GetUnmanagedValuesSource' che accetta 'int' e restituisce 'ReadOnlySpan<>'
ja: 型 '{0}' は、マーシャリング モード '{1}' をサポートすることを指定しますが、'int' を受け取り、'Span<>' を返す 'GetManagedValuesDestination' メソッドと、'Int' を受け取って 'ReadOnlySpan<>' を返す 'GetUnmanagedValuesSource' メソッドを提供しません。
ko: '{0}' 형식은 '{1}' 마샬 모드를 지원하지만 'int'를 입력하면 'Span<>'을 반환하는 'GetManagedValuesDestination' 메서드 및 ‘int’를 입력하면 'ReadOnlySpan<>'을 반환하는 'GetUnmanagedValuesSource'을 제공하지 않습니다.
pl: Typ „{0}” określa, że obsługuje tryb przeprowadzania marshalingu „{1}”, ale nie zapewnia metody „GetManagedValuesDestination”, która przyjmuje wartość „int” i zwraca wartość „Span<>”, oraz metodę „GetUnmanagedValuesSource”, która przyjmuje wartość „int” i zwraca wartość „ReadOnlySpan<>”
pt_br: O tipo “{0}” especifica que dá suporte ao modo marshal “{1}”, mas não fornece um método 'GetManagedValuesDestination' que recebe um 'int' e retorna um método 'Span<>' e um método 'GetUnmanagedValuesSource' que usa um 'int' e retorna um 'ReadOnlySpan<>'
ru: Тип "{0}" указывает, что он поддерживает маршализацию "{1}"l, но не предоставляет "GetManagedValuesDestination", принимающий "int" и возвращающий "Span<>", и метод "GetUnmanagedValuesSource", принимающий "int" и возвращающий "ReadOnlySpan<>"
tr: '{0}' türü, '{1}' sıralama modunu desteklediğini belirtiyor, ancak 'int' alan ve 'Span<>' döndüren bir 'GetManagedValuesDestination' ile 'int' alan ve 'ReadOnlySpan<>' döndüren bir 'GetUnmanagedValuesSource' metodu sağlamıyor.
zh_hans: 类型“{0}”指定它支持“{1}”封送模式，但不提供采用“int”并返回“Span<>”的“GetManagedValuesDestination”和采用“int”并返回“ReadOnlySpan<>”的“GetUnmanagedValuesSource”方法
zh_hant: 類型 '{0}' 指定它支援 '{1}' 封送處理模式，但未提供接受 'int' 和傳回 'Span<>' 的 'GetManagedValuesDestination'，和接受 'int' 和傳回 'ReadOnlySpan<>' 的 'GetNativeValuesSource' 方法

# ManagedToUnmanagedMissingRequiredMarshaller
source: The specified parameter needs to be marshalled from managed to unmanaged, but the marshaller type '{0}' does not support it.
cs: Určený parametr musí být zařazený ze spravovaného do nespravovaného, ale zařazovací typ {0} to nepodporuje.
de: Der angegebene Parameter muss von verwaltet zu nicht verwaltet gemarshallt werden, aber der Marshaller-Typ ‚{0}‘ unterstützt dies nicht.
es: El parámetro especificado debe serializarse de administrado a no administrado, pero el tipo no administrado “{0}” no lo admite.
fr: Le paramètre spécifié doit être marshalé de managé à non managé, mais le type marshaleur « {0} » ne le prend pas en charge.
it: È necessario effettuare il marshalling del parametro specificato da gestito a non gestito, ma il tipo di gestore del marshalling '{0}' non lo supporta.
ja: 指定されたパラメーターはマネージドからアンマネージドにマーシャリングする必要がありますが、マーシャラー型 '{0}' ではそれはサポートされていません。
ko: 지정된 매개 변수를 관리형에서 비관리형으로 마샬링해야 하지만 마샬러 유형 '{0}'은(는) 지원하지 않습니다.
pl: Określony parametr musi być kierowany z zarządzanego do niezarządzanego, ale typ marszałka „{0}” go nie obsługuje.
pt_br: O parâmetro especificado precisa ser marshalled de gerenciado para não gerenciado, mas o tipo de marshaller '{0}' não dá suporte a ele.
ru: Указанный параметр необходимо маршалировать из управляемого в неуправляемый, но тип маршаллера "{0}" не поддерживает это.
tr: Belirtilen parametrenin yönetilenden yönetilmeyene doğru hazırlanması gerekiyor, ancak '{0}' hazırlayıcı türü bunu desteklemiyor.
zh_hans: 需要将指定的参数从托管封送到非托管，但封送程序类型“{0}”不支持它。
zh_hant: 指定的參數必須從受控封送處理到非受控，但封送處理程式類型 '{0}' 不支援。

# ManagedTypeMustBeClosedOrMatchArityDescription
source: The marshaller type must be a closed generic or have the same number of generic parameters as the managed type so the generator can determine which methods are available on the specific marshaller types.
cs: Zařazovací typ musí být uzavřený obecný typ nebo mít stejný počet obecných parametrů jako spravovaný typ, aby generátor mohl určit, které metody jsou dostupné u konkrétních zařazovacích typů.
de: Der Marshallertyp muss ein geschlossener generischer Typ sein oder dieselbe Anzahl generischer Parameter wie der verwaltete Typ aufweisen, damit der Generator bestimmen kann, welche Methoden für die spezifischen Marshallertypen verfügbar sind.
es: El tipo de serializador debe ser un genérico cerrado o tener el mismo número de parámetros genéricos que el tipo administrado para que el generador pueda determinar qué métodos están disponibles en los tipos de serializador específicos.
fr: Le type de marshaleur doit être un générique fermé ou avoir le même nombre de paramètres génériques que le type managé pour que le générateur puisse déterminer quelles méthodes sont disponibles sur les types de marshaleurs spécifiques.
it: Il tipo di marshaller deve essere un tipo generico chiuso o avere lo stesso numero di parametri generici del tipo gestito, in modo che il generatore possa determinare quali metodi sono disponibili nei tipi di marshaller specifici.
ja: マーシャラー型は、クローズ ジェネリックであるか、マネージド型と同じ数のジェネリック パラメーターを持つ必要があります。これにより、ジェネレーターが特定のマーシャラー型で使用できるメソッドを特定できるようになります。
ko: 생성기가 특정 마샬러 유형에서 사용할 수 있는 메서드를 결정할 수 있도록 마샬러 형식은 닫힌 제네릭이거나 관리되는 형식과 동일한 수의 제네릭 매개 변수를 가져야 합니다.
pl: Typ marshallera musi być zamkniętym typem ogólnym lub mieć taką samą liczbę parametrów ogólnych jak typ zarządzany, aby generator mógł określić, które metody są dostępne na określonych typach marshallerów.
pt_br: O tipo de empacotador deve ser um genérico fechado ou ter o mesmo número de parâmetros genéricos que o tipo gerenciado para que o gerador possa determinar quais métodos estão disponíveis nos tipos de empacotador específicos.
ru: Тип маршалера должен быть закрытым универсальным типом или у него должно быть столько же универсальных параметров, как у управляемого типа, чтобы генератор мог определить, какие методы доступны для определенных типов маршалеров.
tr: Oluşturucunun belirli hazırlayıcı türlerde hangi yöntemlerin kullanılabilir olduğunu belirleyebilmesi için hazırlayıcı kapalı bir genel tür olmalıdır veya yönetilen türle aynı sayıda genel parametreye sahip olmalıdır.
zh_hans: 封送处理程序类型必须是封闭泛型或具有与托管类型相同的泛型参数，以便生成器可以确定哪些方法可用于特定封送处理程序类型。
zh_hant: 封送處理器類型必須是封閉的泛型或具有與受控類型相同的泛型參數數目，以便產生器可以判斷哪些方法可用於特定的封送處理器類型。

# ManagedTypeMustBeClosedOrMatchArityMessage
source: The managed type '{0}' for entry-point marshaller type '{1}' must be a closed generic type, have the same arity as the managed type if it is a value marshaller, or have one additional generic parameter if it is a collection marshaller.
cs: Spravovaný typ {0} pro zařazovací typ vstupního bodu {1} musí být uzavřený obecný typ, mít stejnou aritu jako spravovaný typ, pokud se jedná o zařazování hodnot, nebo mít jeden další obecný parametr, pokud se jedná o zařazování kolekcí.
de: Der verwalteten Typ "{0}" für den Einstiegspunkt-Marshallertyp "{1}" muss ein geschlossener generischer Typ sein, dieselbe Stelligkeit wie der verwaltete Typ aufweisen, wenn es sich um einen Wertmarshaller handelt, oder einen zusätzlichen generischen Parameter aufweisen, wenn es sich um einen Auflistungsmarshaller handelt.
es: El tipo administrado "{0}" para el tipo de serializador de punto de entrada "{1}" debe ser un tipo genérico cerrado, tener la misma aridad que el tipo administrado si es un serializador de valores o tener un parámetro genérico adicional si es un serializador de colección.
fr: Le type managé « {0} » pour le type marshaleur de point d’entrée « {1} » doit être un type générique fermé, avoir la même arité que le type managé s’il s’agit d’un marshaleur de valeurs ou avoir un paramètre générique supplémentaire s’il s’agit d’un marshaleur de collection.
it: Il tipo gestito '{0}' per il tipo di marshaller di ingresso '{1}' deve essere un tipo generico chiuso, avere lo stesso grado del tipo gestito se si tratta di un marshaller di valori o avere un parametro generico aggiuntivo se si tratta di un marshaller di raccolta.
ja: エントリ ポイント マーシャラー型 '{1}' のマネージド型 '{0}' は、クローズ ジェネリック型であるか、値マーシャラーの場合はマネージ型と同じアリティを持つ、またはコレクション マーシャラーの場合は追加のジェネリック パラメーターを 1 つ指定する必要があります。
ko: 진입점 마샬러 유형 '{1}'에 대한 관리 유형 '{0}'은(는) 닫힌 제네릭 유형이어야 하고, 값 마샬러인 경우 관리 유형과 동일한 우선순위를 가져야 하며, 컬렉션 마샬러인 경우 하나의 추가 제네릭 매개 변수가 있어야 합니다.
pl: Typ zarządzany „{0}” dla typu marshaller punktu wejścia „{1}” musi być zamkniętym typem ogólnym, mieć taką samą argumentację jak typ zarządzany, jeśli jest to marshaller wartości lub mieć jeden dodatkowy parametr ogólny, jeśli jest to marshaller kolekcji.
pt_br: O tipo gerenciado '{0}' para o tipo de empacotador de ponto de entrada '{1}' deve ser um tipo genérico fechado, ter a mesma aridade que o tipo gerenciado se for um empacotador de valor ou ter um parâmetro genérico adicional se for um empacotador de coleção.
ru: Управляемый тип "{0}" для типа маршалера точки входа "{1}" должен быть закрытым универсальным типом, его арность должна быть такой же, как у управляемого типа, если это маршалер значений, либо у него должен быть один дополнительный универсальный параметр, если это маршалер коллекций.
tr: Giriş noktası hazırlayıcı türü '{1}' için yönetilen tür '{0}', kapalı bir genel tür olmalı, bir değer hazırlayıcı olması durumunda yönetilen türle aynı parametreye sahip olmalı, koleksiyon hazırlayıcı olması durumunda ise ek genel parametreye sahip olmalıdır.
zh_hans: 适用于入口点封送处理程序类型“{1}”的托管类型“{0}”必须是封闭式泛型类型，如果托管类型是值封送处理程序，则该类型必须与托管类型具有相同的 arity；如果托管类型是集合封送处理程序，则它多具有一个泛型参数。
zh_hant: 進入點封送處理器類型 '{1}' 的受控類型 '{0}' 必須是封閉的泛型類型、如果是值封送處理器，則其 arity 必須與受控類型相同，如果是集合封送處理器，則必須有另一個泛型參數。

# ManagedTypeMustBeNonNullDescription
source: The managed type for a custom marshaller must be non-null.
cs: Spravovaný typ vlastního zařazování nesmí nabývat hodnoty null.
de: Der verwaltete Typ für einen benutzerdefinierten Marshaller darf nicht NULL sein.
es: El tipo administrado de un serializador personalizado no debe ser nulo.
fr: Le type managé d’un marshaleur personnalisé doit être non null.
it: Il tipo gestito per un marshaller personalizzato deve essere non null.
ja: カスタム マーシャラーのマネージド型は null 以外である必要があります。
ko: 사용자 지정 마샬러의 관리 형식은 null이 아니어야 합니다.
pl: Typ zarządzany dla niestandardowego marshallera musi mieć wartość inną niż null.
pt_br: O tipo gerenciado para um empacotador personalizado deve ser não nulo.
ru: Управляемый тип для настраиваемого маршалера должен отличаться от "NULL".
tr: Özel hazırlayıcı için yönetilen tür, null olmayan bir değer olmalıdır.
zh_hans: 自定义封送处理程序的托管类型必须为非 null。
zh_hant: 自訂封送處理器的受控類型必須是非 Null。

# ManagedTypeMustBeNonNullMessage
source: The managed type for the entry-point marshaller type '{0}' must not be 'null'
cs: Spravovaný typ pro zařazovací typ vstupního bodu {0} nesmí nabývat hodnoty null.
de: Der verwaltete Typ für den Einstiegspunkt-Marshallertyp "{0}" darf nicht "NULL" sein
es: El tipo administrado para el tipo de serializador de punto de entrada "{0}" no debe ser "null"
fr: Le type managé du type marshaleur de point d’entrée « {0} » ne doit pas avoir la valeur 'null'
it: Il tipo gestito per il tipo di marshaller del punto di ingresso '{0}' non deve essere 'null'
ja: エントリ ポイント マーシャラー型 '{0}' のマネージド型を 'null' にすることはできません
ko: 진입점 마샬러 유형 '{0}'의 관리 유형은 'null'이 아니어야 합니다.
pl: Typ zarządzany dla typu marshaller punktu wejścia „{0}” nie może mieć wartości „null”
pt_br: O tipo gerenciado para o tipo de empacotador de ponto de entrada '{0}' não deve ser 'nulo'
ru: Управляемый тип для типа маршалера точки входа "{0}" должен отличаться от "NULL"
tr: Giriş noktası hazırlayıcı türü '{0}' için yönetilen tür 'null' olmamalıdır
zh_hans: 入口点封送处理程序类型“{0}”的托管类型不能为“null”
zh_hant: 進入點封送處理器類型 '{0}' 的受控類型不得為 'null'
