Repository: dotnet/runtime
Catalog: src/libraries/System.Runtime.InteropServices/gen/Common/Resources/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# AddGeneratedComClassAddUnsafe
source: Add 'GeneratedComClassAttribute' to enable passing objects of this type to COM and allow unsafe code
cs: Pokud chcete povolit předávání objektů tohoto typu do modelu COM a povolit nebezpečný kód, přidejte GeneratedComClassAttribute.
de: Fügen Sie "GeneratedComClassAttribute" hinzu, um die Übergabe von Objekten dieses Typs an COM zu ermöglichen und unsicheren Code zuzulassen.
es: Agregar "GeneratedComClassAttribute" para habilitar el paso de objetos de este tipo a COM y permitir código no seguro
fr: Ajoutez 'GeneratedComClassAttribute' pour permettre le passage d'objets de ce type à COM et autoriser le code non sécurisé
it: Aggiungere 'GeneratedComClassAttribute' per consentire il passaggio di oggetti di questo tipo a COM e consentire il codice non gestito
ja: 'GeneratedComClassAttribute' を追加して、この型のオブジェクトを COM に渡し、安全でないコードを許可できるようにします
ko: 이 유형의 개체를 COM에 전달하고 안전하지 않은 코드를 허용하려면 'GeneratedComClassAttribute'를 추가하세요.
pl: Dodaj atrybut „GeneratedComClassAttribute”, aby umożliwić przekazywanie obiektów tego typu do modelu COM i zezwalać na niebezpieczny kod
pt_br: Adicionar 'GeneratedComClassAttribute' para habilitar a passagem de objetos desse tipo para COM e permitir código não seguro
ru: Добавьте "GeneratedComClassAttribute", чтобы включить передачу объектов этого типа в COM и разрешить небезопасный код
tr: Bu türdeki nesnelerin COM'a geçirilmesini etkinleştirmek ve güvenli olmayan koda izin vermek için 'GeneratedComClassAttribute' ekleyin
zh_hans: 添加“GeneratedComClassAttribute”以启用将此类对象传递到 COM，并允许不安全代码
zh_hant: 新增 'GeneratedComClassAttribute' 以啟用將此類型的物件傳遞至 COM 並允許不安全的程式碼

# AddGeneratedComClassAttributeDescription
source: This type implements at least one type with the 'GeneratedComInterfaceAttribute' attribute. Add the 'GeneratedComClassAttribute' to enable passing this type to COM and exposing the COM interfaces for the types with the 'GeneratedComInterfaceAttribute' from objects of this type.
cs: Tento typ implementuje alespoň jeden typ s atributem GeneratedComInterfaceAttribute. Přidejte generatedComClassAttribute, aby bylo možné předat tento typ modelu COM a zpřístupnit rozhraní COM pro typy s generatedComInterfaceAttribute z objektů tohoto typu.
de: Dieser Typ implementiert mindestens einen Typ mit dem GeneratedComInterfaceAttribute-Attribut. Fügen Sie "GeneratedComClassAttribute" hinzu, um die Übergabe dieses Typs an COM zu ermöglichen und die COM-Schnittstellen für die Typen mit dem GeneratedComInterfaceAttribute aus Objekten dieses Typs verfügbar zu machen.
es: Este tipo implementa al menos un tipo con el atributo “GeneratedComInterfaceAttribute”. Agregue “GeneratedComClassAttribute” para habilitar el paso de este tipo a COM y exponer las interfaces COM para los tipos con “GeneratedComInterfaceAttribute” a partir de objetos de este tipo.
fr: Ce type implémente au moins un type avec l'attribut 'GeneratedComInterfaceAttribute'. Ajoutez le 'GeneratedComClassAttribute' pour activer le passage de ce type à COM et exposer les interfaces COM pour les types avec le 'GeneratedComInterfaceAttribute' des objets de ce type.
it: Questo tipo implementa almeno un tipo con l'attributo 'GeneratedComInterfaceAttribute'. Aggiungere l'attributo 'GeneratedComClassAttribute' per consentire il passaggio di questo tipo a COM e l'esposizione delle interfacce COM per i tipi con l'attributo 'GeneratedComInterfaceAttribute' dagli oggetti di questo tipo.
ja: この型は、'GeneratedComInterfaceAttribute' 属性を持つ少なくとも 1 つの型を実装します。'GeneratedComClassAttribute' を追加して、この型を COM に渡し、この型のオブジェクトから 'GeneratedComInterfaceAttribute' を持つ型の COM インターフェイスを公開できるようにします。
ko: 이 유형은 'GeneratedComInterfaceAttribute' 특성이 있는 하나 이상의 유형을 구현합니다. 이 형식을 COM에 전달하고 이 형식의 개체에서 'GeneratedComInterfaceAttribute'가 있는 형식에 대한 COM 인터페이스를 노출하려면 'GeneratedComClassAttribute'를 추가합니다.
pl: Ten typ implementuje co najmniej jeden typ z atrybutem „GeneratedComInterfaceAttribute”. Dodaj atrybut „GeneratedComClassAttribute”, aby umożliwić przekazywanie tego typu do modelu COM i uwidacznianie interfejsów COM dla typów z atrybutem „GeneratedComInterfaceAttribute” z obiektów tego typu.
pt_br: Esse tipo implementa pelo menos um tipo com o atributo 'GeneratedComInterfaceAttribute'. Adicione o 'GeneratedComClassAttribute' para habilitar a passagem desse tipo para COM e expor as interfaces COM para os tipos com o 'GeneratedComInterfaceAttribute' de objetos desse tipo.
ru: Этот тип реализует по крайней мере один тип с атрибутом "GeneratedComInterfaceAttribute". Добавьте "GeneratedComClassAttribute", чтобы разрешить передачу этого типа в COM и предоставление COM-интерфейсов для типов с "GeneratedComInterfaceAttribute" из объектов этого типа.
tr: Bu tür, 'GeneratedComInterfaceAttribute' özniteliğine sahip en az bir tür uygular. Bu türü COM'a geçirmeyi ve bu türdeki nesnelerden 'GeneratedComInterfaceAttribute' içeren türler için COM arabirimlerini açığa çıkarmayı etkinleştirmek için 'GeneratedComClassAttribute' ekleyin.
zh_hans: 此类型至少实现一个具有“GeneratedComInterfaceAttribute”属性的类型。添加“GeneratedComClassAttribute”以允许将此类型传递到 COM，并公开具有此类型的对象的“GeneratedComInterfaceAttribute”的类型的 COM 接口。
zh_hant: 此類型至少實作一個具有 'GeneratedComInterfaceAttribute' 屬性的類型。新增 'GeneratedComClassAttribute' 以啟用將此類型傳遞到 COM，並公開具有此類型物件之 'GeneratedComInterfaceAttribute' 類型的 COM 介面。

# AddGeneratedComClassAttributeMessage
source: Add the 'GeneratedComClassAttribute' to '{0}' to enable passing objects of type '{0}' to COM
cs: Přidáním generatedComClassAttribute do {0} povolíte předávání objektů typu {0} do modelu COM.
de: Fügen Sie "GeneratedComClassAttribute" zu "{0}" hinzu, um die Übergabe von Objekten vom Typ "{0}" an COM zu ermöglichen.
es: Agregar "GeneratedComClassAttribute" a “{0}” para habilitar el paso de objetos de tipo “{0}” a COM
fr: Ajoutez le 'GeneratedComClassAttribute' à '{0}' pour permettre le passage d'objets de type '{0}' à COM
it: Aggiungere 'GeneratedComClassAttribute' a '{0}' per abilitare il passaggio di oggetti di tipo '{0}' a COM
ja: 'GeneratedComClassAttribute' を '{0}' に追加して、型 '{0}' のオブジェクトを COM に渡すことを有効にします
ko: '{0}' 유형의 개체를 COM에 전달할 수 있도록 'GeneratedComClassAttribute'를 '{0}'에 추가
pl: Dodaj atrybut „GeneratedComClassAttribute” do „{0}”, aby umożliwić przekazywanie obiektów typu „{0}” do modelu COM
pt_br: Adicione o 'GeneratedComClassAttribute' a '{0}' para habilitar a passagem de objetos do tipo '{0}' para COM
ru: Добавьте "GeneratedComClassAttribute" к "{0}", чтобы включить передачу объектов типа "{0}" в COM
tr: '{0}' türündeki nesneleri COM'a geçirmeyi etkinleştirmek için 'GeneratedComClassAttribute' öğesini '{0}'a ekleyin
zh_hans: 将“GeneratedComClassAttribute”添加到“{0}”以启用将“{0}”类型的对象传递到 COM
zh_hant: 將 'GeneratedComClassAttribute' 新增至 '{0}' 以啟用將類型 '{0}' 的物件傳遞至 COM

# AddGeneratedComClassAttributeTitle
source: Add 'GeneratedComClassAttribute' to enable passing objects of this type to COM
cs: Pokud chcete povolit předávání objektů tohoto typu do modelu COM, přidejte GeneratedComClassAttribute
de: Fügen Sie "GeneratedComClassAttribute" hinzu, um die Übergabe von Objekten dieses Typs an COM zu ermöglichen.
es: Agregar "GeneratedComClassAttribute" para habilitar el paso de objetos de este tipo a COM
fr: Ajouter 'GeneratedComClassAttribute' pour permettre le passage d'objets de ce type à COM
it: Aggiungere 'GeneratedComClassAttribute' per consentire il passaggio di oggetti di questo tipo a COM.
ja: 'GeneratedComClassAttribute' を追加して、この型のオブジェクトを COM に渡すことを有効にします
ko: 이 유형의 개체를 COM에 전달할 수 있도록 'GeneratedComClassAttribute' 추가
pl: Dodaj atrybut „GeneratedComClassAttribute”, aby umożliwić przekazywanie obiektów tego typu do modelu COM
pt_br: Adicionar 'GeneratedComClassAttribute' para habilitar a passagem de objetos deste tipo para COM
ru: Добавьте "GeneratedComClassAttribute", чтобы включить передачу объектов этого типа в COM
tr: Bu türdeki nesneleri COM'a geçirmeyi etkinleştirmek için 'GeneratedComClassAttribute' ekleyin
zh_hans: 添加“GeneratedComClassAttribute”以启用将此类型的对象传递到 COM
zh_hant: 新增 'GeneratedComClassAttribute' 以啟用將此類型的物件傳遞至 COM

source: Add missing custom type marshaller members
cs: Přidat chybějící vlastní typu zařazovacích členů
de: Hinzufügen fehlender benutzerdefinierter Marshallermember
es: Agregue los miembros de serializador de tipo personalizado que faltan
fr: Ajouter les membres du marshaleur de type personnalisé manquants
it: Aggiungi membri mancanti del gestore del marshalling di tipi personalizzato mancanti
ja: 不足しているカスタム型マーシャラー メンバーの追加
ko: 누락된 사용자 지정 형식 마샬러 구성원 추가
pl: Dodaj brakujące składowe elementu przeprowadzającego marshalling typu niestandardowego
pt_br: Adicionar membros marshaller de tipo personalizado ausentes
ru: Добавить отсутствующие элементы маршалатора настраиваемого типа
tr: Eksik olan özel tür sıralayıcı üyelerini ekleyin
zh_hans: 添加缺少的自定义类型封送程序成员
zh_hant: 新增遺漏的自訂類型排列器成員

# AnalysisFailedDescription
source: The analysis required to generate code for this interface or method has failed due to an unexpected code pattern. If you are using new or unconventional syntax, consider using other syntax.
cs: Analýza požadovaná ke generování kódu pro toto rozhraní nebo metodu se nezdařila kvůli neočekávanému vzoru kódu. Pokud používáte novou nebo nekonvenční syntaxi, zvažte použití jiné syntaxe.
de: Die Analyse, die erforderlich ist, um Code für diese Schnittstelle oder Methode zu erzeugen, ist aufgrund eines unerwarteten Codemusters fehlgeschlagen. Wenn Sie eine neue oder unkonventionelle Syntax verwenden, sollten Sie eine andere Syntax verwenden.
es: Se ha producido un error en el análisis necesario para generar código para esta interfaz o método debido a un patrón de código inesperado. Si está usando sintaxis nueva o no convencional, considere la posibilidad de usar otra sintaxis.
fr: L’analyse requise pour générer du code pour cette interface ou cette méthode a échoué en raison d’un modèle de code inattendu. Si vous utilisez une syntaxe nouvelle ou syntaxe correcte, utilisez une autre syntaxe.
it: L'analisi necessaria per generare il codice per questa interfaccia o per questo metodo non è riuscita a causa di un modello di codice imprevisto. Se si usa una sintassi nuova o non intenzionale, provare a usare un'altra sintassi.
ja: 予期しないコード パターンのため、このインターフェイスまたはメソッドのコードを生成するために必要な分析が失敗しました。新しい構文または従来とは異なる構文を使用している場合は、他の構文の使用を検討してください。
ko: 예기치 않은 코드 패턴으로 인해 이 인터페이스 또는 메서드에 대한 코드를 생성하는 데 필요한 분석이 실패했습니다. 새 구문 또는 이례적 구문을 사용하는 경우 다른 구문을 사용하는 것이 좋습니다.
pl: Analiza wymagana do wygenerowania kodu dla tego interfejsu lub metody nie powiodła się z powodu nieoczekiwanego wzorca kodu. Jeśli używasz nowej składni lub nieszablonowej składni, rozważ użycie innej składni.
pt_br: A análise necessária para gerar código para essa interface ou método falhou devido a um padrão de código inesperado. Se você estiver usando sintaxe nova ou não convencional, considere usar outra sintaxe.
ru: Произошел сбой анализа, необходимого для создания кода для этого интерфейса или метода, из-за непредвиденного шаблона кода. Если вы используйте новый или нестандартный синтаксис, попробуйте использовать другой синтаксис.
tr: Bu arabirim veya yöntem için kod oluşturmak için gerekli analiz beklenmeyen bir kod deseni nedeniyle başarısız oldu. Yeni veya alışılmadık bir söz dizimi kullanıyorsanız başka bir söz dizimi kullanmayı deneyin.
zh_hans: 由于意外的代码模式，为此接口或方法生成代码所需的分析失败。如果你使用的是新语法或非常规语法，请考虑使用其他语法。
zh_hant: 產生此介面或方法程式碼所需的分析失敗，因為有未預期的程式碼模式。如果您使用的是新語法或非常規語法，請考慮使用其他語法。

# AnalysisFailedInterfaceMessage
source: Analysis of interface '{0}' has failed. ComInterfaceGenerator will not generate code for this interface.
cs: Analýza rozhraní {0} se nezdařila. ComInterfaceGenerator nevygeneruje kód pro toto rozhraní.
de: Fehler bei der Analyse der Schnittstelle "{0}". ComInterfaceGenerator generiert keinen Code für diese Methode.
es: Error en el análisis de la interfaz "{0}". ComInterfaceGenerator no generará código para esta interfaz.
fr: Nous n’avons pas pu analyser l’interface '{0}'. ComInterfaceGenerator ne générera pas de code pour cette interface.
it: L'analisi dell’interfaccia '{0}' non è riuscita. ComInterfaceGenerator non genererà codice per questa interfaccia.
ja: インターフェイス '{0}' の分析に失敗しました。ComInterfaceGenerator はこのインターフェイスのコードを生成しません。
ko: '{0}' 인터페이스를 분석하지 못했습니다. ComInterfaceGenerator에서 이 인터페이스에 대한 코드를 생성하지 않습니다.
pl: Analiza interfejsu „{0}” nie powiodła się. Element ComInterfaceGenerator nie wygeneruje kodu dla tego interfejsu.
pt_br: Falha na análise da interface '{0}'. ComInterfaceGenerator não gerará código para esta interface.
ru: Сбой анализа интерфейса "{0}". ComInterfaceGenerator не будет создавать код для этого интерфейса.
tr: ‘{0}’ arabiriminin analizi başarısız oldu. ComInterfaceGenerator bu arabirim için kod oluşturmayacak.
zh_hans: 接口“{0}”的分析失败。ComInterfaceGenerator 将不会为此接口生成代码。
zh_hant: 介面 '{0}' 分析失敗。ComInterfaceGenerator 不會產生此介面的程式碼。

# AnalysisFailedMethodMessage
source: Analysis of method '{0}' has failed. ComInterfaceGenerator will not generate code for this method.
cs: Analýza metody {0} se nezdařila. ComInterfaceGenerator nevygeneruje kód pro tuto metodu.
de: Fehler bei der Analyse der Methode "{0}". ComInterfaceGenerator generiert keinen Code für diese Methode.
es: Error en el análisis del método "{0}". ComInterfaceGenerator no generará código para este método.
fr: Nous n’avons pas pu analyser la méthode '{0}'. ComInterfaceGenerator ne générera pas de code pour cette méthode.
it: L'analisi del metodo '{0}' non è riuscita. ComInterfaceGenerator non genererà codice per questo metodo.
ja: メソッド '{0}' の分析に失敗しました。ComInterfaceGenerator はこのメソッドのコードを生成しません。
ko: '{0}' 메서드를 분석하지 못했습니다. ComInterfaceGenerator에서 이 메서드에 대한 코드를 생성하지 않습니다.
pl: Analiza metody „{0}” nie powiodła się. Element ComInterfaceGenerator nie wygeneruje kodu dla tej metody.
pt_br: Falha na análise do método '{0}'. ComInterfaceGenerator não gerará código para este método.
ru: Сбой анализа метода "{0}". ComInterfaceGenerator не будет создавать код для этого метода.
tr: ‘{0}’ yönteminin analizi başarısız oldu. ComInterfaceGenerator bu yöntem için kod oluşturmayacak.
zh_hans: 方法“{0}”的分析失败。ComInterfaceGenerator 将不会为此方法生成代码。
zh_hant: 方法 '{0}' 分析失敗。ComInterfaceGenerator 不會產生此方法的程式碼。

# AnalysisFailedTitle
source: Analysis for COM interface generation has failed.
cs: Analýza generování rozhraní COM se nezdařila.
de: Die Analyse für die COM-Schnittstellengenerierung ist fehlgeschlagen.
es: Error al analizar la generación de la interfaz COM.
fr: L’analyse de la génération de l’interface COM a échoué.
it: L'analisi per la generazione dell'interfaccia COM non è riuscita.
ja: COM インターフェイス生成の分析に失敗しました。
ko: COM 인터페이스 생성에 대한 분석이 실패했습니다.
pl: Analiza generowania interfejsu COM nie powiodła się.
pt_br: A análise da geração da interface COM falhou.
ru: Сбой анализа для создания COM-интерфейсу.
tr: COM arabirimi oluşturma analizi başarısız oldu.
zh_hans: COM 接口生成分析失败。
zh_hant: COM 介面產生的分析失敗。

# ArraySizeMustBeSpecified
source: Marshalling an array from unmanaged to managed requires either the 'SizeParamIndex' or 'SizeConst' fields to be set on a 'MarshalAsAttribute' or the 'ConstantElementCount' or 'CountElementName' properties to be set on a 'MarshalUsingAttribute'.
cs: Zařazování pole z nespravovaného na spravované vyžaduje aby pole SizeParamIndex nebo SizeConst byla nastavena buď na MarshalAsAttribute, nebo aby byly vlastnosti ConstantElementCount nebo CountElementName nastaveny na MarshalUsingAttribute.
de: Für das Marshalling eines Arrays von \"nicht verwaltet\" in \"verwaltet\" müssen entweder die Felder \"SizeParamIndex\" oder \"SizeConst\" für ein MarshalAsAttribute festgelegt werden, oder die Eigenschaften \"ConstantElementCount\" oder \"CountElementName\" müssen für ein MarshalUsingAttribute festgelegt werden.
es: La serialización de una matriz de no administrada a administrada requiere, o bien que los campos “SizeParamIndex” o “SizeConst” se establezcan en un “MarshalAsAttribute”, o bien que las propiedades “ConstantElementCount” o “CountElementName” se establezcan en un “MarshalUsingAttribute”.
fr: Le marshaling d’un tableau de non managé à managé nécessite que les champs « SizeParamIndex » ou « SizeConst » soient définis sur un « MarshalAsAttribute » ou les propriétés « ConstantElementCount » ou 'CountElementName' à définir sur un « MarshalUsingAttribute ».
it: Per il marshalling di una matrice da non gestita a gestita è richiesta l'impostazione dei campi 'SizeParamIndex' o 'SizeConst' in un elemento 'MarshalAsAttribute' oppure l'impostazione delle proprietà 'ConstantElementCount' o 'CountElementName' in un elemento 'MarshalUsingAttribute'.
ja: アンマネージドからマネージドに配列をマーシャリングするには、'MarshalAsAttribute' に 'SizeParamIndex' または 'SizeConst' フィールドを設定するか、'MarshalUsingAttribute' に 'ConstantElementCount' プロパティまたは 'CountElementName' プロパティを設定する必要があります。
ko: 비관리형에서 관리형으로 배열을 마샬링하려면 'MarshalAsAttribute'에 'SizeParamIndex' 또는 'SizeConst' 필드를 설정하거나 'MarshalUsingAttribute'에 'ConstantElementCount' 또는 'CountElementName' 속성을 설정해야 합니다.
pl: Skierowanie tablicy z niezarządzanej do zarządzanej wymaga ustawienia pól „SizeParamIndex” lub „SizeConst” we właściwościach dla atrybutu„MarshalAsAttribute” lub wartości „ConstantElementCount” lub elementu „CountElementName” we właściwościach dla atrybutu „MarshalUsingAttribute”.
pt_br: Realizar marshaling de uma matriz de não gerenciada para gerenciada requer que os campos 'SizeParamIndex' ou 'SizeConst' sejam definidos em um 'MarshalAsAttribute' ou nas propriedades 'ConstantElementCount' ou 'CountElementName' a serem definidos em um 'MarshalUsingAttribute'.
ru: Маршализация массива из неуправляемого кода в управляемый требует, чтобы в \"MarshalAsAttribute\" было задано поле \"SizeParamIndex\" или \"SizeConst\", или в \"MarshalUsingAttribute\" было задано свойство \"ConstantElementCount\" или \"CountElementName\".
tr: Bir diziyi yönetilmeyenden yönetilene sıralamak için 'SizeParamIndex' veya 'SizeConst' alanlarının 'MarshalAsAttribute' olarak ya da 'ConstantElementCount' veya 'CountElementName' özelliklerinin bir 'MarshalUsingAttribute' olarak ayarlanmış olması gerekir.
zh_hans: 对从非托管到托管的数组进行封送需要在 “MarshalAsAttribute” 或 “ConstantElementCount” 或 “CountElementName” 属性上设置 “SizeParamIndex” 或 “SizeConst” 字段。
zh_hant: 將數組從未受管理排列到受管理，需要在 'MarshalUsingAttribute' 上設定 'SizeParamIndex' 或 'SizeConst' 字段，或在 'MarshalUsingAttribute' 上設定 'ConstantElementCount' 或 'CountElementName' 屬性。

# BaseInterfaceCannotBeGeneratedDescription
source: COM interface source generation requires all base COM interfaces to be valid interfaces. Fix any issues on the base interface to resolve this diagnostic.
cs: Generování zdroje rozhraní COM vyžaduje, aby všechna základní rozhraní COM byla platná rozhraní. Vyřešte tuto diagnostiku tím, že opravíte všechny problémy v základním rozhraní.
de: Für die Generierung von COM-Schnittstellenquellen müssen alle COM-Basisschnittstellen gültige Schnittstellen sein. Beheben Sie alle Probleme auf der Basisschnittstelle, um diese Diagnose zu beheben.
es: La generación de orígenes de interfaz COM requiere que todas las interfaces COM base sean interfaces válidas. Corrija los problemas de la interfaz base para resolver este diagnóstico.
fr: La génération de source d’interface COM nécessite que toutes les interfaces COM de base soient des interfaces valides. Corrigez les problèmes éventuels sur l’interface de base pour résoudre ce diagnostic.
it: La generazione dell'origine dell'interfaccia COM richiede che tutte le interfacce COM di base siano interfacce valide. Risolvere eventuali problemi nell'interfaccia di base per risolvere questa diagnostica.
ja: COM インターフェイス ソースを生成するには、すべてのベース COM インターフェイスが有効なインターフェイスである必要があります。この診断を解決するには、ベース インターフェイスの問題を修正してください。
ko: COM 인터페이스 원본을 생성하려면 모든 COM 기본 인터페이스가 유효해야 합니다. 기본 인터페이스의 문제를 수정하여 이 진단을 해결하세요.
pl: Generowanie źródła interfejsu COM wymaga, aby wszystkie podstawowe interfejsy COM były prawidłowymi interfejsami. Rozwiąż wszelkie problemy z interfejsem podstawowym, aby rozwiązać ten problem diagnostyczny.
pt_br: A geração de fonte de interface COM requer que todas as interfaces COM base sejam interfaces válidas. Corrija quaisquer problemas na interface base para resolver este diagnóstico.
ru: Для создания источника COM-интерфейса все базовые COM-интерфейсы должны быть допустимыми. Устраните все проблемы в базовом интерфейсе, чтобы разрешить это диагностическое уведомление.
tr: COM arabiriminin kaynak oluşturabilmesi için tüm temel COM arabirimlerinin geçerli arabirimler olması gerekiyor. Bu tanılamayı çözmek için temel arabirimdeki sorunları düzeltin.
zh_hans: COM 接口源生成要求所有基本 COM 接口都是有效接口。修复基本接口上的任何问题以解决此诊断。
zh_hant: 產生 COM 介面來源要求所有基底 COM 介面都必須是有效的介面。請修正基底介面上的任何問題，以解決此診斷。

# BaseInterfaceCannotBeGeneratedMessage
source: COM interface {0} inherits from {1}, which has errors. ComInterfaceGenerator will not generate source for {0}.
cs: {0} rozhraní COM dědí z {1}, kde se vyskytují chyby. ComInterfaceGenerator nevygeneruje zdroj pro {0}.
de: Die COM-Schnittstelle {0} erbt von {1}, das Fehler aufweist. ComInterfaceGenerator generiert keine Quelle für {0}.
es: La interfaz {0} COM hereda de {1}, que tiene errores. ComInterfaceGenerator no generará el origen para {0}.
fr: L’interface COM {0} hérite de {1}, qui comporte des erreurs. ComInterfaceGenerator ne génère pas de source pour {0}.
it: L'interfaccia COM {0} eredita da {1} che contiene errori. ComInterfaceGenerator non genererà l'origine per {0}.
ja: COM インターフェイス {0} は {1} から継承していますが、エラーがあります。 ComInterfaceGenerator は {0} のソースを生成しません。
ko: COM 인터페이스 {0}이(가) 오류가 있는 {1}에서 상속됩니다. ComInterfaceGenerator는 {0}에 대한 원본을 생성하지 않습니다.
pl: Interfejs COM {0} dziedziczy po {1}, który zawiera błędy. Program ComInterfaceGenerator nie wygeneruje źródła dla {0}.
pt_br: A interface COM {0} herda de {1}, que contém erros. ComInterfaceGenerator não irá gerar fonte para{0}.
ru: COM-интерфейс {0} наследует от {1}, где есть ошибки. ComInterfaceGenerator не будет создавать источник для {0}.
tr: {0} COM arabirimi hata içeren {1} konumundan devralıyor. ComInterfaceGenerator, {0} için kaynak oluşturamaz.
zh_hans: COM 接口 {0} 继承自 {1}，具有错误。ComInterfaceGenerator 不会为 {0} 生成源。
zh_hant: COM 介面 {0} 繼承自有錯誤的 {1}。ComInterfaceGenerator 不會產生 {0} 的來源。

# BaseInterfaceCannotBeGeneratedTitle
source: The base COM interface failed to generate source. Code will not be generated for this interface.
cs: Základnímu rozhraní COM se nepodařilo vygenerovat zdroj. Kód se pro toto rozhraní nevygeneruje.
de: Die Basis-COM-Schnittstelle konnte die Quelle nicht generieren. Für diese Schnittstelle wird kein Code generiert.
es: La interfaz COM base no pudo generar el origen. No se generará código para esta interfaz.
fr: L’interface COM de base n’a pas réussi à générer le code source. Le code ne sera pas généré pour cette interface.
it: L'interfaccia COM di base non è riuscita a generare l'origine. Il codice non verrà generato per questa interfaccia.
ja: ベース COM インターフェイスはソースを生成できませんでした。このインターフェイスのコードは生成されません。
ko: 베이스 COM 인터페이스에서 소스를 생성하지 못했습니다. 이 인터페이스에 대한 코드가 생성되지 않습니다.
pl: Podstawowy interfejs COM nie może wygenerować źródła. Kod nie zostanie wygenerowany dla tego interfejsu.
pt_br: A interface COM base falhou ao gerar a fonte. O código não será gerado para esta interface.
ru: Базовому COM-интерфейсу не удалось создать источник. Код не будет создан для этого интерфейса.
tr: Temel COM arabirimi, kaynak oluşturamadı. Bu arabirim için kod oluşturulmayacak.
zh_hans: 基本 COM 接口无法生成源。不会为此接口生成代码。
zh_hant: 基底 COM 介面無法產生來源。將不會產生此介面的程式碼。
