Repository: dotnet/runtime
Catalog: src/libraries/System.Runtime.InteropServices/gen/Common/Resources/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ToFromUnmanagedTypesMustMatchDescription
source: The return type of 'ToUnmanaged' and the parameter type of 'FromUnmanaged' must be the same.
cs: Návratový typ ToUnmanaged a typ parametru FromUnmanaged musí být stejné.
de: Der Rückgabetyp von "ToUnmanaged" und der Parametertyp von "FromUnmanaged" müssen identisch sein.
es: El tipo de valor devuelto de "ToUnmanaged" y el tipo de parámetro de "FromUnmanaged" deben coincidir.
fr: Le type de retour de « ToUnmanaged » et le type de paramètre « FromUnmanaged » doivent être identiques.
it: Il tipo restituito di 'ToUnmanaged' e il tipo di parametro di 'FromUnmanaged' devono essere uguali.
ja: 'ToUnmanaged' の戻り値の型と 'FromUnmanaged' のパラメーター型は同じである必要があります。
ko: 'ToUnmanaged'의 반환 유형과 'FromUnmanaged'의 매개 변수 유형은 동일해야 합니다.
pl: Zwracany typ elementu „ToUnmanaged” i typ parametru elementu „FromUnmanaged” muszą być takie same.
pt_br: O tipo de retorno de 'ToUnmanaged' e o tipo de parâmetro de 'FromUnmanaged' devem ser os mesmos.
ru: Тип возвращаемого значения "ToUnmanaged" и тип параметра "FromUnmanaged" должны совпадать.
tr: 'ToUnmanaged' dönüş türü ve 'FromUnmanaged' parametre türü aynı olmalıdır.
zh_hans: “ToUnmanaged”的返回类型和“FromUnmanaged”的参数类型必须相同。
zh_hant: 'ToUnmanaged' 的傳回類型與 'FromUnmanaged' 的參數類型必須相同。

# ToFromUnmanagedTypesMustMatchMessage
source: The return type of 'ToUnmanaged' and the parameter type of 'FromUnmanaged' must be the same
cs: Návratový typ ToUnmanaged a typ parametru FromUnmanaged musí být stejné.
de: Der Rückgabetyp von "ToUnmanaged" und der Parametertyp von "FromUnmanaged" müssen identisch sein
es: El tipo de valor devuelto de "ToUnmanaged" y el tipo de parámetro de "FromUnmanaged" deben ser el mismo
fr: Le type de retour de « ToUnmanaged » et le type de paramètre « FromUnmanaged » doivent être identiques
it: Il tipo restituito di 'ToUnmanaged' e il tipo di parametro di 'FromUnmanaged' devono essere uguali.
ja: 'ToUnmanaged' の戻り値の型と 'FromUnmanaged' のパラメーター型は同じである必要があります
ko: 'ToUnmanaged'의 반환 유형과 'FromUnmanaged'의 매개 변수 유형은 동일해야 합니다.
pl: Zwracany typ elementu „ToUnmanaged” i typ parametru elementu „FromUnmanaged” muszą być takie same
pt_br: O tipo de retorno de 'ToUnmanaged' e o tipo de parâmetro de 'FromUnmanaged' devem ser os mesmos
ru: Тип возвращаемого значения "ToUnmanaged" и тип параметра "FromUnmanaged" должны совпадать
tr: 'ToUnmanaged' dönüş türü ve 'FromUnmanaged' parametre türü aynı olmalıdır
zh_hans: “ToUnmanaged”的返回类型和“FromUnmanaged”的参数类型必须相同
zh_hant: 'ToUnmanaged' 的傳回類型與 'FromUnmanaged' 的參數類型必須相同

# ToUnmanagedFromManagedTypesMustMatchDescription
source: The return type of 'ConvertToUnmanaged' and the parameter type of 'ConvertToManaged' must be the same.
cs: Návratový typ ConvertToUnmanaged a typ parametru ConvertToManaged musí být stejné.
de: Der Rückgabetyp von "ConvertToUnmanaged" und der Parametertyp von "ConvertToUnmanaged" müssen identisch sein.
es: El tipo de valor devuelto de "ConvertToUnmanaged" y el tipo de parámetro de "ConvertToManaged" deben coincidir.
fr: Le type de retour de « ConvertToUnmanaged » et le type de paramètre « ConvertToManaged » doivent être identiques.
it: Il tipo restituito di 'ConvertToUnmanaged' e il tipo di parametro di 'ConvertToManaged' devono essere uguali.
ja: 'ConvertToUnmanaged' の戻り値の型と 'ConvertToManaged' のパラメーター型は同じである必要があります。
ko: 'ConvertToUnmanaged'의 반환 유형과 'ConvertToManaged'의 매개 변수 유형은 동일해야 합니다.
pl: Zwracany typ elementu „ConvertToUnmanaged” i typ parametru elementu „ConvertToManaged” muszą być takie same.
pt_br: O tipo de retorno de 'ConvertToUnmanaged' e o tipo de parâmetro de 'ConvertToManaged' devem ser os mesmos.
ru: Тип возвращаемого значения "ConvertToUnmanaged" и тип параметра "ConvertToManaged" должны совпадать.
tr: 'ConvertToUnmanaged' dönüş türü ve ''ConvertToManaged' parametre türü aynı olmalıdır.
zh_hans: “ConvertToUnmanaged”的返回类型和“ConvertToManaged”的参数类型必须相同。
zh_hant: 'ConvertToUnmanaged' 的傳回類型與 'ConvertToManaged' 的參數類型必須相同。

# ToUnmanagedFromManagedTypesMustMatchMessage
source: The return type of 'ConvertToUnmanaged' and the parameter type of 'ConvertToManaged' must be the same
cs: Návratový typ ConvertToUnmanaged a typ parametru ConvertToManaged musí být stejné.
de: Der Rückgabetyp von "ConvertToUnmanaged" und der Parametertyp von "ConvertToUnmanaged" müssen identisch sein
es: El tipo de valor devuelto de "ConvertToUnmanaged" y el tipo de parámetro de "ConvertToManaged" deben coincidir
fr: Le type de retour de « ConvertToUnmanaged » et le type de paramètre « ConvertToManaged » doivent être identiques
it: Il tipo restituito di 'ConvertToUnmanaged' e il tipo di parametro di 'ConvertToManaged' devono essere uguali
ja: 'ConvertToUnmanaged' の戻り値の型と 'ConvertToManaged' のパラメーター型は同じである必要があります
ko: 'ConvertToUnmanaged'의 반환 유형과 'ConvertToManaged'의 매개 변수 유형은 동일해야 합니다.
pl: Zwracany typ elementu „ConvertToUnmanaged” i typ parametru elementu „ConvertToManaged” muszą być takie same
pt_br: O tipo de retorno de 'ConvertToUnmanaged' e o tipo de parâmetro de 'ConvertToManaged' devem ser os mesmos
ru: Тип возвращаемого значения "ConvertToUnmanaged" и тип параметра "ConvertToManaged" должны совпадать
tr: 'ConvertToUnmanaged' dönüş türü ve ''ConvertToManaged' parametre türü aynı olmalıdır
zh_hans: “ConvertToUnmanaged”的返回类型和“ConvertToManaged”的参数类型必须相同
zh_hant: 'ConvertToUnmanaged' 的傳回類型與 'ConvertToManaged' 的參數類型必須相同

# TypeAccessibilityDetails
source: '{0}' has accessibility '{1}'.
cs: „{0}“ má přístupnost „{1}“.
de: '{0}' verfügt über Barrierefreiheit '{1}'.
es: '{0}' tiene accesibilidad '{1}'.
fr: '{0}' a une accessibilité '{1}'.
it: '{0}' ha accessibilità '{1}'.
ja: '{0}' にはアクセシビリティ '{1}' があります。
ko: '{0}'에는 접근성 '{1}'이(가) 있습니다.
pl: „{0}” ma ułatwienia dostępu „{1}”.
pt_br: '{0}' tem acessibilidade '{1}'.
ru: "{0}" обеспечивает уровень доступности "{1}".
tr: '{0}', '{1}' erişilebilirlik özelliğine sahip.
zh_hans: “{0}”具有可访问性“{1}”。
zh_hant: '{0}' 具有存取範圍 '{1}'。

# TypeMustBeUnmanagedDescription
source: The unmanaged type for a custom marshaller must be a C# unmanaged type.
cs: Nespravovaný typ vlastního zařazovacího modulu musí být nespravovaný typ jazyka C#.
de: Der nicht verwaltete Typ für einen benutzerdefinierten Marshaller muss ein nicht verwalteter C#-Typ sein.
es: El tipo no administrado de un serializador personalizado debe ser un tipo no administrado de C#.
fr: Le type non managé d’un marshaleur personnalisé doit être un type non managé C#.
it: Il tipo non gestito per un marshaller personalizzato deve essere un tipo non gestito C#.
ja: カスタム マーシャラーのアンマネージド型は、C# アンマネージド型である必要があります。
ko: 사용자 지정 마샬러의 비관리형 형식은 C# 비관리형 형식이어야 합니다.
pl: Typ niezarządzany dla niestandardowego organizatora musi być niezarządzanym typem języka C#.
pt_br: O tipo não gerenciado para um marshaller personalizado deve ser um tipo não gerenciado C#.
ru: Неуправляемый тип для пользовательского маршаллера должен быть неуправляемым типом C#.
tr: Özel sıralayıcının yönetilmeyen türü, C# yönetilmeyen bir tür olmalıdır.
zh_hans: 自定义封送程序的非托管类型必须为 C# 非托管类型。
zh_hant: 自訂封送處理程式的未受控類型必須是 C# 未受控類型。

# TypeMustBeUnmanagedMessage
source: The return type of '{0}' must be unmanaged
cs: Návratový typ {0} musí být nespravovaný.
de: Der Rückgabetyp von „{0}“ darf nicht verwaltet sein
es: El tipo de valor devuelto de "{0}" debe ser no administrado
fr: Le type de retour '{0}' doit être non managé
it: Il tipo restituito di '{0}' deve essere non gestito
ja: '{0}' の戻り値の型はアンマネージドである必要があります
ko: '{0}'의 반환 형식은 비관리형이어야 합니다.
pl: Zwracany typ „{0}” musi być niezarządzany
pt_br: O tipo de retorno de “{0}” deve ser não gerenciado
ru: Тип возвращаемого значения "{0}" должен быть неуправляемым
tr: '{0}' dönüş türü, yönetilmeyen olmalıdır
zh_hans: “{0}”的返回类型必须为非托管
zh_hant: '{0}' 的傳回類型必須為不受控

# TypeMustHaveExplicitCastFromVoidPointerDescription
source: 'void*' must be castable to the type so the pinned result of the static 'GetPinnableReference' method can be passed to the native context after being pinned.
cs: void* musí být přetypovatelné na tento typ, aby připnutý výsledek statické metody GetPinnableReference mohl být po připnutí předán nativnímu kontextu.
de: "void*" muss in den Typ umgewandelt werden können, damit das angeheftete Ergebnis der statischen Methode "GetPinnableReference" nach dem Anheften an den nativen Kontext übergeben werden kann.
es: "void*" debe poder convertirse al tipo para que el resultado anclado del método "GetPinnableReference" estático se pueda pasar al contexto nativo después de anclarse.
fr: « void* » doit être castable en type pour que le résultat épinglé de la méthode « GetPinnableReference » statique puisse être passé au contexte natif après avoir été épinglé.
it: 'void*' deve poter essere sottoposto a cast nel tipo in modo che il risultato aggiunto del metodo statico 'GetPinnableReference' possa essere passato al contesto nativo dopo essere stato aggiunto.
ja: 静的な 'GetPinnableReference' メソッドのピン留めされた結果をピン留め後にネイティブ コンテキストに渡すことができるように、'void*' は型にキャスト可能である必要があります。
ko: 고정된 후 정적 'GetPinnableReference' 메서드의 고정된 결과를 기본 컨텍스트로 전달할 수 있도록 'void*'는 유형으로 캐스팅 가능해야 합니다.
pl: Element „void*” musi być rzutowany na typ, aby przypięty wynik statycznej metody „GetPinnableReference” mógł zostać przekazany do kontekstu macierzystego po przypięciu.
pt_br: 'void*' deve ser passível de conversão para o tipo para que o resultado fixado do método estático 'GetPinnableReference' possa ser passado para o contexto nativo após ser fixado.
ru: "void*" должен быть приводимым к типу, чтобы закрепленный результат статического метода "GetPinnableReference" можно было передавать в собственный контекст после закрепления.
tr: Statik 'GetPinnableReference' yönteminin sabitlenmiş sonucunun sabitlendikten sonra yerel bağlama geçirilebilmesi için 'void*', türe atanabilir olmalıdır.
zh_hans: 必须将“void*”强制转换为类型，这样静态“GetPinnableReference”方法的固定结果才能在固定后传递到本机上下文。
zh_hant: 'void*' 必須可轉換為類型，以致靜態 'GetPinnableReference' 方法的釘選結果可在釘選之後傳遞至原生內容。

# TypeMustHaveExplicitCastFromVoidPointerMessage
source: 'void*' must be castable to the type '{0}' because the managed type '{1}' has a static 'GetPinnableReference' method
cs: void* musí být přetypovatelné na typ {0}, protože spravovaný typ {1} obsahuje statickou metodu GetPinnableReference.
de: "void*" muss in den Typ "{0}" umgewandelt werden, da der verwaltete Typ "{1}" eine statische "GetPinnableReference"-Methode aufweist
es: "void*" debe poder convertirse al tipo "{0}" porque el tipo administrado "{1}" tiene un método "GetPinnableReference" estático
fr: « void* » doit être castable en type « {0} », car le type managé « {1} » a une méthode « GetPinnableReference » statique
it: Il cast di 'void*' al tipo '{0}' deve essere eseguito perché il tipo gestito '{1}' include un metodo statico 'GetPinnableReference'
ja: マネージド型 '{1}' に静的な 'GetPinnableReference' メソッドがあるため、'void*' は型 '{0}' にキャスト可能である必要があります
ko: 관리 유형 '{1}'에 정적 'GetPinnableReference' 메서드가 있으므로 'void*'는 '{0}' 유형으로 캐스팅 가능해야 합니다.
pl: Element „void*” musi być rzutowany na typ „{0}”, ponieważ typ zarządzany „{1}” ma statyczną metodę „GetPinnableReference”
pt_br: 'void*' deve ser convertível para o tipo '{0}' porque o tipo gerenciado '{1}' tem um método estático 'GetPinnableReference'
ru: "void*" должен быть приводимым к типу "{0}", поскольку у управляемого типа "{1}" есть статический метод "GetPinnableReference"
tr: Yönetilen tür '{1}', statik 'GetPinnableReference' yöntemine sahip olduğundan 'void*', '{0}' türüne atanabilir olmalıdır.
zh_hans: “void*”必须可转换为类型“{0}”，因为托管类型“{1}”具有静态“GetPinnableReference”方法
zh_hant: 'void*' 必須轉換為類型 '{0}'，因為受控類型 '{1}' 具有靜態 'GetPinnableReference' 方法

# TypeNotSupportedDescriptionCom
source: For types that are not supported by source-generated COM, the resulting function pointer will rely on the underlying runtime to marshal the specified type.
cs: U typů, které nejsou podporovány modelem COM generovaným zdrojem, bude výsledný ukazatel funkce při zařazování zadaného typu spoléhat na základní modul runtime.
de: Bei Typen, die vom quellgenerierten COM nicht unterstützt werden, basiert der resultierende Funktionszeiger auf der zugrunde liegenden Laufzeit, um den angegebenen Typ zu marshallen.
es: Para los tipos que no son compatibles con COM generado por el origen, el puntero de función resultante se basará en el tiempo de ejecución subyacente para serializar el tipo especificado.
fr: Pour les types qui ne sont pas pris en charge par com généré par la source, le pointeur de fonction résultant s’appuie sur le runtime sous-jacent pour marshaler le type spécifié.
it: Per i tipi non supportati dai COM generati dall'origine, il puntatore funzione risultante si baserà sul runtime sottostante per effettuare il marshalling del tipo specificato.
ja: ソース生成済みの COM でサポートされていない型である場合、生成された関数ポインターは、基礎となるなるランタイムに依存して、指定された型をマーシャリングします。
ko: 원본 생성 COM에서 지원하지 않는 형식의 경우 결과 함수 포인터는 기본 런타임을 사용하여 지정된 형식을 마샬링합니다.
pl: W przypadku typów, które nie są obsługiwane przez COM wygenerowany przez źródło, wynikowy wskaźnik funkcji będzie polegał na bazowym środowisku uruchomieniowym w celu skierowania określonego typu.
pt_br: Para tipos sem suporte para um COM gerado pela origem, o ponteiro de função resultante dependerá do tempo de execução subjacente para realizar marshaling no tipo especificado.
ru: Для типов, которые не поддерживаются моделью COM генератора исходного кода, результирующий указатель на функцию будет выполнять маршалинг указанного типа на базе используемой среды выполнения.
tr: Kaynak tarafından oluşturulan COM tarafından desteklenmeyen türler için ortaya çıkan işlev işaretçisi, belirtilen türü sıralamak için temeldeki çalışma zamanına güvenir.
zh_hans: 对于源生成的 COM 不支持的类型，生成的函数指针将依赖基础运行时来封送指定的类型。
zh_hant: 對於來源產生的 COM 不支援的類型，產生的函式指標將依賴基礎執行階段來封送處理指定的類型。

# TypeNotSupportedDescriptionLibraryImport
source: For types that are not supported by source-generated P/Invokes, the resulting P/Invoke will rely on the underlying runtime to marshal the specified type.
cs: U typů, které nejsou podporovány zdrojem generovanými voláními P/Invoke, bude výsledné volání P/Invoke záviset na podkladovém modulu runtime, aby určený typ zařadil.
de: Bei Typen, die von dquellgenerierten P/Invokes nicht unterstützt werden, basiert der resultierende P/Invoke auf der zugrunde liegenden Laufzeit, um den angegebenen Typ zu marshallen.
es: Para los tipos que no son compatibles con P/Invokes de un generador de código fuente, el P/Invoke resultante se basará en el entorno de ejecución subyacente para serializar las referencias del tipo especificado.
fr: Pour les types qui ne sont pas pris en charge par les P/Invok générés par la source, le P/Invoke résultant se base sur le runtime sous-jacent pour marshaler le type spécifié.
it: Per i tipi non supportati da P/Invoke generati dall'origine, il P/Invoke risultante si baserà sul runtime sottostante per effettuare il marshalling del tipo specificato.
ja: ソース生成済みの P/Invoke でサポートされていない型である場合、生成された P/Invoke は、基礎となるなるランタイムに依存して、指定された型をマーシャリングします。
ko: 소스 생성 P/Invoke에서 지원하지 않는 형식의 경우 결과 P/Invoke는 기본 런타임에 의존하여 지정된 형식을 마샬링합니다.
pl: W przypadku typów, które nie są obsługiwane przez funkcję P/Invokes generowaną przez źródło, wynikowa funkcja P/Invoke będzie polegać na bazowym środowisku uruchomieniowym, aby skierować określony typ.
pt_br: Para tipos sem suporte por P/Invokes gerados pela origem, o P/Invoke resultante dependerá do tempo de execução subjacente para realizar marshaling no tipo especificado.
ru: Для типов, которые не поддерживаются в P/Invoke с созданием источника, в полученном P/Invoke для маршализации указанного типа будет использоваться среда выполнения.
tr: Kaynak tarafından oluşturulan P/Invokes tarafından desteklenmeyen türler için, elde edilen P/Invoke, belirtilen türü sıralamak için temel alınan çalışma zamanını kullanır.
zh_hans: 对于源生成的 P/Invoke 不支持的类型，生成的 P/Invoke 将依赖基础运行时来封送指定的类型。
zh_hant: 對於來源產生的 P/Invokes 不支援的類型，產生的 P/Invoke 將依賴基礎運行時間來封送指定的類型。

# TypeNotSupportedMessageParameterCom
source: The type '{0}' is not supported by source-generated COM. The generated source will not handle marshalling of parameter '{1}'.
cs: Model COM vygenerovaný zdrojem nepodporuje typ „{0}“. Vygenerovaný zdroj nezpracuje zařazování parametru „{1}“.
de: Der Typ "{0}" wird vom quellgenerierten COM nicht unterstützt. Die generierte Quelle verarbeitet das Marshalling des Parameters "{1}" nicht.
es: El tipo "{0}" no es compatible con COM generado por origen. El origen generado no controlará la serialización del parámetro "{1}".
fr: Le type '{0}' n’est pas pris en charge par COM généré par la source. La source générée ne gère pas le marshaling du paramètre «{1}».
it: Il tipo '{0}' non è supportato dai COM generati dall'origine. L'origine generata non gestirà il marshalling del parametro '{1}'.
ja: 型 '{0}' は、ソース生成済みの COM ではサポートされていません。生成されたソースは、パラメーター '{1}' のマーシャリングを処理しません。
ko: 형식 '{0}'은(는) 원본 생성 COM에서 지원되지 않습니다. 생성된 원본은 '{1}' 매개 변수의 마샬링을 처리하지 않습니다.
pl: Typ „{0}” nie jest obsługiwany przez COM generowany przez źródło. Wygenerowane źródło nie będzie obsługiwać skierowania parametru „{1}”.
pt_br: Um COM gerado pela origem não dá suporte ao tipo '{0}'. A origem gerada não realizará marshalling do parâmetro '{1}'.
ru: Тип "{0}" не поддерживается моделью COM генератора исходного кода. Созданный исходный код не будет обрабатывать маршалинг параметра "{1}".
tr: '{0}' türü, kaynak tarafından oluşturulan COM tarafından desteklenmiyor. Üretilen kaynak, '{1}' parametresinin sıralamasını işlemez.
zh_hans: 源生成的 COM 不支持“{0}”类型。生成的源将不处理参数“{1}”的封送。
zh_hant: 来源產生的 COM 不支援類型 '{0}'。產生的来源將不會處理參數 '{1}' 的封送處理。

# TypeNotSupportedMessageParameterLibraryImport
source: The type '{0}' is not supported by source-generated P/Invokes. The generated source will not handle marshalling of parameter '{1}'.
cs: Typ {0} nepodporují zdrojem generovaná volání P/Invokes. Vygenerovaný zdroj nebude zpracovávat zařazování parametru {1}.
de: Der Typ \"{0}\" wird von vom Quellcode generierten P/Invokes nicht unterstützt. Die generierte Quelle verarbeitet das Marshalling des Parameters \"{1}\" nicht.
es: El tipo “{0}” no es compatible con P/Invokes de un generador de código fuente. El código fuente generado no controlará la serialización del parámetro “{1}”.
fr: Le type « {0} » n’est pas pris en charge par les P/Invokes générés par la source. La source générée ne gère pas le marshaling du paramètre « {1} ».
it: Il tipo '{0}' non è supportato dai P/Invoke generati dall'origine. L'origine generata non gestirà il marshalling del parametro '{1}'.
ja: 型 '{0}' は、ソース生成済みの P/Invoke ではサポートされていません。生成されたソースは、パラメーター '{1}' のマーシャリングを処理しません。
ko: 형식 '{0}'은(는) 소스 생성 P/Invoke에서 지원되지 않습니다. 생성된 소스는 '{1}' 매개 변수의 마샬링을 처리하지 않습니다.
pl: Typ „{0}” nie jest obsługiwany przez funkcję P/Invokes generowaną przez źródło. Wygenerowane źródło nie obsługuje skierowania parametru „{1}”.
pt_br: O tipo '{0}' não é suportado por P/Invokes gerados pela origem. A origem gerada não manipulará o marshalling do parâmetro '{1}'.
ru: Тип \"{0}\" не поддерживается в P/Invoke с созданием источника. Созданный источник не будет обрабатывать маршализацию параметра \"{1}\".
tr: '{0}' türü, kaynak tarafından oluşturulan P/Invokes tarafından desteklenmiyor. Oluşturulan kaynak, '{1}' parametresinin sıralamasını işlemez.
zh_hans: 源生成的 P/Invoke 不支持“{0}”类型。生成的源将不处理参数“{1}”的封送。
zh_hant: 来源產生的 P/Invokes 不支援類型 '{0}'。產生的来源將不會處理參數 '{1}' 的排列。

# TypeNotSupportedMessageParameterWithDetails
source: {0} The generated source will not handle marshalling of parameter '{1}'.
cs: {0} Generovaný zdroj nebude zpracovávat zařazování parametru {1}.
de: {0} Die generierte Quelle verarbeitet das Marshalling des Parameters \"{1}\" nicht.
es: {0} El origen generado no controlará la serialización del parámetro “{1}”.
fr: {0} La source générée ne gère pas le marshaling du paramètre « {1} ».
it: {0} L'origine generata non gestirà il marshalling del parametro '{1}'.
ja: {0} 生成されたソースはパラメーター '{1}' のマーシャリングを処理しません。
ko: {0} 생성된 소스는 '{1}' 매개 변수의 마샬링을 처리하지 않습니다.
pl: {0} Wygenerowane źródło nie obsługuje skierowania parametru „{1}”.
pt_br: {0} A origem gerada não manipulará o marshalling do parâmetro '{1}'.
ru: {0} Созданный источник не будет обрабатывать маршализацию параметра \"{1}\".
tr: {0} Oluşturulan kaynak '{1}' parametresinin sıralamasını işlemez.
zh_hans: {0} 生成的源将不处理参数“{1}”的封送。
zh_hant: {0} 產生的来源将不會處理參數 '{1}' 的排列。

# TypeNotSupportedMessageReturnCom
source: The type '{0}' is not supported by source-generated COM. The generated source will not handle marshalling of the return value of method '{1}'.
cs: Model COM vygenerovaný zdrojem nepodporuje typ „{0}“. Vygenerovaný zdroj nebude zpracovávat zařazování návratové hodnoty metody „{1}“.
de: Der Typ "{0}" wird vom quellgenerierten COM nicht unterstützt. Die generierte Quelle verarbeitet das Marshalling des Rückgabewerts der Methode "{1}" nicht.
es: El tipo "{0}" no es compatible con COM generado por origen. El origen generado no controlará la serialización del valor devuelto del método "{1}".
fr: Le type '{0}' n’est pas pris en charge par COM généré par la source. La source générée ne gère pas le marshaling de la valeur de retour de la méthode '{1}'.
it: Il tipo '{0}' non è supportato dai CONM generati dall'origine. L'origine generata non gestirà il marshalling del valore restituito del metodo '{1}'.
ja: 型 '{0}' は、ソース生成済みの COM ではサポートされていません。生成されたソースは、メソッド '{1}' の戻り値のマーシャリングを処理しません。
ko: '{0}' 형식은 원본 생성 COM에서 지원되지 않습니다. 생성된 원본은 '{1}' 메서드의 반환 값 마샬링을 처리하지 않습니다.
pl: Typ „{0}” nie jest obsługiwany przez COM generowany przez źródło. Wygenerowane źródło nie będzie obsługiwać skierowania wartości zwracanej przez metodę „{1}”.
pt_br: Um COM gerado pela origem não dá suporte ao tipo '{0}'. A origem gerada não realizará marshaling do valor de retorno do método '{1}'.
ru: Тип "{0}" не поддерживается моделью COM генератора исходного кода. Созданный исходный код не будет обрабатывать маршалинг возвращаемого значения метода "{1}".
tr: '{0}' türü, kaynak tarafından oluşturulan COM tarafından desteklenmiyor. Oluşturulan kaynak, '{1}' yönteminin dönüş değerinin sıralamasını işlemez.
zh_hans: 源生成的 COM 不支持 "{0}" 类型。生成的源将不处理方法 "{1}" 的返回值的封送。
zh_hant: 来源產生的 COM 不支援類型 '{0}'。產生的來源將不會處理方法 '{1}' 的傳回值之封送處理。
