Repository: dotnet/runtime
Catalog: src/libraries/System.Runtime.InteropServices/gen/Common/Resources/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# RequiresAllowUnsafeBlocksTitleLibraryImport
source: LibraryImportAttribute requires unsafe code.
cs: LibraryImportAttribute vyžaduje nebezpečný kód.
de: LibraryImportAttribute erfordert unsicheren Code.
es: LibraryImportAttribute requiere código no seguro.
fr: LibraryImportAttribute requiert du code non sécurisé.
it: LibraryImportAttribute richiede un codice non sicuro.
ja: LibraryImportAttribute には安全でないコードが必要です。
ko: LibraryImportAttribute에는 안전하지 않은 코드가 필요합니다.
pl: Element LibraryImportAttribute wymaga niebezpiecznego kodu.
pt_br: LibraryImportAttribute requer código não seguro.
ru: Для LibraryImportAttribute требуется небезопасный код.
tr: LibraryImportAttribute, güvenli olmayan kod gerektiriyor.
zh_hans: LibraryImportAttribute 需要不安全的代码。
zh_hant: LibraryImportAttribute 需要不安全的程式碼。

# ReturnTypeMustBeExpectedTypeDescription
source: The return type the two method must be the expected type.
cs: Návratový typ, který obě metody musí být očekávaného typu.
de: Der Rückgabetyp, den die beiden Methoden aufweisen müssen, muss der erwartete Typ sein.
es: El tipo de valor devuelto por el que ambos métodos deben ser del tipo esperado.
fr: Le type de retour de la méthode deux doit être le type attendu.
it: Tipo restituito il due metodo deve essere il tipo previsto.
ja: 戻り値の型は、2 つのメソッドが期待する型である必要があります。
ko: 두 메서드가 필요한 형식이어야 하는 반환 형식입니다.
pl: Zwracany typ obu tych metod musi być oczekiwanym typem.
pt_br: O tipo de retorno do método dois deve ser o tipo esperado.
ru: Тип возвращаемого значения метода two должен быть ожидаемым.
tr: İki metodun dönüş türü beklenen tür olmalıdır.
zh_hans: 这两种方法的返回类型必须为预期类型。
zh_hant: 兩種方法的傳回類型必須是預期的類型。

# ReturnTypeMustBeExpectedTypeMessage
source: The return type of '{0}' must be '{1}'
cs: Návratový typ {0} musí být {1}
de: Der Rückgabetyp von „{0}“ muss „{1}“ sein
es: El tipo de valor devuelto de "{0}" debe ser "{1}"
fr: Le type de retour '{0}' doit être '{1}'
it: Il tipo restituito di '{0}' deve essere '{1}'
ja: 戻り値の型 '{0}' は '{1}' でなければなりません
ko: '{0}'의 반환 형식은 '{1}'이어야 합니다.
pl: Zwracany typ „{0}” musi być „{1}”
pt_br: O tipo de retorno de “{0}” deve ser “{1}”
ru: Тип возвращаемого значения "{0}" должен быть "{1}"
tr: '{0}' dönüş türü, '{1}' olmalıdır
zh_hans: “{0}”的返回类型必须为“{1}”
zh_hant: '{0}' 的傳回類型必須為 '{1}'

# ReturnTypesMustMatchDescription
source: The return types of the two methods must be the same type.
cs: Návratové typy těchto dvou metod musí být stejného typu.
de: Die Rückgabetypen der beiden Methoden müssen vom gleichen Typ sein.
es: Los tipos devueltos de los dos métodos deben ser del mismo tipo.
fr: Les types de retour des deux méthodes doivent être du même type.
it: I tipi restituiti dei due metodi devono essere dello stesso tipo.
ja: 2 つのメソッドの戻り値の型は同じ型である必要があります。
ko: 두 메서드의 반환 형식은 같아야 합니다.
pl: Zwracane typy obu tych metod muszą być tego samego typu.
pt_br: Os tipos de retorno dos dois métodos devem ser do mesmo tipo.
ru: Типы возвращаемого метода должны быть одинаковыми.
tr: İki yöntemin dönüş türleri aynı olmalıdır.
zh_hans: 这两种方法的返回类型必须为相同的类型。
zh_hant: 兩種方法的傳回類型必須是相同的類型。

# ReturnTypesMustMatchMessage
source: The return type of '{0}' must be the same type as the return type of '{1}'
cs: Návratový typ {0} musí být stejného typu jako návratový typ {1}
de: Der Rückgabetyp von „{0}“ muss den gleichen Typ aufweisen wie der Rückgabetyp von „{1}“
es: El tipo de valor devuelto de "{0}" debe ser del mismo tipo que el tipo de valor devuelto de "{1}"
fr: Le type de retour de '{0}' doit être le même que le type de retour de '{1}'
it: Il tipo restituito di '{0}' deve essere dello stesso tipo restituito di '{1}'
ja: 戻り値の型 '{0}' は、戻り値の型 '{1}' と同じである必要があります
ko: '{0}' 반환 형식은 '{1}' 반환 형식과 같아야 합니다.
pl: Zwracany typ „{0}” musi być tego samego typu co zwracany typ „{1}”
pt_br: O tipo de retorno de “{0}” deve ser do mesmo tipo que o tipo de retorno “{1}”
ru: Тип возвращаемого значения "{0}" должен быть тем же, что и тип возвращаемого значения "{1}"
tr: '{0}' öğesinin dönüş türü, '{1}' öğesinin dönüş türüyle aynı olmalıdır
zh_hans: “{0}”的返回类型必须与“{1}”的返回类型为相同的类型
zh_hant: '{0}' 的傳回類型必須與 '{1}' 的傳回類型相同

# RuntimeComApisDoNotSupportSourceGeneratedComDescription
source: COM Interop APIs on 'System.Runtime.InteropServices.Marshal' do not support source-generated COM and will fail at runtime
cs: Rozhraní COM Interop API na System.Runtime.InteropServices.Marshal nepodporují model COM generovaný zdrojem a za běhu selžou.
de: COM-Interop-APIs auf "System.Runtime.InteropServices.Marshal" unterstützen keine vom Quellcode generierten COM-Dateien und schlagen zur Laufzeit fehl.
es: Las API de interoperabilidad COM en 'System.Runtime.InteropServices.Marshal' no admiten COM generado por origen y producirán errores en tiempo de ejecución
fr: Les API COM Interop sur 'System.Runtime.InteropServices.Marshal' ne prennent pas en charge COM généré par la source et échoueront lors de l'exécution
it: Le API di interoperabilità COM su 'System.Runtime.InteropServices.Marshal' non supportano i COM generati dall’origine e avranno esito negativo in fase di esecuzione
ja: 'System.Runtime.InteropServices.Marshal' 上の COM 相互運用 API はソース生成 COM をサポートしていないため、実行時に失敗します
ko: 'System.Runtime.InteropServices.Marshal'의 COM Interop API는 소스 생성 COM을 지원하지 않으며 런타임에 실패합니다.
pl: Interfejsy API usługi międzyoperacyjnej modelu COM w elemencie „System.Runtime.InteropServices.Marshal” nie obsługują generowanego przez źródło modelu COM i nie będą działać w środowisku uruchomieniowym
pt_br: As APIs de interoperabilidade COM em 'System.Runtime.InteropServices.Marshal' não dá suporte a COM gerado na origem e falharão no tempo de execução
ru: API COM-взаимодействия в "System.Runtime.InteropServices.Marshal" не поддерживают COM, созданные источником и вызовут сбой во время выполнения
tr: 'System.Runtime.InteropServices.Marshal' üzerindeki COM ile birlikte çalışma API'leri, kaynak tarafından oluşturulan COM'u desteklemez ve çalışma zamanında başarısız olur
zh_hans: “System.Runtime.InteropServices.Marshal”上的 COM 互操作 API 不支持源生成的 COM，并且将在运行时失败
zh_hant: 'System.Runtime.InteropServices.Marshal' 上的 COM Interop API 不支援來源產生的 COM，且將於執行階段中失敗

# RuntimeComApisDoNotSupportSourceGeneratedComMessage
source: The method '{0}' only supports runtime-based COM interop and will not work with type '{1}'
cs: Metoda {0} podporuje pouze vzájemnou spolupráci COM založenou na modulu runtime a nebude fungovat s typem {1}.
de: Die Methode "{0}" unterstützt nur laufzeitbasierte COM-Interop und funktioniert nicht mit dem Typ "{1}".
es: El método “{0}” solo admite interoperabilidad COM basada en tiempo de ejecución y no funcionará con el tipo “{1}”
fr: La méthode '{0}' ne prend en charge que l'interopérabilité COM basée sur l'exécution et ne fonctionnera pas avec le type '{1}'
it: Il metodo '{0}' supporta solo l'interoperabilità COM basata sul runtime e non funzionerà con il tipo '{1}'
ja: メソッド '{0}' はランタイム ベースの COM 相互運用のみをサポートし、型 '{1}' では機能しません
ko: '{0}' 메서드는 런타임 기반 COM 상호 운용성만 지원하며 '{1}' 유형에서는 작동하지 않습니다.
pl: Metoda „{0}” obsługuje tylko usługę międzyoperacyjną modelu COM opartą na środowisku uruchomieniowym i nie będzie działać z typem „{1}”
pt_br: O método '{0}' suporta apenas interoperabilidade COM baseada em tempo de execução e não funcionará com o tipo '{1}'
ru: Метод "{0}" поддерживает только COM-взаимодействие на основе среды выполнения и не будет работать с типом "{1}"
tr: '{0}' yöntemi yalnızca çalışma zamanı tabanlı COM birlikte çalışmayı destekler ve '{1}' türüyle çalışmaz
zh_hans: 方法“{0}”仅支持基于运行时的 COM 互操作，并且不适用于类型“{1}”
zh_hant: 方法 '{0}' 只支援執行階段型 COM Interop，且不適用於類型 '{1}'

# RuntimeComApisDoNotSupportSourceGeneratedComTitle
source: COM Interop APIs on 'System.Runtime.InteropServices.Marshal' do not support source-generated COM
cs: Rozhraní COM Interop API na System.Runtime.InteropServices.Marshal nepodporují model COM generovaný zdrojem
de: COM-Interop-APIs auf "System.Runtime.InteropServices.Marshal" unterstützen keine vom Quellcode generierten COM-Dateien.
es: Las API de interoperabilidad COM en “System.Runtime.InteropServices.Marshal” no admiten COM generado por origen
fr: Les API COM Interop sur 'System.Runtime.InteropServices.Marshal' ne prennent pas en charge COM généré par la source
it: Le API di interoperabilità COM su 'System.Runtime.InteropServices.Marshal' non supportano i COM generati dall’origine
ja: 'System.Runtime.InteropServices.Marshal' 上の COM 相互運用 API は、ソース生成 COM をサポートしていません
ko: 'System.Runtime.InteropServices.Marshal'의 COM Interop API는 소스 생성 COM을 지원하지 않습니다.
pl: Interfejsy API usługi międzyoperacyjnej modelu COM w elemencie „System.Runtime.InteropServices.Marshal” nie obsługują generowanego przez źródło modelu COM
pt_br: APIs de interoperabilidade COM em 'System.Runtime.InteropServices.Marshal' não dá suporte a COM gerado na origem
ru: API COM-взаимодействия в "System.Runtime.InteropServices.Marshal" не поддерживают COM, созданные источником
tr: 'System.Runtime.InteropServices.Marshal' üzerindeki COM ile birlikte çalışma API'leri, kaynak tarafından oluşturulan COM'u desteklemez
zh_hans: “System.Runtime.InteropServices.Marshal”上的 COM 互操作 API 不支持源生成的 COM
zh_hant: 'System.Runtime.InteropServices.Marshal' 上的 COM Interop API 不支援來源產生的 COM

# RuntimeMarshallingMustBeDisabled
source: Runtime marshalling must be disabled in this project by applying the 'System.Runtime.CompilerServices.DisableRuntimeMarshallingAttribute' to the assembly to enable marshalling this type.
cs: Aby se povolilo zařazování tohoto typu, musí se v tomto projektu zakázat zařazování modulu runtime použitím atributu System.Runtime.CompilerServices.DisableRuntimeMarshallingAttribute u sestavení.
de: Das Runtime-Marshalling muss in diesem Projekt deaktiviert werden, indem „System.Runtime.CompilerServices.DisableRuntimeMarshallingAttribute“ auf die Assembly angewendet wird, um das Marshalling dieses Typs zu ermöglichen.
es: La serialización en tiempo de ejecución debe deshabilitarse en este proyecto aplicando \"System.Runtime.CompilerServices.DisableRuntimeMars contosoingAttribute\" al ensamblado para habilitar la serialización de este tipo.
fr: Le marshaling du runtime doit être désactivé dans ce projet en appliquant « System.Runtime.CompilerServices.DisableRuntimeMarshallingAttribute » à l’assembly pour activer le marshaling de ce type.
it: Il marshalling di runtime in questo progetto deve essere disabilitato applicando 'System.Runtime.CompilerServices.DisableRuntimeMarshallingAttribute' all'assembly per abilitare il marshalling di questo tipo.
ja: このプロジェクトでは、アセンブリに 'System.Runtime.CompilerServices.DisableRuntimeMarshallingAttribute' を適用してランタイム マーシャリングを無効にし、この型のマーシャリングを有効にする必要があります。
ko: 이 형식의 마샬링을 활성화하려면 어셈블리에 'System.Runtime.CompilerServices.DisableRuntimeMarshallingAttribute'를 적용하여 이 프로젝트에서 런타임 마샬링을 비활성화해야 합니다.
pl: Marshalling środowiska uruchomieniowego musi być wyłączony w tym projekcie przez zastosowanie do zestawu atrybutu „System.Runtime.InteropServices.DisableRuntimeMarshallingAttribute”, aby umożliwić marshalling tego typu.
pt_br: O marshalling de tempo de execução deve ser desabilitado neste projeto aplicando o 'System.Runtime.CompilerServices.DisableRuntimeMarshallingAttribute' ao assembly para habilitar o marshalling desse tipo.
ru: В этом проекте следует отключить маршализацию среды выполнения путем применения к сборке атрибута \"System.Runtime.CompilerServices.DisableRuntimeMarshallingAttribute\" для включения маршализации этого типа.
tr: Bu türü sıralamayı etkinleştirmek için derlemeye 'System.Runtime.CompilerServices.DisableRuntimeMarshallingAttribute' uygulanarak bu projede çalışma zamanı sıralaması devre dışı bırakılmalıdır.
zh_hans: 必须通过将 \"System.Runtime.CompilerServices.DisableRuntimeMarshallingAttribute\" 应用到程序集来在此项目中禁用运行时封送，以启用此类型的封送处理。
zh_hant: 必須將 'System.Runtime.CompilerServices.DisableRuntimeMarshallingAttribute' 套用到組件，以停用此專案中的執行階段封送處理，以啟用此類型的封送處理。

# SizeOfCollectionMustBeKnownAtMarshalTimeMessageOutParam
source: The size of parameter '{0}' that is marshalled to the callee must be defined when the method is called, but count parameter '{1}' is an 'out' parameter.
cs: Při volání metody musí být definována velikost parametru{0}, která je zařazena do volané metody, ale parametr count {1} je parametr out.
de: Die Größe des Parameters "{0}", der an den Aufgerufenen gemarshallt wird, muss definiert werden, wenn die Methode aufgerufen wird. Der Count-Parameter "{1}" ist jedoch ein "Out"-Parameter.
es: El tamaño del parámetro "{0}" que se serializa al destinatario debe definirse cuando se llama al método, pero el parámetro de recuento "{1}" es un parámetro "out".
fr: La taille du paramètre '{0}' qui est marshalé à l'appelé doit être définie lorsque la méthode est appelée, mais le paramètre count '{1}' est un paramètre 'out'.
it: Le dimensioni del parametro '{0}' di cui viene eseguito il marshalling al destinatario della chiamata devono essere definite quando viene chiamato il metodo, ma il parametro conteggio '{1}' è un parametro 'out'.
ja: 呼び出し先にマーシャリングされるパラメーター '{0}' のサイズは、メソッドが呼び出されたときに定義する必要がありますが、count パラメーター '{1}' は 'out' パラメーターです。
ko: 메서드를 호출할 때 호출 수신자로 마샬링되는 매개 변수 '{0}'의 크기를 정의해야 하지만 count 매개 변수 '{1}'은(는) 'out' 매개 변수입니다.
pl: Rozmiar parametru „{0}”, który jest kierowany do obiektu wywołującego, musi być zdefiniowany podczas wywoływania metody, ale parametr ILE.LICZB „{1}” jest parametrem „out”.
pt_br: O tamanho do parâmetro '{0}' que é empacotado para o receptor deve ser definido quando o método é chamado, mas o parâmetro de contagem '{1}' é um parâmetro 'out'.
ru: При вызове метода должен быть определен размер параметра "{0}", который был маршалирован вызываемому абоненту, но исчисляемый параметр "{1}" является выходным.
tr: Aramanın alıcısına hazırlanan '{0}' parametresinin boyutu yöntem çağrıldığında tanımlanmalıdır ancak '{1}' sayı parametresi bir ‘çıkış’ parametresidir.
zh_hans: 调用方法时，必须定义封送给被调用方的参数“{0}”的大小，但计数参数“{1}”是一个 "out" 参数。
zh_hant: 呼叫方法時，必須定義封送處理給被呼叫者的參數 '{0}' 的大小，但 count 參數 '{1}' 是 'out' 參數。

# SizeOfCollectionMustBeKnownAtMarshalTimeMessageReturnValue
source: The size of parameter '{0}' that is marshalled to the callee must be defined when the method is called, but the return value is used as the size of the collection.
cs: Při volání metody musí být definována velikost parametru{0}, která je zařazena do volaného, ale vrácená hodnota se používá jako velikost kolekce.
de: Die Größe des Parameters "{0}", der an den Aufgerufenen gemarshallt wird, muss beim Aufrufen der Methode definiert werden, aber der Rückgabewert wird als Größe der Sammlung verwendet.
es: El tamaño del parámetro "{0}" que se serializa al destinatario debe definirse cuando se llama al método, pero el valor de retorno se utiliza como tamaño de la colección.
fr: La taille du paramètre '{0}' qui est marshalé à l'appelé doit être définie lorsque la méthode est appelée, mais la valeur de retour est utilisée comme taille de la collection.
it: Le dimensioni del parametro '{0}' di cui viene eseguito il marshalling al destinatario della chiamata devono essere definite quando viene chiamato il metodo, ma il valore restituito viene utilizzato come dimensione della raccolta.
ja: 呼び出し先にマーシャリングされるパラメーター '{0}' のサイズは、メソッドが呼び出されるときに定義する必要がありますが、戻り値はコレクションのサイズとして使用されます。
ko: 메서드를 호출할 때 호출 수신자로 마샬링되는 매개 변수 '{0}'의 크기를 정의해야 하지만 반환 값은 컬렉션의 크기로 사용됩니다.
pl: Rozmiar parametru „{0}”, który jest kierowany do obiektu wywołującego, musi być zdefiniowany podczas wywoływania metody, ale wartość zwracana jest używana jako rozmiar kolekcji.
pt_br: O tamanho do parâmetro '{0}' que é empacotado para o receptor deve ser definido quando o método é chamado, mas o valor de retorno é usado como o tamanho da coleção.
ru: При вызове метода должен быть определен размер параметра "{0}", который был маршалирован вызываемому абоненту, но возвращаемое значение используется в качестве размера коллекции.
tr: Aramanın alıcısına hazırlanan '{0}' parametresinin boyutu yöntem çağrıldığında tanımlanmalıdır ancak dönüş değeri koleksiyonun boyutu olarak kullanılıyor.
zh_hans: 调用方法时，必须定义封送给被调用方的参数“{0}”的大小，但返回值用作集合的大小。
zh_hant: 呼叫方法時，必須定義封送處理給被呼叫者的參數 '{0}' 的大小，但使用傳回值做為集合的大小。

# SizeOfCollectionMustBeKnownAtMarshalTimeTitle
source: The size of a collection that is marshalled to the callee must be defined when the method is called.
cs: Velikost kolekce, která je zařazena do volaného, musí být definována při volání metody.
de: Die Größe einer Auflistung, die an den aufgerufenen Benutzer gemarshallt wird, muss definiert werden, wenn die Methode aufgerufen wird.
es: El tamaño de una colección que se serializa al destinatario debe definirse cuando se llama al método.
fr: La taille d'une collection qui est marshalée à l'appelé doit être définie lorsque la méthode est appelée.
it: Le dimensioni di una raccolta di cui viene eseguito il marshalling al destinatario della chiamata devono essere definite quando viene chiamato il metodo.
ja: 呼び出し先にマーシャリングされるコレクションのサイズは、メソッドの呼び出し時に定義する必要があります。
ko: 메서드가 호출될 때 호출 수신자로 마샬링되는 컬렉션의 크기를 정의해야 합니다.
pl: Rozmiar kolekcji kierowanej do obiektu wywołującego musi być zdefiniowany podczas wywoływania metody.
pt_br: O tamanho de uma coleção que é empacotada para o receptor deve ser definido quando o método é chamado.
ru: При вызове метода должен быть определен размер коллекции, маршалируемой вызываемому абоненту.
tr: Aramanın alıcısına hazırlanan bir koleksiyonun boyutu yöntem çağrıldığında tanımlanmalıdır.
zh_hans: 调用方法时，必须定义封送给被调用方的集合的大小。
zh_hant: 呼叫方法時，必須定義封送處理給被呼叫者的集合大小。

# StatefulMarshallerRequiresFreeDescription
source: A stateful marshaller must have a zero-parameter void-returning instance method named 'Free'.
cs: Stavový zařazovač musí mít instanční metodu s názvem Free, která nemá žádné parametry a vrací void.
de: Ein statusbehafteter Marshaller muss eine Instanzmethode mit dem Namen „Free“ mit null Parametern haben, die „nichtig“ zurückgibt.
es: Un serializador con estado debe tener un método de instancia de devolución void de parámetro cero denominado 'Free'.
fr: Un marshaleur avec état doit avoir une méthode d’instance de retour void de paramètre zéro nommée 'Free'.
it: Un gestore di marshalling con stato deve avere un metodo di istanza con restituzione void con parametro zero denominato 'Free'.
ja: ステートフル マーシャラーには、'Free' という名前で、パラメーターがなく、‘void’ を返すインスタンス メソッドが必要です。
ko: 상태 저장 마샬러에는 'Free'라는 0 매개 변수 반환 인스턴스 메서드가 있어야 합니다.
pl: Stanowy marshaller musi mieć metodę wystąpienia zwracającą wartość nieważną o parametrze 0 o nazwie „Free”.
pt_br: Um marshaller com estado deve ter um método de instância de retorno nulo de parâmetro zero chamado 'Gratuito'.
ru: Маршалер с отслеживанием состояния должен иметь метод экземпляра с нулевым параметром, возвращающий void, с именем "Free".
tr: Durum bilgisi olan bir hazırlayıcının 'Free' adlı sıfır parametreli hükümsüz dönen bir örnek yöntemi olmalıdır.
zh_hans: 监控状态的封送程序必须具有名为 “Free” 的零参数 void 返回实例方法。
zh_hant: 具狀態的封送處理常式必須有名稱為 'Free' 的零參數無效傳回執行個體方法。

# StatefulMarshallerRequiresFreeMessage
source: The type '{0}' is a stateful marshaller and does not have a zero-parameter void-returning instance method named 'Free'
cs: Typ {0} je stavový zařazovač a nemá instanční metodu s názvem Free, která je bez parametrů a vrací void.
de: Der Typ „{0}“ ist ein statusbehafteter Marshaller und verfügt nicht über eine Instanzmethode mit null Parametern mit dem Namen „Free“, die „nichtig“ zurückgibt.
es: El tipo '{0}' es un serializador con estado y no tiene ningún método de instancia de devolución void de parámetro cero denominado 'Free'.
fr: Le type '{0}' est un marshaleur avec état et n’a pas de méthode d’instance de retour void de paramètre zéro nommée 'Free'
it: Il tipo '{0}' è un gestore di marshalling con stato e non dispone di un metodo di istanza con restituzione void con parametro zero denominato 'Free'
ja: 型 '{0}' はステートフル マーシャラーであり、'Free' という名前で、パラメーターがなく、’void’ を返す 0 パラメーターのインスタンス メソッドがありません
ko: 형식 '{0}'은(는) 상태 저장 마샬러이며 'Free'라는 이름의 0 매개 변수 무효 반환 인스턴스 메서드가 없습니다.
pl: Typ „{0}” jest stanowym marshallerem i nie ma metody wystąpienia zwracającego wartość nieważną o parametrze 0 o nazwie „Free”
pt_br: O tipo '{0}' é um marshaller com estado e não tem um método de instância de retorno nulo de parâmetro zero chamado 'Gratuito'
ru: Тип "{0}" является маршалером с отслеживанием состояния и не имеет метода экземпляра с нулевым параметром, возвращающего void, с именем "Free"
tr: '{0}' türü durum bilgisi olan bir hazırlayıcıdır ve 'Free' adlı sıfır parametreli hükümsüz dönen bir örnek yöntemine sahip değil
zh_hans: 类型“{0}”是监控状态的封送程序，并且不具有名为 “Free” 的零参数 void 返回实例方法
zh_hant: 類型 '{0}' 是具狀態的封送處理器，且沒有名為 'Free' 的零參數無效傳回執行個體方法

# StatefulMarshallerRequiresFromManagedDescription
source: A stateful marshaller that supports marshalling from managed to unmanaged must provide a 'FromManaged' instance method that takes the managed value as a parameter and returns 'void'.
cs: Stavový zařazovač, který podporuje zařazování ze spravovaného do nespravovaného, musí poskytovat instanční metodu FromManaged, která přebírá spravovanou hodnotu jako parametr a vrací void.
de: Ein statusbehafteter Marshaller, der das Marshallen von verwaltet zu nicht verwaltet unterstützt, muss eine „FromManaged“-Instanzmethode bereitstellen, die den verwalteten Wert als Parameter akzeptiert und „nichtig“ zurückgibt.
es: Un serializador con estado que admita la serialización de administrado a no administrado debe proporcionar un método de instancia 'FromManaged' que tome el valor administrado como parámetro y devuelva 'void'.
fr: Un marshaleur avec état qui prend en charge le marshaling de managé à non managé doit fournir une méthode d’instance 'FromManaged' qui prend la valeur managée en tant que paramètre et retourne 'void'.
it: Un gestore di marshalling con stato che supporta il marshalling da gestito a non gestito deve fornire un metodo di istanza 'FromManaged' che accetta il valore gestito come parametro e restituisce 'void'.
ja: マネージドからアンマネージドへのマーシャリングをサポートするステートフル マーシャラーは、マネージド値をパラメーターとして受け取り 'void' を返す、'FromManaged' インスタンス メソッドを提供する必要があります。
ko: 관리형에서 비관리형으로의 마샬링을 지원하는 상태 저장 마샬러는 관리되는 값을 매개 변수로 사용하고 'void'를 반환하는 'FromManaged' 인스턴스 메서드를 제공해야 합니다.
pl: Stanowu marshaller obsługujący kierowanie z zarządzanego do niezarządzanego musi udostępniać metodę wystąpienia „ZNiezarządzane”, która przyjmuje wartość zarządzaną jako parametr i zwraca wartość „nieważne”
pt_br: Um marshaller com estado que dá suporte ao marshalling de gerenciado para não gerenciado deve fornecer um método de instância 'FromManaged' que usa o valor gerenciado como um parâmetro e retorna 'void'.
ru: Маршалер с отслеживанием состояния, поддерживающий маршалинг от управляемого к неуправляемому, должен предоставить метод экземпляра FromManaged, принимающий управляемое значение в качестве параметра и возвращающий значение "void".
tr: Yönetilenden yönetilmeyene hazırlamayı destekleyen durum bilgisi olan bir hazırlayıcı, yönetilen değeri parametre olarak alan ve 'void' döndüren bir 'FromManaged' örnek yöntemi sağlamalıdır.
zh_hans: 支持从托管到非管理的封送的监控状态封送程序必须提供 “FromManaged” 实例方法，该方法将托管值作为参数并返回 “void”。
zh_hant: 支援從受控到未受控封送處理的具狀態封送處理器必須提供 'FromManaged' 執行個體方法，該方法將受控值作為參數並傳回 'void'。
