Repository: dotnet/runtime
Catalog: src/libraries/System.Runtime.InteropServices/gen/Common/Resources/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ConvertToLibraryImportWithSuffixAddUnsafe
source: Convert to 'LibraryImport' with '{0}' suffix and enable unsafe code
cs: Převést na LibraryImport s příponou {0} a povolit nebezpečný kód
de: Konvertieren Sie in „LibraryImport“ mit dem Suffix „{0}“, und aktivieren Sie unsicheren Code.
es: Convertir a 'LibraryImport' con el sufijo '{0}' y habilitar código no seguro
fr: Convertir en 'LibraryImport' avec le suffixe '{0}' et activer le code non sécurisé
it: Converti in 'LibraryImport' con il suffisso '{0}' e abilita codice non sicuro
ja: '{0}' サフィックスを持つ 'LibraryImport' に変換し、アンセーフ コードを有効にする
ko: '{0}' 접미사가 있는 'LibraryImport'로 변환하고 안전하지 않은 코드를 활성화합니다.
pl: Konwertuj na element „LibraryImport” z sufiksem „{0}” i włącz niebezpieczny kod
pt_br: Converta em 'LibraryImport' com o sufixo '{0}' e habilite o código não seguro
ru: Преобразование в "LibraryImport" с суффиксом "{0}" и включение небезопасного кода
tr: '{0}' soneki ile 'LibraryImport' türüne dönüştür ve güvenli olmayan kodu etkinleştir
zh_hans: 转换为具有“{0}”后缀的 “LibraryImport” 并启用不安全的代码
zh_hant: 轉換為具有 '{0}' 尾碼的 'LibraryImport'，並啟用不安全的程式碼

# CustomMarshallerTypeMustHaveRequiredShapeTitle
source: Marshaller type does not have the required shape
cs: Zařazovací typ nemá požadovaný tvar
de: Der Marshaller-Typ weist nicht die erforderliche Form auf
es: El tipo de serializador no tiene la forma necesaria
fr: Le type Marshaller n’a pas la forme requise
it: Il tipo di marshaller non ha la forma richiesta
ja: マーシャラー型に必要な図形がありません
ko: 마샬러 형식에 필요한 셰이프가 없습니다.
pl: Typ marshallera nie ma wymaganego kształtu
pt_br: O tipo de marshaller não tem a forma necessária
ru: Тип маршалера не имеет требуемой фигуры
tr: Sıralayıcı türü gerekli şekle sahip değil
zh_hans: 封送程序类型没有必需的形状
zh_hant: 封送處理器類型沒有必要的圖形

# CyclicalCountInfo
source: This element cannot depend on '{0}' for collection size information without creating a dependency cycle
cs: Tento prvek nesmí záviset na {0} pro informace o velikost kolekce bez toho, aby došlo k vytvoření cyklu závislosti.
de: Dieses Element kann für Informationen zur Sammlungsgröße nicht von \"{0}\" abhängen, ohne einen Abhängigkeitszyklus zu erstellen.
es: Este elemento no puede depender de “{0}” para la información de tamaño de colección sin crear un ciclo de dependencia
fr: Cet élément ne peut pas dépendre de « {0} » pour les informations de taille de collection sans créer un cycle de dépendance
it: Questo elemento non può dipendere da '{0}' per le informazioni sulle dimensioni della raccolta senza creare un ciclo di dipendenze
ja: この要素は、依存関係サイクルを作成せずに、コレクション サイズ情報向けに '{0}' に依存することはできません
ko: 이 요소는 종속성 주기를 생성하지 않고 컬렉션 크기 정보에 대해 '{0}'에 의존할 수 없습니다.
pl: Ten element nie może zależeć od elementu „{0}” dla informacji o rozmiarze kolekcji bez tworzenia cyklu zależności
pt_br: Este elemento não pode depender de '{0}' para informações de tamanho de coleção sem criar um ciclo de dependência
ru: Этот элемент не может получать от \"{0}\" сведения о размере коллекции без создания цикла зависимостей
tr: Bu öğe, bir bağımlılık döngüsü oluşturmadan koleksiyon boyutu bilgileri için '{0}' değerine bağımlı olamaz
zh_hans: 在不创建依赖关系循环的情况下，此元素无法依赖于集合大小信息的“{0}”
zh_hant: 此元素不需要建立相依性循環，就無法依存 '{0}' 集合大小資訊

# DuplicateCountInfo
source: Count information for a given element at a given indirection level can only be specified once
cs: Informace o počtu pro daný prvek na dané úrovni indirekce se dají určit jenom jednou
de: Die Anzahl der Informationen für ein bestimmtes Element auf einer bestimmten Dereferenzierungsebene kann nur einmal angegeben werden.
es: La información de recuento de un elemento determinado en un nivel de direccionamiento indirecto determinado solo se puede especificar una vez
fr: Les informations de nombre pour un élément donné à un niveau d’indirection donné ne peuvent être spécifiées qu’une seule fois
it: Le informazioni sul conteggio per un elemento specifico a un livello di riferimento indiretto specificato possono essere specificate una sola volta
ja: 指定された間接参照レベルの特定の要素のカウント情報は、1 回のみ指定できます
ko: 주어진 간접 수준에서 주어진 요소에 대한 개수 정보는 한 번만 지정할 수 있습니다.
pl: Informacje o liczbie dla danego elementu na danym poziomie pośrednim można podać tylko raz
pt_br: As informações de contagem de um determinado elemento em um determinado nível de indireção só podem ser especificadas uma vez
ru: Данные счетчика для заданного элемента на заданном уровне косвенного обращения можно указать только один раз
tr: Belirli bir yöneltme düzeyindeki belirli bir öğeye ait sayım bilgileri yalnızca bir kez belirtilebilir
zh_hans: 给定间接级别的给定元素的计数信息只能指定一次
zh_hant: 在指定的間接層級，指定元素的計數資訊只能指定一次。

# DuplicateMarshallingInfo
source: Multiple marshalling attributes per element per indirection level is unsupported, but duplicate information was provided for indirection level {0}
cs: Více atributů zařazování pro každý prvek za úroveň indirekce se nepodporuje, ale byly poskytnuty duplicitní informace pro úroveň indirekce {0}
de: Mehrere Marshallingattribute pro Element pro Dereferenzierungsebene werden nicht unterstützt, es wurden jedoch doppelte Informationen für die Dereferenzierungsebene {0}
es: No se admiten varios atributos de serialización por elemento por nivel de direccionamiento indirecto, pero se proporcionó información duplicada para el nivel de direccionamiento indirecto {0}
fr: Plusieurs attributs de marshaling par élément par niveau d’indirection ne sont pas pris en charge, mais des informations en double ont été fournies pour le niveau d’indirection {0}
it: Non sono supportati più attributi di marshalling per elemento per livello di riferimento indiretto, ma sono state fornite informazioni duplicate per il livello di riferimento indiretto {0}
ja: 間接参照レベルごとに要素ごとに複数のマーシャリング属性はサポートされていませんが、間接参照レベル {0} に重複する情報が指定されました
ko: 간접 수준당 요소당 여러 마샬링 특성이 지원되지 않지만 간접 수준 {0}에 대해 중복 정보가 제공되었습니다.
pl: Wiele atrybutów skierowania na element na poziomie pośrednim nie jest obsługiwanych, ale podano zduplikowane informacje dla poziomu pośredniego {0}
pt_br: Não há suporte para vários atributos de marshalling por elemento por nível de indireção, mas foram fornecidas informações duplicadas para o nível de indireção {0}
ru: Несколько атрибутов маршализации на один элемент на каждом уровне косвенного обращения не поддерживаются, но для уровня косвенного обращения {0} указаны повторяющиеся сведения
tr: Her bir yöneltme düzeyi için tek bir öğe için birden çok sıralama özniteliği desteklenmiyor, ancak yöneltme düzeyi {0} için yinelenen bilgiler mevcut
zh_hans: 不支持每个间接级别每个元素有多个封送属性，但为间接级别 {0} 提供了重复的信息
zh_hant: 不支援每個元素的每個間接層級有多個排列屬性，但為間接層級提供了重複的資訊{0}

# ElementMarshallerCannotBeStatefulDescription
source: A marshaller for an element scenario cannot be stateful.
cs: Zařazovač pro scénář elementu nemůže být stavový.
de: Ein Marshaller für ein Elementszenario kann nicht statusbehaftet sein.
es: Un serializador para un escenario del elemento no puede tener estado.
fr: Un marshaleur pour un scénario d’élément ne peut pas être avec état.
it: Un gestore di marshalling per uno scenario di elemento non può essere con stato.
ja: 要素シナリオのマーシャラーをステートフルにすることはできません。
ko: 요소 시나리오의 마샬러는 상태를 저장할 수 없습니다.
pl: Marshaller dla scenariusza elementu nie może być stanowy.
pt_br: Um marshaller para um cenário de elemento não pode ter estado.
ru: Маршалер для сценария элемента не может иметь отслеживание состояния.
tr: Öğe senaryosu için bir hazırlayıcının durum bilgisi yoktur.
zh_hans: 元素方案的封送程序不能是监控状态的。
zh_hant: 元素案例的封送處理器不可為可設定狀態。

# ElementMarshallerCannotBeStatefulMessage
source: The specified marshaller type '{0}' is a stateful marshaller, but stateful marshallers are not allowed in the provided marshal mode '{1}'
cs: Zadaný zařazovací typ {0} je stavový zařazovač, ale stavové zařazovače nejsou v poskytnutém režimu zařazování {1} povolené.
de: Der angegebene Marshallertyp „{0}“ ist ein statusbehafteter Marshaller, aber statusbehaftete Marshaller sind im angegebenen Marshallenmodus „{1}“ nicht zulässig.
es: El tipo de serializador especificado '{0}' es un serializador con estado, pero no se permiten serializadores con estado en el modo de serialización proporcionado '{1}'.
fr: Le type de marshaleur spécifié '{0}' est un marshaleur avec état, mais les marshaleurs avec état ne sont pas autorisés dans le mode marshal '{1}' fourni
it: Il tipo di marshalling specificato '{0}' è un gestore di marshalling con stato, ma i marshalling con stato non sono consentiti nella modalità di marshalling specificata '{1}'
ja: 指定されたマーシャラー型 '{0}' はステートフル マーシャラーですが、指定されたマーシャリング モード '{1} ではステートフル マーシャラーを使用できません
ko: 지정된 마샬러 형식 '{0}'은(는) 상태 저장 마샬러이지만 제공된 마샬 모드 '{1}'에서는 상태 저장 마샬러가 허용되지 않습니다.
pl: Określony typ marshallera „{0}” jest stanowym marshallerem, ale stanowe marshallery nie są dozwolone w podanym trybie marshalingu „{1}”
pt_br: O tipo de marshaller especificado '{0}' é um marshaller com estado, mas os marshallers com estado não são permitidos no modo de marshal '{1}' fornecido
ru: Указанный тип маршалера "{0}" является маршалером с отслеживанием состояния, но маршалер с отслеживанием состояния в предоставленном режиме "{1}" не допускается.
tr: Belirtilen hazırlayıcı '{0}' türü durum bilgisi olan bir hazırlayıcıdır, ancak durum bilgisi olan hazırlayıcılara, sağlanan '{1}' hazırlama modunda izin verilmez
zh_hans: 指定的封送程序类型“{0}”是监控状态的封送程序，但在提供的封送模式“{1}”中不允许使用监控状态的封送程序
zh_hant: 指定的封送處理器類型 '{0}' 是可設定狀態的封送處理器，但是在提供的封送處理模式 '{1}' 中不允許有狀態的封送處理器

# ElementTypesOfReturnTypesMustMatchDescription
source: The element type of the span returned by the first method must be the same type as the element type of the span returned by the second method.
cs: Typ elementu span vrácený první metodou musí být stejného typu jako typ elementu rozsahu vráceného druhou metodou.
de: Der Elementtyp des von der ersten Methode zurückgegebenen Bereichs muss vom gleichen Typ sein wie der Elementtyp des Bereichs, der von der zweiten Methode zurückgegeben wird.
es: El tipo de elemento del intervalo devuelto por el primer método debe ser del mismo tipo que el tipo de elemento del intervalo devuelto por el segundo método.
fr: Le type d’élément de l’étendue retournée par la première méthode doit être du même type que le type d’élément de l’étendue retournée par la deuxième méthode.
it: Il tipo di elemento dell'intervallo restituito dal primo metodo deve essere dello stesso tipo del tipo di elemento dell'intervallo restituito dal secondo metodo.
ja: 最初のメソッドによって返されるスパンの要素型は、2 番目のメソッドによって返されるスパンの要素型と同じ型である必要があります。
ko: 첫 번째 메서드에서 반환된 범위의 요소 형식은 두 번째 메서드에서 반환된 범위의 요소 형식과 같은 형식이어야 합니다.
pl: Typ elementu zakresu zwracanego przez pierwszą metodę musi być tego samego typu co typ elementu zakresu zwracanego przez drugą metodę.
pt_br: O tipo de elemento do intervalo retornado pelo primeiro método deve ser do mesmo tipo que o tipo de elemento da extensão retornada pelo segundo método.
ru: Тип элемента диапазона, возвращаемого первым методом, должен быть того же типа, что и тип элемента диапазона, возвращаемого вторым методом.
tr: İlk yöntem tarafından döndürülen yayılım öğe türü, ikinci metot tarafından döndürülen yayılım öğe türüyle aynı olmalıdır.
zh_hans: 第一个方法返回的跨度的元素类型必须与第二个方法返回的跨度的元素类型为相同的类型。
zh_hant: 第一個方法傳回之跨距的元素類型必須與第二個方法傳回之跨距的元素類型相同類型。

# ElementTypesOfReturnTypesMustMatchMessage
source: The element type of the span returned by '{0}' must be the same type as the element type of the span returned by '{1}'.
cs: Typ elementu span vrácený {0} musí být stejného typu jako typ elementu rozsahu vráceného {1}.
de: Der Elementtyp des von „{0}“ zurückgegebenen Bereichs muss vom gleichen Typ sein wie der Elementtyp des Bereichs, der von „{1}“ zurückgegeben wird.
es: El tipo de elemento del intervalo devuelto por "{0}" debe ser del mismo tipo que el tipo de elemento del intervalo devuelto por "{1}".
fr: Le type d’élément de l’étendue retournée par '{0}' doit être du même type que le type d’élément de l’étendue retournée par '{1}'.
it: Il tipo di elemento dell'intervallo restituito da '{0}' deve essere dello stesso tipo del tipo di elemento dell'intervallo restituito da '{1}'.
ja: '{0}' によって返されるスパンの要素型は、'{1}' によって返されるスパンの要素型と同じ型である必要があります。
ko: '{0}'에서 반환된 범위의 요소 형식은 '{1}'에서 반환된 범위의 요소 형식과 동일한 형식이어야 합니다.
pl: Typ elementu zakresu zwracanego przez „{0}” musi być tego samego typu co typ elementu zakresu zwracanego przez „{1}”.
pt_br: O tipo de elemento do intervalo retornado por “{0}” deve ser do mesmo tipo que o tipo de elemento do intervalo retornado por “{1}”.
ru: Тип диапазона, возвращаемого "{0}", должен быть того же типа, что и тип диапазона, возвращаемого "{1}".
tr: '{0}' tarafından döndürülen yayılım öğe türü, '{1}'tarafından döndürülen yayılım öğe türüyle aynı olmalıdır.
zh_hans: “{0}”返回的跨度的元素类型必须与“{1}”返回的跨度的元素类型为相同的类型。
zh_hant: '{0}' 傳回之跨距的元素類型必須與 '{1}' 傳回之跨距的元素類型相同類型。

# EntryPointTypeMustBeNonNullDescription
source: An entry-point type for marshalling a given type must not be 'null'.
cs: Typ vstupního bodu pro zařazování daného typu nesmí nabývat hodnoty null.
de: Ein Einstiegspunkttyp zum Marshallen eines angegebenen Typs darf nicht "NULL" sein.
es: Un tipo de punto de entrada para serializar un tipo determinado no debe ser "null".
fr: Un type de point d’entrée pour le marshaling d’un type donné ne doit pas être « null ».
it: Un tipo di punto di ingresso per il marshalling di un tipo specificato non deve essere 'null'.
ja: 特定の型をマーシャリングするためのエントリ ポイント型を 'null' にすることはできません。
ko: 지정된 유형을 마샬링하기 위한 진입점 유형은 'null'이 아니어야 합니다.
pl: Typ punktu wejścia do przeprowadzenia marshalingu danego typu nie może mieć wartości „null”.
pt_br: Um tipo de ponto de entrada para empacotar um determinado tipo não deve ser 'null'.
ru: Тип точки входа для маршалирования заданного типа должен отличаться от "NULL".
tr: Belirli bir tür için bir giriş noktası türü, 'null' olmamalıdır.
zh_hans: 用于封送给定类型的入口点类型不能为“null”。
zh_hant: 封送處理指定類型的進入點類型不得為 'null'。

# EntryPointTypeMustBeNonNullMessage
source: The entry-point marshaller type for the type '{0}' must be not 'null'
cs: Zařazovací typ vstupního bodu pro typ {0} nesmí nabývat hodnoty null.
de: Der Marshallertyp des Einstiegspunkts für den Typ "{0}" darf nicht "NULL" sein
es: El tipo de serializador de punto de entrada para el tipo "{0}" no debe ser "null"
fr: Le type de marshaleur de point d’entrée pour le type « {0} » ne doit pas être « null »
it: Il tipo di marshaller del punto di ingresso per il tipo '{0}' non deve essere 'null'
ja: 型 '{0}' のエントリ ポイント マーシャラー型は 'null' 以外である必要があります
ko: '{0}' 유형의 진입점 마샬러 유형은 'null'이 아니어야 합니다.
pl: Typ marshallera punktu wejścia dla typu „{0}” nie może mieć wartości „null”
pt_br: O tipo de empacotador de ponto de entrada para o tipo '{0}' não deve ser 'nulo'
ru: Тип маршалера точки входа для типа '{0}' должен отличаться от "NULL"
tr: Tür '{0}' için giriş noktası hazırlayıcı türü 'null' olmamalıdır
zh_hans: 类型“{0}”的入口点封送处理程序类型不能为“null”
zh_hant: 類型 '{0}' 的進入點封送處理器類型不能是 'null'

source: An entry-point type for marshalling a given type must have a 'System.Runtime.InteropServices.CustomMarshallerAttribute' that specifies this type as the managed type.
cs: Typ vstupního bodu pro zařazování daného typu musí mít atribut System.Runtime.InteropServices.CustomMarshallerAttribute, který tento typ určuje jako spravovaný typ.
de: Ein nativer Typ für einen bestimmten Typ muss über das "System.Runtime.InteropServices.CustomTypeMarshallerAttribute" verfügen, das diesen Typ als verwalteten Typ angibt.
es: Un tipo de punto de entrada para serializar un tipo determinado debe tener un "System.Runtime.InteropServices.CustomMarshallerAttribute" que especifique este tipo como el tipo administrado.
fr: Un type de point d’entrée pour le marshaling d’un type donné doit avoir un « System.Runtime.InteropServices.CustomMarshallerAttribute » qui spécifie ce type en tant que type managé.
it: Un tipo di punto di ingresso per il marshalling di un determinato tipo deve includere un elemento 'System.Runtime.InteropServices.CustomMarshallerAttribute' che specifichi questo tipo come tipo gestito.
ja: 指定された型をマーシャリングするためのエントリ ポイント型は、この型をマネージド型として指定する 'System.Runtime.InteropServices.CustomMarshallerAttribute' を持つ必要があります。
ko: 지정된 형식을 마샬링하기 위한 진입점 형식에는 이 형식을 관리되는 형식으로 지정하는 'System.Runtime.InteropServices.CustomMarshallerAttribute'가 있어야 합니다.
pl: Typ punktu wejścia do przeprowadzenia marshalingu danego typu musi mieć atrybut „System.Runtime.InteropServices.CustomMarshaellerAttribute”, który określa ten typ jako typ zarządzany.
pt_br: Um tipo de ponto de entrada para empacotar um determinado tipo deve ter um 'System.Runtime.InteropServices.CustomMarshallerAttribute' que especifica esse tipo como o tipo gerenciado.
ru: У типа точки входа для маршалирования указанного типа должен быть атрибут "System.Runtime.InteropServices.CustomMarshallerAttribute", указывающий этот тип в качестве управляемого.
tr: Belirli bir tür için bir giriş noktası türünün, bu türü yönetilen tür olarak belirten 'System.Runtime.InteropServices.CustomMarshallerAttribute' değerini taşımalıdır.
zh_hans: 对给定类型进行封送处理的入口点类型必须具有将此类型指定为托管类型的 “System.Runtime.InteropServices.CustomMarshallerAttribute”。
zh_hant: 指定類型的封送處理進入點類型必須有 'System.Runtime.InteropServices.CustomMarshallerAttribute'，指定此類型為受控類型。

# EntryPointTypeMustHaveCustomMarshallerAttributeWithMatchingManagedTypeMessage
source: The entry-point marshaller type '{0}' for the type '{1}' must be a type with at least one 'System.Runtime.InteropServices.CustomMarshallerAttribute' that specifies this type as the managed type
cs: Zařazovací typ vstupního bodu {0} pro typ {1} musí být typ s nejméně jedním atributem System.Runtime.InteropServices.CustomMarshallerAttribute, který tento typ určuje jako spravovaný typ.
de: Der Marshallertyp "{0}" des Eintrittspunkts für den Typ "{1}" muss ein Typ mit mindestens einem "System.Runtime.InteropServices.CustomMarshallerAttribute" sein, der diesen Typ als verwalteten Typ angibt
es: El tipo de serializador de punto de entrada "{0}" para el tipo "{1}" debe ser un tipo con al menos un "System.Runtime.InteropServices.CustomMarshallerAttribute" que especifique este tipo como el tipo administrado
fr: Le type de marshaleur de point d’entrée « {0} » pour le type « {1} » doit être un type avec au moins un type « System.Runtime.InteropServices.CustomMarspiaerAttribute » qui spécifie ce type comme type managé
it: Il tipo di marshaller del punto di ingresso '{0}' per il tipo '{1}' deve essere un tipo con almeno un elemento 'System.Runtime.InteropServices.CustomMarshallerAttribute' che specifica questo tipo come tipo gestito
ja: 型 '{1}' 向けのエントリ ポイント マーシャラー型 '{0}' は、この型をマネージド型として指定する 'System.Runtime.InteropServices.CustomMarshallerAttribute' を 1 つ以上持つ型である必要があります
ko: '{1}' 유형의 진입점 마샬러 유형 '{0}'은(는) 이 유형을 관리 유형으로 지정하는 'System.Runtime.InteropServices.CustomMarshallerAttribute'가 하나 이상 있는 유형이어야 합니다.
pl: Typ marshallera punktu wejścia „{0}” dla typu „{1}” musi być typem z co najmniej jednym atrybutem „System.Runtime.InteropServices.CustomMarshaellerAttribute”, który określa ten typ jako typ zarządzany
pt_br: O tipo de empacotador de ponto de entrada '{0}' para o tipo '{1}' deve ser um tipo com pelo menos um 'System.Runtime.InteropServices.CustomMarshallerAttribute' que especifica esse tipo como o tipo gerenciado
ru: Тип маршалера точки входа "{0}" для типа "{1}" должен содержать хотя бы один атрибут "System.Runtime.InteropServices.CustomMarshallerAttribute", указывающий этот тип в качестве управляемого типа
tr: Tür '{1}' için giriş noktası hazırlayıcı türü '{0}', bu türü yönetilen tür olarak belirten en az bir 'System.Runtime.InteropServices.CustomMarshallerAttribute' türü olmalıdır
zh_hans: 适用于类型“{1}”的入口点封送处理程序类型“{0}”必须是至少具有一个指定此类型为托管类型的 “System.Runtime.InteropServices.CustomMarshallerAttribute”的类型
zh_hant: 類型 '{1}' 的進入點封送處理器類型 '{0}' 必須是具有至少一個 'System.Runtime.InteropServices.CustomMarshallerAttribute' 的類型，指定此類型為受控類型

# ExtraneousMarshallingInfo
source: Marshalling info was specified for 'ElementIndirectionDepth' {0}, but marshalling info was only needed for {1} level(s) of indirection
cs: Informace o zařazování se určily pro ElementIndirectionDepth {0}, ale informace o zařazování byly potřebné pouze pro {1} úrovně indirekce.
de: Marshallinginformationen wurden für \"ElementIndirectionDepth\" {0}angegeben. Marshallinginformationen wurden jedoch nur für {1} Dereferenzierungsebene(n) benötigt.
es: Se especificó información de serialización para “ElementIndirectionDepth” {0}, pero la información de serialización solo era necesaria para {1} niveles de direccionamiento indirecto
fr: Des informations de marshaling ont été spécifiées pour « ElementIndirectionDepth » {0}, mais les informations de marshaling étaient uniquement nécessaires pour {1} niveau(s) d’indirection
it: Sono state specificate informazioni di marshalling per l'elemento 'ElementIndirectionDepth' {0}, ma le informazioni di marshalling sono necessarie solo per {1} livello/i di riferimento indiretto
ja: 'ElementIndirectionDepth' {0} にマーシャリング情報が指定されましたが、マーシャリング情報は間接参照の {1} レベルにのみ必要です
ko: 마샬링 정보가 'ElementIndirectionDepth' {0}에 대해 지정되었지만 마샬링 정보는 간접 참조 수준 {1}에만 필요했습니다.
pl: Informacje dotyczące skierowania zostały określone dla elementu „ElementIndirectionDepth” {0}, ale informacje dotyczące skierowania były potrzebne tylko dla poziomów pośrednich w liczbie {1}
pt_br: As informações de marshalling foram especificadas para o {0} 'ElementIndirectionDepth', mas as informações de marshalling só eram necessárias para {1} nível(s) de indireção
ru: Для \"ElementIndirectionDepth\" {0} указаны сведения маршализации, но они необходимы только для {1} уровней косвенного обращения
tr: 'ElementIndirectionDepth' {0} için sıralama bilgileri belirtildi, ancak sıralama bilgileri yalnızca {1} yöneltme düzeyi için gerekli
zh_hans: 为 “ElementIndirectionDepth” {0} 指定了封送信息，但只有间接的 {1} 级别需要封送信息
zh_hant: 已為 'ElementIndirectionDepth' {0}指定封送處理資訊，但只有 {1}層級 (間接) 需要封送處理資訊

# FirstParameterMustMatchReturnTypeDescription
source: The first parameter of the first method must be the same type as the return types of the second method.
cs: První parametr první metody musí být stejného typu jako návratové typy druhé metody.
de: Der erste Parameter der ersten Methode muss den gleichen Typ wie die Rückgabetypen der zweiten Methode aufweisen.
es: El primer parámetro del primer método debe ser del mismo tipo que los tipos devueltos del segundo método.
fr: Le premier paramètre de la première méthode doit être du même type que les types de retour de la deuxième méthode.
it: Il primo parametro del primo metodo deve essere dello stesso tipo dei tipi restituiti del secondo metodo.
ja: 最初のメソッドの最初のパラメーターは、2 番目のメソッドの戻り値の型と同じ型である必要があります。
ko: 첫 번째 메서드의 첫 번째 매개 변수는 두 번째 메서드의 반환 형식과 같은 형식이어야 합니다.
pl: Pierwszy parametr pierwszej metody musi być tego samego typu co zwracane typy drugiej metody.
pt_br: O primeiro parâmetro do primeiro método deve ser do mesmo tipo que os tipos de retorno do segundo método.
ru: Первый параметр первого метода должен иметь тот же тип, что и возвращаемые типы второго метода.
tr: İlk metodun ilk parametresi, ikinci metodun dönüş türleriyle aynı olmalıdır.
zh_hans: 第一个方法的第一个参数必须与第二个方法的返回类型为相同的类型。
zh_hant: 第一個方法的第一個參數必須與第二個方法的傳回類型相同類型。
