Repository: dotnet/runtime
Catalog: src/libraries/System.Runtime.InteropServices/gen/Common/Resources/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ConfigurationNotSupportedMessageCom
source: The '{0}' configuration is not supported by source-generated COM. If the specified configuration is required, use `ComImport` instead.
cs: Konfigurace „{0}“ není podporována modelem COM generovaným zdrojem. Pokud je zadaná konfigurace povinná, použijte místo toho „ComImport“.
de: Die Konfiguration "{0}" wird vom quellgenerierten COM nicht unterstützt. Wenn die angegebene Konfiguration erforderlich ist, verwenden Sie stattdessen einen regulären "ComImport".
es: La configuración "{0}" no es compatible con COM generado por origen. Si se requiere la configuración especificada, usar "ComImport" en su lugar.
fr: La configuration «{0}» n’est pas prise en charge par com généré par la source. Si la configuration spécifiée est requise, utilisez « ComImport » à la place.
it: La configurazione '{0}' non è supportata dai COM generati dall'origine. Se la configurazione specificata è obbligatoria, usa un attributo `ComImport`.
ja: '{0}' 構成は、ソース生成済みの COM ではサポートされていません。指定した構成が必要な場合は、代わりに 'ComImport' を使用してください。
ko: '{0}' 구성은 원본 생성 COM에서 지원되지 않습니다. 지정된 구성이 필요한 경우 대신 'ComImport'를 사용합니다.
pl: Konfiguracja „{0}” nie jest obsługiwana przez COM generowany przez źródło. Jeśli określona konfiguracja jest wymagana, użyj zamiast niej `ComImport`.
pt_br: Um COM gerado pela origem não dá suporte à configuração '{0}'. Se a configuração especificada for necessária, use um 'ComImport' em vez disso.
ru: Конфигурация "{0}" не поддерживается моделью COM генератора исходного кода. Если указанная конфигурация обязательна, используйте "ComImport".
tr: '{0}' yapılandırması, kaynak tarafından oluşturulan COM tarafından desteklenmiyor. Belirtilen yapılandırma gerekiyorsa, bunun yerine "ComImport" kullanın.
zh_hans: 源生成的 COM 不支持 "{0}" 配置。如果需要指定的配置，请改用 `ComImport`。
zh_hant: 來源產生的 COM 不支援 '{0}' 設定。如果需要指定的設定，請改用 `ComImport`。

# ConfigurationNotSupportedMessageLibraryImport
source: The '{0}' configuration is not supported by source-generated P/Invokes. If the specified configuration is required, use a regular 'DllImport' instead.
cs: Konfigurace {0} není podporována zdrojově generovanými voláními P/Invoke. Pokud je zadaná konfigurace povinná, použijte místo toho normální DllImport.
de: Die Konfiguration „{0}“ wird von quellengenerierten P/Invokes nicht unterstützt. Wenn die angegebene Konfiguration erforderlich ist, verwenden Sie stattdessen einen regulären „DllImport“.
es: La configuración de "{0}" no está admitida por P/Invokes de un generador de código fuente. Si se requiere la configuración, use un "DllImport" normal en su lugar.
fr: La configuration '{0}' n’est pas prise en charge par les appels/P générés par la source. Si la configuration spécifiée est requise, utilisez plutôt un 'DllImport' standard.
it: La configurazione '{0}' non è supportata dai P/Invoke generati dall'origine. Se la configurazione specificata è obbligatoria, usa un attributo `DllImport` normale.
ja: '{0}' 構成は、ソース生成 P/Invokes ではサポートされていません。指定した構成が必要な場合は、代わりに通常の 'DllImport' を使用してください。
ko: '{0}' 구성은 소스 생성 P/Invoke에서 지원되지 않습니다. 지정된 구성이 필요한 경우 일반 'DllImport'를 대신 사용하세요.
pl: Konfiguracja „{0}” nie jest obsługiwana przez funkcję P/Invokes generowaną przez źródło. Jeśli określona konfiguracja jest wymagana, użyj zamiast tego zwykłego elementu „DllImport”.
pt_br: A configuração “{0}” não é tem suporte para P/Invokes gerados pela origem. Se a configuração especificada for necessária, use um 'DllImport' regular.
ru: Конфигурация "{0}" не поддерживается P/Invokes, созданными источником. Если требуется указанная конфигурация, используйте вместо нее обычный "DllImport".
tr: '{0}' yapılandırması, kaynak tarafından oluşturulan P/Invokes tarafından desteklenmiyor. Belirtilen yapılandırma gerekli ise, bunun yerine normal bir 'DllImport' kullanın.
zh_hans: 源生成的 P/Invoke 不支持“{0}”配置。如果需要指定配置，请改用常规的“DllImport”。
zh_hant: 來源產生的 P/Invokes 不支援 '{0}' 設定。如果需要指定的設定，請改用一般 'DllImport'。

# ConfigurationNotSupportedMessageMarshallingInfoCom
source: The specified marshalling configuration is not supported by source-generated COM. {0}.
cs: Zadaná konfigurace zařazování není podporována modelem COM generovaným zdrojem. {0}.
de: Die angegebene Marshallingkonfiguration wird vom quellgenerierten COM nicht unterstützt. {0}.
es: COM generado por origen no admite la configuración de serialización especificada. {0}.
fr: La configuration de marshaling spécifiée n’est pas prise en charge par COM généré par la source. {0}.
it: La configurazione di marshalling specificata non è supportata dai COM generati dall'origine. {0}.
ja: 指定されたマーシャリング構成は、ソース生成済みの COM ではサポートされていません。{0}。
ko: 지정된 마샬링 구성은 원본 생성 COM에서 지원되지 않습니다. {0}.
pl: Określona konfiguracja skierowania nie jest obsługiwana przez COM generowany źródłowo. {0}.
pt_br: Um COM gerado pela origem não dá suporte à configuração de realização de marshaling especificada. {0}.
ru: Указанная конфигурация маршалинга не поддерживается моделью COM генератора исходного кода. {0}.
tr: Belirtilen sıralama yapılandırması, kaynak tarafından oluşturulan COM tarafından desteklenmiyor. {0}.
zh_hans: 源生成的 COM 不支持指定的封送配置。{0}。
zh_hant: 来源產生的 COM 不支援指定的封送處理設定。{0}。

# ConfigurationNotSupportedMessageMarshallingInfoLibraryImport
source: The specified marshalling configuration is not supported by source-generated P/Invokes. {0}.
cs: Určenou konfiguraci zařazování nepodporují zdrojem generovaná volání P/Invokes. {0}.
de: Die angegebene Marshallingkonfiguration wird von quellgenerierten P/Invokes nicht unterstützt. {0}.
es: La configuración de serialización especificada no está admitida por P/Invokes de un generador de código fuente. {0}.
fr: La configuration de marshaling spécifiée n’est pas prise en charge par les P/Invokes générés par la source. {0}.
it: La configurazione di marshalling specificata non è supportata dai P/Invoke generati dall'origine. {0}.
ja: 指定されたマーシャリング構成は、ソースで生成された P/Invoke ではサポートされていません。{0}。
ko: 지정된 마샬링 구성은 소스 생성 P/Invoke에서 지원되지 않습니다. {0}.
pl: Określona konfiguracja skierowania nie jest obsługiwana przez funkcję P/Invokes generowaną przez źródło. {0}.
pt_br: Não há suporte para a configuração de marshaling especificada por P/Invokes gerados pela origem. {0}.
ru: Указанная конфигурация маршализации не поддерживается в P/Invoke с созданием источника. {0}.
tr: Belirtilen sıralama yapılandırması, kaynak tarafından oluşturulan P/Invokes tarafından desteklenmiyor. {0}.
zh_hans: 源生成的 P/Invoke 不支持指定的封送配置。{0}。
zh_hant: 来源產生的 P/Invokes 不支援指定的排列設定。{0}。

# ConfigurationNotSupportedMessageParameterCom
source: The specified '{0}' configuration for parameter '{1}' is not supported by source-generated COM. If the specified configuration is required, use `ComImport` instead.
cs: Zadaná konfigurace „{0}“ pro parametr „{1}“ není podporována modelem COM generovaným zdrojem. Pokud je zadaná konfigurace povinná, použijte místo toho ComImport.
de: Die angegebene Konfiguration "{0}" für den Parameter "{1}" wird vom quellgenerierten COM nicht unterstützt. Wenn die angegebene Konfiguration erforderlich ist, verwenden Sie stattdessen einen regulären "ComImport".
es: La configuración "{0}" especificada para el parámetro "{1}" no es compatible con COM generado por el origen. Si se requiere la configuración especificada, use "ComImport" en su lugar.
fr: La configuration «{0}» spécifiée pour le paramètre «{1}» n’est pas prise en charge par com généré par la source. Si la configuration spécifiée est requise, utilisez « ComImport » à la place.
it: La configurazione '{0}' specificata per il parametro '{1}' non è supportata dai COM generati dall'origine. Se la configurazione specificata è obbligatoria, usare un attributo `ComImport`.
ja: パラメーター '{1}' に指定された '{0}' 構成は、ソース生成済みの COM ではサポートされていません。指定した構成が必要な場合は、代わりに 'ComImport' を使用してください。
ko: 매개 변수 '{1}'에 대해 지정된 '{0}' 구성이 원본 생성 COM에서 지원되지 않습니다. 지정된 구성이 필요한 경우 'ComImport’를 대신 사용합니다.
pl: Określona konfiguracja „{0}” dla parametru „{1}” nie jest obsługiwana przez COM generowany przez źródło. Jeśli określona konfiguracja jest wymagana, użyj zamiast niej `ComImport`.
pt_br: Um COM gerado pela origem não dá suporte à configuração '{0}' especificada para o parâmetro '{1}'. Se a configuração especificada for necessária, use 'ComImport' em vez disso.
ru: Указанная конфигурация "{0}" для параметра "{1}" не поддерживается моделью COM генератора исходного кода. Если указанная конфигурация обязательна, используйте "ComImport".
tr: '{1}' parametresi için belirtilen '{0}' yapılandırması, kaynak tarafından oluşturulan COM tarafından desteklenmiyor. Belirtilen yapılandırma gerekiyorsa, bunun yerine "ComImport" kullanın.
zh_hans: 源生成的 COM 不支持方法“{0}”参数“{1}”配置。如果需要指定配置，请改用 `ComImport`。
zh_hant: 來源產生的 COM 不支援為參數 '{1}' 指定的 '{0}' 設定。如果需要指定的設定，請改用 `ComImport`。

# ConfigurationNotSupportedMessageParameterLibraryImport
source: The specified '{0}' configuration for parameter '{1}' is not supported by source-generated P/Invokes. If the specified configuration is required, use a regular 'DllImport' instead.
cs: Zadaná konfigurace {0} pro parametr {1} není podporována zdrojově generovanými voláními P/Invoke. Pokud je zadaná konfigurace povinná, použijte místo toho normální DllImport.
de: Die angegebene Konfiguration „{0}“ für den Parameter „{1}“ wird von quellengenerierten P/Invokes nicht unterstützt. Wenn die angegebene Konfiguration erforderlich ist, verwenden Sie stattdessen einen regulären „DllImport“.
es: La configuración de "{0}" especificada para el parámetro "{1}" no es compatible con P/Invokes de un generador de código fuente. Si se requiere la configuración especificada, use un "DllImport" normal en su lugar.
fr: La configuration '{0}' spécifiée pour le paramètre '{1}' n’est pas prise en charge par les P/Invokes générés par la source. Si la configuration spécifiée est requise, utilisez plutôt un 'DllImport' standard.
it: La configurazione '{0}' specificata per il parametro '{1}' non è supportata dai P/Invoke generati dall'origine. Se la configurazione specificata è obbligatoria, us un attributo `DllImport` normale.
ja: パラメーター '{1}' に指定された構成 '{0}' は、ソース生成 P/Invokes ではサポートされていません。指定した構成が必要な場合は、代わりに通常の 'DllImport' を使用してください。
ko: 매개 변수 '{1}'에 대해 지정된 '{0}' 구성이 소스 생성 P/Invoke에서 지원되지 않습니다. 지정된 구성이 필요한 경우 일반 'DllImport'를 대신 사용하세요.
pl: Określona konfiguracja „{0}” dla parametru „{1}” nie jest obsługiwana przez funkcję P/Invokes generowaną przez źródło. Jeśli określona konfiguracja jest wymagana, użyj zamiast tego zwykłego elementu „DllImport”.
pt_br: A configuração “{0}” especificada para o parâmetro “{1}” não tem o suporte do P/Invokes gerados pela origem. Se a configuração especificada for necessária, use um 'DllImport' regular.
ru: Указанная конфигурация "{0}" для параметра "{1}" не поддерживается P/Invokes, созданными источником. Если требуется указанная конфигурация, используйте вместо нее обычный "DllImport".
tr: '{1}' parametresi için belirtilen '{0}' yapılandırması, kaynak tarafından oluşturulan P/Invokes tarafından desteklenmiyor. Belirtilen yapılandırma gerekli ise, bunun yerine normal bir 'DllImport' kullanın.
zh_hans: 源生成的 P/Invoke 不支持参数“{1}”的指定“{0}”配置。如果需要指定配置，请改用常规的“DllImport”。
zh_hant: 來源產生的 P/Invokes 不支援為參數 '{1}' 指定的 '{0}' 設定。如果需要指定的設定，請改用一般 'DllImport'。

# ConfigurationNotSupportedMessageReturnCom
source: The specified '{0}' configuration for the return value of method '{1}' is not supported by source-generated COM. If the specified configuration is required, use `ComImport` instead.
cs: Zadaná konfigurace „{0}“ pro návratovou hodnotu metody „{1}“ není podporována modelem COM generovaným zdrojem. Pokud je zadaná konfigurace povinná, použijte místo toho ComImport.
de: Die angegebene Konfiguration "{0}" für den Rückgabewert der Methode "{1}" wird vom quellgenerierten COM nicht unterstützt. Wenn die angegebene Konfiguration erforderlich ist, verwenden Sie stattdessen einen regulären "ComImport".
es: La configuración "{0}" especificada para el valor devuelto del método "{1}" no es compatible con COM generado por origen. Si se requiere la configuración especificada, usa "ComImport" en su lugar.
fr: La configuration «{0}» spécifiée pour la valeur de retour de la méthode «{1}» n’est pas prise en charge par com généré par la source. Si la configuration spécifiée est requise, utilisez « ComImport » à la place.
it: La configurazione '{0}' specificata per il valore restituito del metodo '{1}' non è supportata dai COM generati dall'origine. Se la configurazione specificata è obbligatoria, usare un attributo `ComImport` normale.
ja: メソッド '{0}' の戻り値に指定された '{1}' 構成は、ソース生成済みの COM ではサポートされていません。指定した構成が必要な場合は、代わりに 'ComImport' を使用してください。
ko: 메서드 '{1}'의 반환 값에 대해 지정된 '{0}' 구성은 소스 생성 COM에서 지원되지 않습니다. 지정된 구성이 필요한 경우 대신 'ComImport'를 사용합니다.
pl: Określona konfiguracja „{0}” dla wartości zwracanej metody „{1}” nie jest obsługiwana przez COM generowany przez źródło. Jeśli określona konfiguracja jest wymagana, użyj zamiast niej `ComImport`.
pt_br: Um Com gerado pela origem não dá suporte à configuração “{0}” especificada para o valor retornado do método “{1}”. Se a configuração especificada for necessária, use `ComImport` em vez disso.
ru: Указанная конфигурация "{0}" для возвращаемого значения метода "{1}" не поддерживается моделью COM генератора исходного кода. Если указанная конфигурация обязательна, используйте "ComImport".
tr: '{1}' yönteminin dönüş değeri için belirtilen '{0}' yapılandırması, kaynak tarafından oluşturulan COM tarafından desteklenmiyor. Belirtilen yapılandırma gerekiyorsa, bunun yerine "ComImport" kullanın.
zh_hans: 源生成的 COM 不支持方法“{0}”返回值的指定“{1}”配置。如果需要指定配置，请改用 `ComImport`。
zh_hant: 來源產生的 COM 不支援為方法 '{1}' 的傳回值指定 '{0}' 設定。如果需要指定的設定，請改用 `ComImport`。

# ConfigurationNotSupportedMessageReturnLibraryImport
source: The specified '{0}' configuration for the return value of method '{1}' is not supported by source-generated P/Invokes. If the specified configuration is required, use a regular 'DllImport' instead.
cs: Zadaná konfigurace {0} pro návratovou hodnotu metody{1} není podporována voláními P/Invoke generovanými zdrojem. Pokud je zadaná konfigurace povinná, použijte místo toho normální DllImport.
de: Die angegebene Konfiguration „{0}“ für den Rückgabewert der Methode „{1}“ wird von quellengenerierten P/Invokes nicht unterstützt. Wenn die angegebene Konfiguration erforderlich ist, verwenden Sie stattdessen einen regulären „DllImport“.
es: La configuración de "{0}" especificada para el valor devuelto del método "{1}" no es compatible con P/Invokes generados por origen. Si se requiere la configuración especificada, use un "DllImport" normal en su lugar.
fr: La configuration '{0}' spécifiée pour la valeur de retour de la méthode '{1}' n’est pas prise en charge par les P/Invokes générés par la source. Si la configuration spécifiée est requise, utilisez plutôt un 'DllImport' standard.
it: La configurazione '{0}' specificata per il valore restituito del metodo '{1}' non è supportata dai P/Invoke generati dall'origine. Se la configurazione specificata è obbligatoria, usa un attributo `DllImport` normale.
ja: メソッド '{1}' の戻り値に指定された '{0}' 構成は、ソース生成 P/Invokes ではサポートされていません。指定した構成が必要な場合は、代わりに通常の 'DllImport' を使用してください。
ko: 메서드 '{0}'의 반환 값에 대해 지정된 '{1}' 구성은 소스 생성 P/Invoke에서 지원되지 않습니다. 지정된 구성이 필요한 경우 일반 'DllImport'를 대신 사용하세요.
pl: Określona konfiguracja „{0}” dla wartości zwracanej metody „{1}” nie jest obsługiwana przez funkcję P/Invokes generowaną przez źródło. Jeśli określona konfiguracja jest wymagana, użyj zamiast tego zwykłego elementu „DllImport”.
pt_br: A configuração “{0}” especificada para o valor retornado do método “{1}” não tem suporte para P/Invokes gerados pela origem. Se a configuração especificada for necessária, use um 'DllImport' regular.
ru: Указанная конфигурация "{0}" для возвращаемого значения метода "{1}" не поддерживается созданным источником P/Invokes. Если указанная конфигурация обязательна, используйте обычный метод "DllImport".
tr: '{0}' metodunun dönüş değeri için belirtilen '{1}' yapılandırması, kaynak tarafından oluşturulan P/Invokes tarafından desteklenmiyor. Belirtilen yapılandırma gerekli ise, bunun yerine normal bir 'DllImport' kullanın.
zh_hans: 源生成的 P/Invoke 不支持方法“{1}”返回值的指定“{0}”配置。如果需要指定配置，请改用常规的“DllImport”。
zh_hant: 來源產生的 P/Invokes 不支援為方法 '{1}' 的傳回值指定 '{0}' 設定。如果需要指定的設定，請改用一般 'DllImport'。

# ConfigurationNotSupportedMessageValueCom
source: The specified value '{0}' for '{1}' is not supported by source-generated COM. If the specified configuration is required, use `ComImport` instead.
cs: Zadaná hodnota „{0}“ pro „{1}“ není podporována modelem COM generovaným zdrojem. Pokud je zadaná konfigurace povinná, použijte místo toho ComImport.
de: Der angegebene Wert "{0}" für "{1}" wird vom quellgenerierten COM nicht unterstützt. Wenn die angegebene Konfiguration erforderlich ist, verwenden Sie stattdessen einen regulären "ComImport".
es: El valor especificado "{0}" para "{1}" no es compatible con COM generado por el origen. Si se requiere la configuración especificada, usar "ComImport" en su lugar.
fr: La valeur spécifiée «{0}» pour «{1}» n’est pas prise en charge par com généré par la source. Si la configuration spécifiée est requise, utilisez « ComImport » à la place.
it: Il valore '{0}' specificato per '{1}' non è supportato dai COM generati dall'origine. Se la configurazione specificata è obbligatoria, usare un attributo `ComImport`.
ja: '{1}' に指定された値 '{0}' は、ソース生成済みの COM ではサポートされていません。指定した構成が必要な場合は、代わりに 'ComImport' を使用してください。
ko: '{1}'에 대해 지정된 값 '{0}'은(는) 원본 생성 COM에서 지원되지 않습니다. 지정된 구성이 필요한 경우 대신 'ComImport'를 사용합니다.
pl: Określona wartość „{0}” dla „{1}” nie jest obsługiwana przez COM generowany przez źródło. Jeśli określona konfiguracja jest wymagana, użyj zamiast niej `ComImport`.
pt_br: Um COM gerado pela origem não dá suporte ao valor '{0}' especificado para '{1}'. Se a configuração especificada for necessária, use `ComImport' em vez disso.
ru: Указанное значение "{0}" для "{1}" не поддерживается моделью COM генератора исходного кода. Если указанная конфигурация обязательна, используйте "ComImport".
tr: '{1}' için belirtilen '{0}' değeri, kaynak tarafından oluşturulan COM tarafından desteklenmiyor. Belirtilen yapılandırma gerekiyorsa, bunun yerine "ComImport" kullanın.
zh_hans: 源生成的 COM 不支持为 "{1}" 指定的值 "{0}"。如果需要指定的配置，请改用 `ComImport`。
zh_hant: 來源產生的 COM 不支援為 '{1}' 指定的值 '{0}'。如果需要指定的設定，請改用 `ComImport`。

# ConfigurationNotSupportedMessageValueLibraryImport
source: The specified value '{0}' for '{1}' is not supported by source-generated P/Invokes. If the specified value is required, use a regular 'DllImport' instead.
cs: Zadaná hodnota {0} pro {1} není podporována zdrojově generovanými voláními P/Invoke. Pokud je zadaná hodnota povinná, použijte místo toho normální DllImport.
de: Der angegebene Wert „{0}“ für „{1}“ wird von quellengenerierten P/Invokes nicht unterstützt. Wenn der angegebene Wert erforderlich ist, verwenden Sie stattdessen einen regulären „DllImport“.
es: El valor especificado de "{0}" para "{1}" no es compatible con P/Invokes de un generador de código fuente. Si se requiere el valor especificado, use un "DllImport" normal en su lugar.
fr: La valeur spécifiée '{0}' pour '{1}' n’est pas prise en charge par les P/Invokes générés par la source. Si la valeur spécifiée est requise, utilisez un 'DllImport' standard à la place.
it: Il valore specificato '{0}' per '{1}' non è supportato da P/Invoke generati dall'origine. Se il valore specificato è obbligatorio, usa un 'DllImport' normale.
ja: '{1}' に指定された値 '{0}' は、ソース生成 P/Invokes ではサポートされていません。指定した値が必要な場合は、代わりに通常の 'DllImport' を使用してください。
ko: '{1}'에 대해 지정된 값 '{0}'은(는) 소스 생성 P/Invoke에서 지원되지 않습니다. 지정된 값이 필요한 경우 일반 ‘DllImport’를 대신 사용하세요.
pl: Określona wartość „{0}” dla parametru „{1}” nie jest obsługiwana przez funkcję P/Invokes generowaną przez źródło. Jeśli określona konfiguracja jest wymagana, użyj zamiast tego zwykłego elementu „DllImport”.
pt_br: O valor “{0}” especificado para “{1}” não tem suporte do P/Invokes gerados pela origem. Se o valor especificado for necessário, use um 'DllImport' regular.
ru: Указанное значение "{0}" для "{1}" не поддерживается P/Invokes, сгенерированными источником. Если требуется указанное значение, используйте вместо него обычный "DllImport".
tr: '{1}' için belirtilen '{0}' değeri, kaynak tarafından oluşturulan P/Invokes tarafından desteklenmiyor. Belirtilen değer gerekli ise, bunun yerine normal bir 'DllImport' kullanın.
zh_hans: 源生成的 P/Invoke 不支持“{1}”的指定值“{0}”。如果需要指定值，请改用常规的“DllImport”。
zh_hant: 來源產生的 P/Invokes 不支援為 '{1}' 指定的值 '{0}'。如果需要指定的設定，請改用一般 'DllImport'。

# ConfigurationNotSupportedTitleCom
source: Specified configuration is not supported by source-generated COM.
cs: Zadaná konfigurace není podporována modelem COM generovaným zdrojem.
de: Die angegebene Konfiguration wird vom quellgenerierten COM nicht unterstützt.
es: COM generado por origen no admite la configuración especificada.
fr: La configuration spécifiée n’est pas prise en charge par com généré par la source.
it: La configurazione specificata non è supportata dai COM generati dall'origine.
ja: 指定された構成は、ソース生成済みの COM ではサポートされていません。
ko: 지정된 구성은 원본 생성 COM에서 지원되지 않습니다.
pl: Określona konfiguracja nie jest obsługiwana przez COM wygenerowany przez źródło.
pt_br: Um COM gerado pela origem não dá suporte a uma configuração especificada.
ru: Указанная конфигурация не поддерживается моделью COM генератора исходного кода.
tr: Belirtilen yapılandırma, kaynak tarafından oluşturulan COM tarafından desteklenmiyor.
zh_hans: 源生成的 COM 不支持指定的配置。
zh_hant: 来源產生的 COM 不支援指定的設定。

# ConfigurationNotSupportedTitleLibraryImport
source: Specified configuration is not supported by source-generated P/Invokes.
cs: Určenou konfiguraci nepodporují zdrojem generovaná volání P/Invokes.
de: Die angegebene Konfiguration wird von quellgenerierten P/Invokes nicht unterstützt.
es: La configuración especificada no está admitida por P/Invokes de un generador de código fuente.
fr: La configuration spécifiée n’est pas prise en charge par les P/Invokes générés par la source.
it: La configurazione specificata non è supportata dai P/Invoke generati dall'origine.
ja: 指定された構成は、ソースで生成された P/Invoke ではサポートされていません。
ko: 지정된 구성은 소스 생성 P/Invoke에서 지원되지 않습니다.
pl: Określona konfiguracja nie jest obsługiwana przez funkcję P/Invokes generowaną przez źródło.
pt_br: A configuração especificada não tem suporte de P/Invokes gerados pela origem.
ru: Указанная конфигурация не поддерживается в P/Invoke с созданием источника.
tr: Belirtilen yapılandırma, kaynak tarafından oluşturulan P/Invokes tarafından desteklenmiyor.
zh_hans: 源生成的 P/Invoke 不支持指定的配置。
zh_hant: 来源產生的 P/Invokes 不支援指定的設定。
