Repository: dotnet/runtime
Catalog: src/libraries/System.Runtime.InteropServices/gen/Common/Resources/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# FirstParameterMustMatchReturnTypeMessage
source: The first parameter of '{0}' must be the same type as the return type of '{1}'
cs: První parametr {0} musí být stejného typu jako návratový typ {1}
de: Der erste Parameter von „{0}“ muss den gleichen Typ aufweisen wie der Rückgabetyp von „{1}“
es: El primer parámetro de "{0}" debe ser del mismo tipo que el tipo de valor devuelto de "{1}"
fr: Le premier paramètre de '{0}' doit être du même type que le type de retour de '{1}'
it: Il primo parametro di '{0}' deve essere dello stesso tipo restituito di '{1}'
ja: '{0}' の最初のパラメーターは、戻り値の型 '{1}' と同じ型である必要があります
ko: '{0}'의 첫 번째 매개 변수는 '{1}'의 반환 형식과 동일해야 합니다.
pl: Pierwszy parametr „{0}” musi być tego samego typu co zwracany typ „{1}”
pt_br: O primeiro parâmetro de “{0}” deve ser do mesmo tipo que o tipo de retorno “{1}”
ru: Первый параметр "{0}" должен иметь тот же тип, что и тип возвращаемого значения "{1}"
tr: '{0}' öğesinin ilk parametresi, '{1}' dönüş türüyle aynı olmalıdır
zh_hans: “{0}”的第一个参数必须与“{1}”的返回类型为相同的类型
zh_hant: '{0}' 的第一個參數必須與 '{1}' 的傳回類型相同

# FirstParametersMustMatchDescription
source: The first parameters of the two methods must be the same type.
cs: První parametry těchto dvou metod musí být stejného typu.
de: Die ersten Parameter der beiden Methoden müssen vom gleichen Typ sein.
es: Los primeros parámetros de los dos métodos deben ser del mismo tipo.
fr: Les premiers paramètres des deux méthodes doivent être du même type.
it: I primi parametri dei due metodi devono essere dello stesso tipo.
ja: 2 つのメソッドの最初のパラメーターは同じ型である必要があります。
ko: 두 메서드의 첫 번째 매개 변수는 동일한 형식이어야 합니다.
pl: Pierwsze parametry obu tych metod muszą być tego samego typu.
pt_br: Os primeiros parâmetros dos dois métodos devem ser do mesmo tipo.
ru: Первые параметры двух методов должны быть одного типа.
tr: İki yöntemin ilk parametreleri aynı türde olmalıdır.
zh_hans: 这两种方法的第一个参数必须为相同的类型。
zh_hant: 兩種方法的第一個參數必須是相同的類型。

# FirstParametersMustMatchMessage
source: The first parameter of '{0}' and '{1}' must be the same type
cs: První parametr {0} a {1} musí být stejného typu.
de: Die ersten Parameter von „{0}“ und von „{1}“ müssen vom gleichen Typ sein
es: El primer parámetro de "{0}" y "{1}" deben ser del mismo tipo
fr: Le premier paramètre de '{0}' et '{1}' doit être du même type
it: Il primo parametro di '{0}' e '{1}' deve essere dello stesso tipo
ja: '{0}' の最初のパラメーターと '{1}' は同じ型である必要があります
ko: '{0}' 및 '{1}'의 첫 번째 매개 변수는 동일한 형식이어야 합니다.
pl: Pierwszy parametr „{0}” i „{1}” musi być tego samego typu
pt_br: O primeiro parâmetro de “{0}” e “{1}” deve ser do mesmo tipo
ru: Первый параметр "{0}" и "{1}" должны быть одного типа
tr: '{0}' ve '{1}' öğelerinin ilk parametresi aynı türde olmalıdır
zh_hans: “{0}”和“{1}”的第一个参数必须为相同的类型
zh_hant: '{0}' 與 '{1}' 的第一個參數必須是相同的類型

# FromUnmanagedOverloadsNotSupportedDescription
source: Overloading the 'FromUnmanaged' method is unuspported as some shapes are unable to distinguish between overloads.
cs: Přetížení metody FromUnmanaged není podporováno, protože některé obrazce nedokážou rozlišit mezi přetíženími.
de: Das Überladen der Methode "FromUnmanaged" ist nicht zulässig, weil einige Formen nicht zwischen Überladungen unterscheiden können.
es: No se puede sobrecargar el método "FromUnmanaged" porque algunas formas no pueden distinguir entre sobrecargas.
fr: La surcharge de la méthode « FromUnmanaged » n’est pas prise en charge, car certaines formes ne peuvent pas faire la distinction entre les surcharges.
it: L'overload del metodo 'FromUnmanaged' non è supportato perché alcune forme non sono in grado di distinguere tra overload.
ja: いくつかの図形がオーバーロードを区別できないため、'FromUnmanaged' メソッドのオーバーロードはサポートされていません。
ko: 일부 셰이프는 오버로드를 구분할 수 없으므로 'FromUnmanaged' 메서드 오버로딩은 지원되지 않습니다.
pl: Przeciążenie metody „FromUnmanaged” nie jest obsługiwane, ponieważ niektóre kształty nie mogą rozróżnić przeciążeń.
pt_br: A sobrecarga do método 'FromUnmanaged' não é suportada, pois algumas formas não conseguem distinguir entre sobrecargas.
ru: Перегрузка метода FromUnmanaged не поддерживается, поскольку некоторые фигуры не могут различать перегрузки.
tr: Bazı şekiller aşırı yüklemeler arasında ayrım yapamadığından, 'FromUnmanaged' yönteminin aşırı yüklemesi desteklenmez.
zh_hans: 不支持重载“FromUnmanaged”方法，因为某些形状无法区分重载。
zh_hant: 不支援多載 'FromUnmanaged' 方法，因為某些圖形無法區分多載。

# FromUnmanagedOverloadsNotSupportedMessage
source: The type '{0}' overloads the 'FromUnmanaged' method, which is not supported in custom marshallers
cs: Typ {0} přetíží metodu FromUnmanaged, která se ve vlastních zařazováních nepodporuje.
de: Der Typ „{0}“ überlädt die „FromUnmanaged“-Methode, die in benutzerdefinierten Marshallern nicht unterstützt wird.
es: El tipo '{0}' sobrecarga el método 'FromUnmanaged', que no se admite en serializadores personalizados.
fr: Le type '{0}' surcharge la méthode 'FromUnmanaged', qui n’est pas prise en charge dans les marshaleurs personnalisés
it: Il tipo '{0}' esegue l'overload del metodo 'FromUnmanaged', che non è supportato nei marshaller personalizzati
ja: 型 '{0}' は、カスタム マーシャラーでサポートされていない 'FromUnmanaged' メソッドをオーバーロードします
ko: 형식 '{0}'은(는) 사용자 지정 마샬러에서 지원되지 않는 'FromUnmanaged' 메서드를 오버로드합니다.
pl: Typ „{0}” przeciąża metodę „ZNiezarządzane”, która nie jest obsługiwana w niestandardowych marshalerach
pt_br: O tipo '{0}' sobrecarrega o método 'FromUnmanaged', que não tem suporte em marshallers personalizados
ru: Тип "{0}" перегружает метод FromUnmanaged, не поддерживаемый в настраиваемых маршалерах.
tr: '{0}' türü, özel hazırlayıcılarda desteklenmeyen 'FromUnmanaged' metoduna aşırı yükleme yapıyor
zh_hans: 类型“{0}”重载 “FromUnmanaged” 方法，这在自定义封送程序中不受支持
zh_hant: 自訂封送處理器中不支援類型 '{0}' 多載 'FromUnmanaged' 方法

# GeneratedComInterfaceStringMarshallingMustMatchBase
source: The configuration of 'StringMarshalling' and 'StringMarshallingCustomType' must match the base COM interface.
cs: Konfigurace „StringMarshalling“ a „StringMarshallingCustomType“ se musí shodovat se základním rozhraním COM.
de: Die Konfiguration von "StringMarshalling" und "StringMarshallingCustomType" muss mit der COM-Basisschnittstelle übereinstimmen.
es: La configuración de "StringMarshalling" y "StringMarshallingCustomType" debe coincidir con la interfaz COM base.
fr: La configuration de « StringMarshalling » et de « StringMarshallingCustomType » doit correspondre à l’interface COM de base.
it: La configurazione di 'StringMarshalling' e 'StringMarshallingCustomType' deve corrispondere all'interfaccia COM di base.
ja: 'StringMarshalling' および 'StringMarshallingCustomType' の構成は、ベース COM インターフェイスと一致する必要があります。
ko: 'StringMarshalling' 및 'StringMarshallingCustomType'의 구성은 기본 COM 인터페이스와 일치해야 합니다.
pl: Konfiguracja elementów „StringMarssourceing” i „StringMarsxtingCustomType” musi być zgodna z podstawowym interfejsem COM.
pt_br: A configuração de 'StringMarshalling' e 'StringMarshallingCustomType' deve corresponder à interface COM base.
ru: Конфигурация "StringMarshalling" и "StringMarshallingCustomType" должна соответствовать базовому COM-интерфейсу.
tr: 'StringMarshalling' ve 'StringMarshallingCustomType' yapılandırması temel COM arabirimiyle eşleşmelidir.
zh_hans: "StringMarshalling" 和 "StringMarshallingCustomType" 的配置必须与基本 COM 接口匹配。
zh_hant: 'StringMarshalling' 和 'StringMarshallingCustomType' 的設定必須和基底 COM 介面相符。

# GenericEntryPointMarshallerTypeMustBeClosedOrMatchArityDescription
source: The marshaller type must be a closed generic or have the same number of generic parameters as the managed type so the emitted code can use a specific instantiation.
cs: Zařazovací typ musí být uzavřený obecný typ nebo mít stejný počet obecných parametrů jako spravovaný typ, aby mohl vygenerovaný kód použít konkrétní vytvoření instance.
de: Der Marshaller-Typ muss ein geschlossener generischer Typ sein oder dieselbe Anzahl generischer Parameter wie der verwaltete Typ aufweisen, damit der ausgegebene Code eine bestimmte Instanziierung verwenden kann.
es: El tipo serializador debe ser un genérico cerrado o tener el mismo número de parámetros genéricos que el tipo administrado para que el código emitido pueda usar una creación de instancia específica.
fr: Le type marshaler doit être un générique fermé ou avoir le même nombre de paramètres génériques que le type managé pour que le code émis puisse utiliser une instanciation spécifique.
it: Il tipo di marshaller deve essere un generico chiuso o avere lo stesso numero di parametri generici del tipo gestito, in modo che il codice generato possa usare una creazione di istanza specifica.
ja: マーシャラー型は、クローズ ジェネリックであるか、マネージド型と同じ数のジェネリック パラメーターを持つ必要があります。これにより、生成されたコードが特定のインスタンス化を使用できるようになります。
ko: 마샬러 형식은 닫힌 제네릭이거나 관리되는 형식과 동일한 수의 제네릭 매개 변수가 있어야 내보낸 코드에서 특정 인스턴스화를 사용할 수 있습니다.
pl: Typ marshallera musi być zamkniętym typem ogólnym lub mieć taką samą liczbę parametrów ogólnych jak typ zarządzany, aby emitowany kod mógł używać określonego wystąpienia.
pt_br: O tipo de empacotador deve ser um genérico fechado ou ter o mesmo número de parâmetros genéricos que o tipo gerenciado para que o código emitido possa usar uma instanciação específica.
ru: Тип маршалера должен быть закрытым универсальным или иметь то же количество универсальных параметров, что и управляемый тип, чтобы создаваемый код мог использовать конкретный экземпляр.
tr: Hazırlayıcı türü kapalı bir genel tür olmalıdır veya gösterilen kodun belirli bir örnek oluşturma kullanabilmesi için yönetilen türle aynı sayıda genel parametreye sahip olmalıdır.
zh_hans: 封送处理程序类型必须是封闭泛型或具有与托管类型相同数目的泛型参数，以便发出的代码可以使用特定实例化。
zh_hant: 封送處理器類型必須是封閉式泛型或具有與受控類型相同的泛型參數數目，因此發出的程式碼可以使用特定的具現化。

# GenericEntryPointMarshallerTypeMustBeClosedOrMatchArityMessage
source: The marshaller type '{0}' for managed type '{1}' must be a closed generic type, have the same arity as the managed type if it is a value marshaller, or have one additional generic parameter if it is a collection marshaller.
cs: Zařazovací typ {0} pro spravovaný typ {1} musí být uzavřený obecný typ, mít stejnou aritu jako spravovaný typ, pokud se jedná o zařazování hodnot, nebo mít jeden další obecný parametr, pokud se jedná o zařazování kolekcí.
de: Der Marshallertyp '{0}' für den verwalteten Typ '{1}' muss ein geschlossener generischer Typ sein, dieselbe Stelligkeit wie der verwaltete Typ aufweisen, wenn es sich um einen Wertmarshaller handelt, oder einen zusätzlichen generischen Parameter aufweisen, wenn es sich um einen Auflistungsmarshaller handelt.
es: El tipo de serializador "{0}" para el tipo administrado "{1}" debe ser un tipo genérico cerrado, tener la misma aridad que el tipo administrado si es un serializador de valores o tener un parámetro genérico adicional si es un serializador de colección.
fr: Le type de marshaleur « {0} » pour le type managé « {1} » doit être un type générique fermé, avoir la même arité que le type managé s’il s’agit d’un marshaleur de valeurs ou avoir un paramètre générique supplémentaire s’il s’agit d’un marshaleur de collection.
it: Il tipo di marshaller '{0}' per il tipo gestito '{1}' deve essere un tipo generico chiuso, avere lo stesso grado del tipo gestito se si tratta di un marshaller di valori o avere un parametro generico aggiuntivo se si tratta di un marshaller di raccolta.
ja: マネージド型 '{1}' のマーシャラー型 '{0}' は、クローズ ジェネリック型であるか、値マーシャラーの場合はマネージ型と同じアリティを持つ、またはコレクション マーシャラーの場合は追加のジェネリック パラメーターを 1 つ指定する必要があります。
ko: 관리 유형 '{1}'에 대한 마샬러 유형 '{0}'은(는) 닫힌 제네릭 유형이어야 하고, 값 마샬러인 경우 관리 유형과 동일한 우선순위를 가져야 하며, 컬렉션 마샬러인 경우 하나의 추가 제네릭 매개 변수가 있어야 합니다.
pl: Typ marshallera „{0}” dla typu zarządzanego „{1}” musi być zamkniętym typem ogólnym, mieć taką samą argumentację jak typ zarządzany, jeśli jest to marshaller wartości lub mieć jeden dodatkowy parametr ogólny, jeśli jest to marshaller kolekcji.
pt_br: O tipo de empacotador '{0}' para tipo gerenciado '{1}' deve ser um tipo genérico fechado, ter a mesma aridade que o tipo gerenciado se for um empacotador de valor ou ter um parâmetro genérico adicional se for um empacotador de coleção.
ru: Управляемый тип "{0}" для управляемого типа "{1}" должен быть закрытым универсальным типом, его арность должна быть такой же, как у управляемого типа, если это маршалер значений, либо у него должен быть один дополнительный универсальный параметр, если это маршалер коллекций.
tr: Yönetilen türü '{1}' için hazırlayıcı türü '{0}', kapalı bir genel tür olmalı, bir değer hazırlayıcı olması durumunda yönetilen türle aynı parametreye sahip olmalı, koleksiyon hazırlayıcı olması durumunda ise ek genel parametreye sahip olmalıdır.
zh_hans: 适用于托管类型“{1}”的封送处理程序类型“{0}”必须是封闭式泛型类型，如果托管类型是值封送处理程序，则该类型必须与托管类型具有相同的 arity；如果托管类型是集合封送处理程序，则它多具有一个泛型参数。
zh_hant: 受控類型 '{1}' 的封送處理器類型 '{0}' 必須是封閉的泛型類型、如果是值封送處理器，則其 arity 必須與受控類型相同，如果是集合封送處理器，則必須有另一個泛型參數。

# GetPinnableReferenceReturnTypeBlittableDescription
source: The return type of 'GetPinnableReference' (after accounting for 'ref') must be blittable.
cs: Návratový typ GetPinnableReference (když se vezme v úvahu „ref“) musí být přenositelný.
de: Der Rückgabetyp von \"GetPinnableReference\" (nach Berücksichtigung von \"ref\") muss geeignet für Blitting sein.
es: El tipo de valor devuelto de “GetPinnableReference” (tras pasar por “ref”) debe poder transferirse en bloques de bits.
fr: Le type de retour de « GetPinnableReference » (après la gestion des comptes pour « ref ») doit être blittable.
it: Il tipo restituito di 'GetPinnableReference' (dopo l'accounting di 'ref') deve essere copiabile da BLT.
ja: 'GetPinnableReference' の戻り値の型 ('ref' の会計後) は blittable である必要があります。
ko: 'GetPinnableReference'의 반환 형식('ref'를 고려한 후)은 blittable이어야 합니다.
pl: Zwracany typ elementu „GetPinnableReference” (po uwzględnieniu wartości „ref”) musi być kopiowalny.
pt_br: O tipo de retorno de 'GetPinnableReference' (após a contabilização de 'ref') deve ser blittable.
ru: Тип возвращаемого значения \"GetPinnableReference\" (после учета \"ref\") должен быть непреобразуемым.
tr: 'GetPinnableReference' dönüş türü ('ref' olarak belirtildikten sonra) blok halinde kopyalanabilir olmalıdır.
zh_hans: “GetPinnableReference” 的返回类型(考虑到 “ref” 之后)必须是 blittable 的。
zh_hant: ('ref' 帳戶處理後的) 'GetPinnableReference' 傳回類型必須是 blittable。

# GetPinnableReferenceReturnTypeBlittableMessage
source: The dereferenced type of the return type of the 'GetPinnableReference' method must be blittable
cs: Odkazovaný typ návratového typu GetPinnableReference musí být přenositelný
de: Der dereferenzierte Typ des Rückgabetyps der GetPinnableReference-Methode muss geeignet für Blitting sein.
es: El tipo desreferenciado del tipo de valor devuelto del método “GetPinnableReference” debe poder transferirse en bloques de bits
fr: Le type déréférencé du type de retour de la méthode GetPinnableReference doit être blittable
it: Il tipo dereferenziato del tipo restituito del metodo 'GetPinnableReference' deve essere copiabile da BLT
ja: 'GetPinnableReference' メソッドの戻り値の逆参照型は blittable である必要があります
ko: 'GetPinnableReference' 메서드 반환 형식의 역참조 형식은 blittable이어야 합니다.
pl: Typ, do którego nie można usunąć odwołania, zwracanego typu metody „GetPinnableReference” musi być kopiowalny
pt_br: O tipo desreferenciado do tipo de retorno do método 'GetPinnableReference' deve ser blittable
ru: Разыменованный тип возвращаемого типа метода \"GetPinnableReference\" должен быть непреобразуемым
tr: 'GetPinnableReference' metodunun dönüş türünün başvurulan türü blok halinde kopyalanabilir olmalıdır
zh_hans: “GetPinnableReference” 方法的返回类型的取消引用类型必须是 blittable
zh_hant: 'GetPinnableReference' 方法傳回類型的解除参照類型必須是 blittable

# GraphHasCycles
source: The provided graph has cycles and cannot be topologically sorted.
cs: Poskytnutý graf obsahuje cykly a nelze ho řadit topologicky.
de: Das bereitgestellte Diagramm weist Zyklen auf und kann nicht topologisch sortiert werden.
es: El gráfico porporcionado tiene ciclos y no se puede ordenar topológicamente.
fr: Le graphique fourni a des cycles et ne peut pas être trié topologiement.
it: Il grafico specificato contiene cicli e non può essere ordinato in modo topologico.
ja: 指定されたグラフにはサイクルがあるため、位相的に並べ替えることはできません。
ko: 제공된 그래프에는 주기가 있으며 토폴로지로 정렬할 수 없습니다.
pl: Podany wykres zawiera cykle i nie można go posortować topologicznie.
pt_br: O grafo fornecido tem ciclos e não pode ser classificado topologicamente.
ru: Указанный граф содержит циклы, и его невозможно топологически отсортировать.
tr: Sağlanan grafikte döngüler var ve bu grafik topolojik olarak sıralanamıyor.
zh_hans: 提供的图形具有循环，并且无法按拓扑顺序排序。
zh_hant: 提供的圖表有週期，無法以拓撲排序。

# HResultTypeWillBeTreatedAsStructMessage
source: The type '{0}' will be treated as a struct in the native signature, not as a native HRESULT. To treat this as an HRESULT, add '[return:MarshalAs(UnmanagedType.Error)]' to the method.
cs: Typ {0} bude v nativním podpisu považován za strukturu, nikoli za nativní HRESULT. Pokud jej chcete považovat za HRESULT, přidejte do metody [return:MarshalAs(UnmanagedType.Error)].
de: Der Typ '{0}' wird als Struktur in der nativen Signatur und nicht als natives HRESULT behandelt. Um ihn als HRESULT zu behandeln, fügen Sie der Methode "[return:MarshalAs(UnmanagedType.Error)]" hinzu.
es: El tipo '{0}' se tratará como un struct en la firma nativa, no como un HRESULT nativo. Para tratarlo como un HRESULT, añade '[return:MarshalAs(UnmanagedType.Error)]' al método.
fr: Le type « {0} » sera traité en tant que struct dans la signature native, et non en tant que HRESULT natif. Pour le traiter en tant que HRESULT, ajoutez « [return:MarshalAs(UnmanagedType.Error)] » à la méthode.
it: Il tipo '{0}' verrà considerato come uno struct nella firma nativa, non come HRESULT nativo. Per considerare questo valore come HRESULT, aggiungere '[return:MarshalAs(UnmanagedType.Error)]' al metodo.
ja: 型 '{0}' は、ネイティブ HRESULT としてではなく、ネイティブ シグネチャ内の構造体として扱われます。これを HRESULT として扱うには、'[return:MarshalAs(UnmanagedType.Error)]' をメソッドに追加します。
ko: '{0}' 형식은 네이티브 HRESULT가 아니라 네이티브 서명에서 구조체로 처리됩니다. HRESULT로 처리하려면 메서드에 '[return:MarshalAs(UnmanagedType.Error)]'를 추가하세요.
pl: Typ „{0}” będzie traktowany jako struktura w podpisie natywnym, a nie jako natywny wynik HRESULT. Aby traktować to jako HRESULT, dodaj element „[return:MarshalAs(UnmanagedType.Error)]” do metody.
pt_br: O tipo '{0}' será tratado como uma estrutura na assinatura nativa, não como um HRESULT nativo. Para tratar isso como um HRESULT, adicione '[return:MarshalAs(UnmanagedType.Error)]' ao método.
ru: Тип "{0}" будет рассматриваться как структура в собственной подписи, а не как собственный HRESULT. Чтобы обработать это как HRESULT, добавьте в метод "[return:MarshalAs(UnmanagedType.Error)]".
tr: '{0}' türü, yerel HRESULT olarak değil, yerel imzada bir yapı olarak değerlendirilir. Bunu bir HRESULT olarak değerlendirmek için yönteme '[return:MarshalAs(UnmanagedType.Error)]' ekleyin.
zh_hans: 类型“{0}”将被视为本机签名中的结构，而不是本机 HRESULT。若要将其视为 HRESULT，请将“[return:MarshalAs(UnmanagedType.Error)]”添加到方法。
zh_hant: 類型 '{0}' 會被視為原生簽章中的結構，而非原生 HRESULT。若要將此視為 HRESULT，請將 '[return:MarshalAs(UnmanagedType.Error)]' 新增至方法。

# HResultTypeWillBeTreatedAsStructTitle
source: This type will be treated as a struct in the native signature, not as a native HRESULT
cs: Tento typ bude v nativním podpisu považován za strukturu, nikoli za nativní HRESULT.
de: Dieser Typ wird als Struktur in der nativen Signatur und nicht als natives HRESULT behandelt
es: Este tipo se tratará como una estructura en la firma nativa, no como un HRESULT nativo.
fr: Ce type sera traité en tant que struct dans la signature native, et non en tant que HRESULT natif
it: Questo tipo verrà considerato come uno struct nella firma nativa, non come HRESULT nativo
ja: この型はネイティブの HRESULT ではなく、ネイティブ シグネチャの構造体として扱われます
ko: 이 형식은 네이티브 HRESULT가 아니라 네이티브 서명의 구조체로 처리됩니다.
pl: Ten typ będzie traktowany jako struktura w podpisie natywnym, a nie jako natywny wynik HRESULT
pt_br: Este tipo será tratado como uma estrutura na assinatura nativa, não como um HRESULT nativo
ru: Этот тип будет рассматриваться как структура в собственной подписи, а не как собственный HRESULT.
tr: Bu tür, yerel HRESULT olarak değil, yerel imzada bir yapı olarak değerlendirilir
zh_hans: 此类型将被视为本机签名中的结构，而不是本机 HRESULT
zh_hant: 此類型會被視為原生簽章中的結構，而非原生 HRESULT

# InAttributeNotSupportedOnByValueParameters
source: The '[In]' attribute is only supported on array parameters. By-value parameters are considered read-only by default.
cs: Atribut „[In]“ se podporuje pouze u parametrů pole. Parametry podle hodnoty jsou ve výchozím nastavení považovány za parametry jen pro čtení.
de: Das [In]-Attribut wird nur für Arrayparameter unterstützt. Wertbezogene Parameter werden standardmäßig als schreibgeschützt betrachtet.
es: El atributo "[In]" solo se admite en parámetros de matriz. Los parámetros por valor se consideran de solo lectura de forma predeterminada.
fr: L'attribut '[In]' n'est pris en charge que sur les paramètres de tableau. Les paramètres par valeur sont considérés comme en lecture seule par défaut.
it: L'attributo '[In]' è supportato solo sui parametri di matrice. I parametri per valore sono considerati di sola lettura per impostazione predefinita.
ja: '[In]' 属性は配列パラメーターでのみサポートされています。既定では、値によるパラメーターは読み取り専用と見なされます。
ko: '[In]' 특성은 배열 매개 변수에서만 지원됩니다. 값별 매개 변수는 기본적으로 읽기 전용으로 간주됩니다.
pl: Atrybut „[In]” jest obsługiwany tylko w przypadku parametrów tablicy. Parametry według wartości są domyślnie uznawane za tylko do odczytu.
pt_br: O '[In]' atributo só tem suporte nos parâmetros de matriz. Parâmetros por valor são considerados somente leitura por padrão.
ru: Атрибут "[In]" поддерживается только для параметров массива. Параметры по значению по умолчанию считаются доступными только для чтения.
tr: '[In]' özniteliği yalnızca dizi parametrelerinde desteklenir. Değere göre parametreleri, varsayılan olarak salt okunur kabul edilir.
zh_hans: “[In]”特性仅在数组参数上受支持。默认情况下，按值参数视为只读。
zh_hant: 只有在陣列參數上才支援 '[In]' 屬性。預設會將 By-value 參數視為唯讀。

# InAttributeNotSupportedWithoutOutBlittableArray
source: The '[In]' attribute is not supported unless the '[Out]' attribute is also used. Blittable arrays cannot be marshalled as '[In]' only.
cs: Atribut [In] není podporován, pokud není použit také atribut [Out]. Blittable arrays nelze zařadit pouze jako [In].
de: Das [In]-Attribut wird nur unterstützt, wenn auch das [Out]-Attribut verwendet wird. Blittable-Arrays können nicht nur als "[In]" gemarshallt werden.
es: El atributo '[In]' no se admite a menos que también se use el atributo '[Out]'. Las matrices que se pueden transferir en bloque de bits no se pueden serializar solo como '[In]'.
fr: L’attribut '[In]' n’est pas pris en charge, sauf si l’attribut '[Out]' est également utilisé. Les tableaux blittables ne peuvent pas être marshalés en tant que « [In] » uniquement.
it: L'attributo '[In]' non è supportato a meno che non venga usato anche l'attributo '[Out]'. Le matrici copiabili da BLT non possono essere sottoposte a marshalling solo come '[In]'.
ja: '[In]'属性は、'[Out]'属性も使用しない限りサポートされません。Blittable 配列は、'[In]'としてのみマーシャリングできません。
ko: '[Out]' 특성도 사용되지 않는 한 '[In]' 특성은 지원되지 않습니다. Blittable 배열은 '[In]'으로만 마샬링할 수 없습니다.
pl: Atrybut „[In]” nie jest obsługiwany, chyba że używany jest również atrybut „[Out]”. Tablice kopiowalne nie mogą być kierowane tylko jako „[In]”.
pt_br: O atributo '[In]' não é suportado, a menos que o atributo '[Out]' também seja usado. Matrizes Blittable não podem ser empacotadas apenas como '[In]'.
ru: Атрибут "[In]" не поддерживается, если также не используется атрибут "[Out]". Преобразуемые массивы нельзя сортировать только как "[In]".
tr: '[Out]' özniteliği de kullanılmadığı sürece '[In]' özniteliği desteklenmez. Blittable dizileri yalnızca '[In]' olarak hazırlanamaz.
zh_hans: 不支持“[In]”属性，除非也使用“[Out]”属性。不能仅将 Blittable 数组封送为“[In]”。
zh_hant: 除非也使用 '[Out]' 屬性，否則不支援 '[In]' 屬性。無法只將 Blittable 陣列整理為 '[In]'。
