Repository: dotnet/runtime
Catalog: src/libraries/System.Runtime.InteropServices/gen/Common/Resources/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# InvalidAttributedMethodContainingTypeMissingModifiersMessageLibraryImport
source: Method '{0}' is contained in a type '{1}' that is not marked 'partial'. P/Invoke source generation will ignore method '{0}'.
cs: Metoda {0} je obsažena v typu {1}, který není označen jako „partial“. Generování zdrojů volání P/Invoke bude metodu {0} ignorovat.
de: Die Methode \"{0}\" ist in einem Typ \"{1}\" enthalten, der nicht als \"partiell\" gekennzeichnet ist. Die P/Invoke-Quellgenerierung ignoriert die Methode \"{0}\".
es: El método “{0}” está contenido en un tipo “{1}” que no está marcado como “partial”. La generación de código fuente P/Invoke omitirá el método “{0}”.
fr: La méthode « {0} » est contenue dans un type « {1} » qui n’est pas marqué comme étant « partial ». La génération source P/Invoke ignore la méthode « {0} ».
it: Il metodo '{0}' è contenuto in un tipo '{1}' non contrassegnato come 'partial'. Durante la generazione dell'origine P/Invoke il metodo '{0}' verrà ignorato.
ja: メソッド '{0}' は、'partial' とマークされていない型 '{1}' に含まれています。P/Invoke ソース生成はメソッド '{0}' を無視します。
ko: 메서드 '{0}'은(는) 'partial'로 표시되지 않은 '{1}' 형식에 포함되어 있습니다. P/Invoke 소스 생성은 '{0}' 메서드를 무시합니다.
pl: Metoda „{0}” jest zawarta w typie „{1}”, który nie jest oznaczony jako „częściowy”. Generowanie źródła funkcji P/Invoke zignoruje metodę „{0}”.
pt_br: O '{0}' está contido em um tipo '{1}' que não está marcado como 'partial'. A geração de origem P/Invoke ignorará o método '{0}'.
ru: Метод \"{0}\" содержится в типе \"{1}\", который не помечен как \"partial\". Метод \"{0}\" будет игнорироваться при создании источника в P/Invoke.
tr: '{0}'metodu, 'partial' olarak işaretlenmemiş olan bir '{1}' türünün içinde yer alıyor. P/Invoke kaynak oluşturma işlemi, '{0}' metodunu yok sayacak.
zh_hans: 方法“{0}”包含在未标记为 “partial” 的类型“{1}”中。P/Invoke 源生成将忽略方法“{0}”。
zh_hant: 方法 '{0}' 包含在未標示為 'partial' 的類型'{1}'中。產生 P/Invoke 来源會忽略方法'{0}'。

source: Containing type of method with VirtualMethodIndexAttribute does not have a UnmanagedObjectUnwrapperAttribute.
cs: Obsahující typ metody s atributem VirtualMethodIndexAttribute nemá UnmanagedObjectUnwrapperAttribute.
de: Der Typ der Methode mit VirtualMethodIndexAttribute enthält kein UnmanagedObjectUnwrapperAttribute.
es: El tipo de método contenedor con VirtualMethodIndexAttribute no tiene un UnmanagedObjectUnwrapperAttribute.
fr: Le type conteneur de méthode avec VirtualMethodIndexAttribute n’a pas de UnmanagedObjectUnwrapperAttribute.
it: Il tipo contenitore del metodo con VirtualMethodIndexAttribute non contiene un oggetto UnmanagedObjectUnwrapperAttribute.
ja: VirtualMethodIndexAttribute を持つ包含型のメソッドに UnmanagedObjectUnwrapperAttribute がありません。
ko: VirtualMethodIndexAttribute를 사용하는 메서드 포함 형식에 UnmanagedObjectUnwrapperAttribute가 없습니다.
pl: Zawieranie typu metody z atrybutem VirtualMethodIndexAttribute nie ma atrybutu UnmanagedObjectUnwrapperAttribute.
pt_br: O tipo de método que contém VirtualMethodIndexAttribute não tem um UnmanagedObjectUnwrapperAttribute.
ru: У содержащего типа метода с VirtualMethodIndexAttribute нет атрибута UnmanagedObjectUnwrapperAttribute.
tr: VirtualMethodIndexAttribute içeren metot türünün UnmanagedObjectUnwrapperAttribute değeri yok.
zh_hans: 包含 VirtualMethodIndexAttribute 的方法类型没有 UnmanagedObjectUnwrapperAttribute。
zh_hant: 包含具有 VirtualMethodIndexAttribute 的方法類型沒有 UnmanagedObjectUnwrapperAttribute。

# InvalidAttributedMethodDescriptionCom
source: Methods on interfaces marked with 'GeneratedComInterfaceAttribute' should be non-generic. COM source generation will ignore methods that are generic.
cs: Metody na rozhraních označených atributem „GeneratedComInterfaceAttribute“ by neměly být obecné povahy. Generování zdroje modelu COM bude obecné metody ignorovat.
de: Methoden für Schnittstellen, die mit "GeneratedComInterfaceAttribute" gekennzeichnet sind, sollten nicht generisch sein. Die COM-Quellgenerierung ignoriert generische Methoden.
es: Los métodos de las interfaces marcadas con "GeneratedComInterfaceAttribute" no deben ser genéricos. La generación de orígenes COM omitirá los métodos que son genéricos.
fr: Les méthodes sur les interfaces marquées avec « GeneratedComInterfaceAttribute » doivent être non génériques. La génération de source COM ignore les méthodes génériques.
it: I metodi nelle interfacce contrassegnate con l’attributo 'GeneratedComInterfaceAttribute' devono essere non generici. La generazione di origini COM ignorerà i metodi generici.
ja: 'GeneratedComInterfaceAttribute' でマークされたインターフェイス上のメソッドは非ジェネリックである必要があります。COM ソース生成は、ジェネリック メソッドを無視します。
ko: 'GeneratedComInterfaceAttribute'로 표시된 인터페이스의 메서드는 제네릭이 아니어야 합니다. COM 원본 생성은 제네릭 메서드를 무시합니다.
pl: Metody w interfejsach oznaczone atrybutem „GeneratedComInterfaceAttribute” powinny być nie-ogólne. Generowanie źródła COM zignoruje metody, które są ogólne.
pt_br: Métodos em interfaces marcados com 'GeneratedComInterfaceAttribute' não devem ser genéricos. A geração de origem do COM ignorará os métodos genéricos.
ru: Методы для интерфейсов с атрибутом "GeneratedComInterfaceAttribute" должны быть неуниверсальными. Генерация исходного кода модели COM будет игнорировать универсальные методы.
tr: 'GeneratedComInterfaceAttribute' ile işaretlenmiş arabirimlerdeki metotlar genel olmamalıdır. COM kaynak oluşturma, genel metotları yok sayar.
zh_hans: 标记为 "GeneratedComInterfaceAttribute" 的接口上的方法应为非泛型。COM 源生成将忽略泛型方法。
zh_hant: 標示為 'GeneratedComInterfaceAttribute' 之介面上的方法應該是非泛型的。COM 來源產生將略過泛型方法。

# InvalidAttributedMethodDescriptionLibraryImport
source: Methods marked with 'LibraryImportAttribute' should be 'static', 'partial', and non-generic. P/Invoke source generation will ignore methods that are non-'static', non-'partial', or generic.
cs: Metody označené atributem LibraryImportAttribute by měly být typu „static“, „partial“ a non-generic. Generování zdrojů volání P/Invoke bude ignorovat metody typu non-„static“, non-„partial“ a generic.
de: Methoden, die mit \"LibraryImportAttribute\" gekennzeichnet sind, sollten \"statisch\", \"partiell\" und nicht generisch sein. Die P/Invoke-Quellgenerierung ignoriert Methoden, die nicht \"statisch\", nicht \"partiell\" oder generisch sind.
es: Los métodos marcados con “LibraryImportAttribute” deben ser “static”, “partial” y no genéricos. La generación de código fuente P/Invoke omitirá los métodos que no sean “static”, “partial” ni genéricos.
fr: Les méthodes marquées avec « LibraryImportAttribute » doivent être « static », « partial » et non génériques. La génération de source P/Invoke ignore les méthodes qui ne sont pas statiques, non partielles ou génériques.
it: I metodi contrassegnati con 'LibraryImportAttribute' devono essere 'static', 'partial' e non generici. Durante la generazione dell'origine P/Invoke i metodi non 'static', non 'partial' o generici verranno ignorati.
ja: 'LibraryImportAttribute' でマークされたメソッドは、'static'、'partial'、非ジェネリックである必要があります。P/Invoke ソース生成では、非 'static'、非 'partial'、ジェネリックであるメソッドは無視されます。
ko: 'LibraryImportAttribute'로 표시된 메소드는 'static', 'partial' 및 비제네릭이어야 합니다. P/Invoke 소스 생성은 'static'이 아니거나 'partial'이 아니거나 제네릭인 메서드를 무시합니다.
pl: Metody oznaczone jako atrybut „LibraryImportAttribute” powinny być „statyczne”, „częściowe” i nieogólne. Generowanie źródła funkcji P/Invoke zignoruje metody, które nie są „statyczne”, nie są „częściowe” lub ogólne.
pt_br: Os métodos marcados com 'LibraryImportAttribute' devem ser 'static', 'partial' e não genéricos. A geração de origem P/Invoke ignorará os métodos que não são 'static', não-'partial' ou genéricos.
ru: Методы, помеченные атрибутом \"LibraryImportAttribute\", должны быть \"static\", \"partial\" и неуниверсальными. При создании источника в P/Invoke будут игнорироваться методы, отличные от \"static\", \"partial\" или универсальные.
tr: 'LibraryImportAttribute' ile işaretlenmiş metotlar 'static', 'partial' ve genel olmayan özellikte olmalıdır. P/Invoke kaynak oluşturma 'static', 'partial' ve genel olmayan özellikteki metotlar dışında kalan metotları yok sayar.
zh_hans: 标记为 “LibraryImportAttribute” 的方法应为 “static”、“partial” 和非泛型。P/Invoke 源生成将忽略非“static”、“non--partial” 或泛型的方法。
zh_hant: 以 'LibraryImportAttribute' 標示的方法應該是 'static'、'partial' 和非泛型。產生 P/Invoke 来源會忽略非'static'、non-'partial' 或一般的方法。

# InvalidAttributedMethodSignatureMessageCom
source: Method '{0}' should be non-generic when on interfaces marked with the 'GeneratedComInterfaceAttribute'. COM source generation will ignore method '{0}'.
cs: Metoda „{0}“ by neměla být v rozhraních označených atributem GeneratedComInterfaceAttribute obecné povahy. Generování zdroje modelu COM bude metodu „{0}“ ignorovat.
de: Die Methode "{0}" sollte bei Schnittstellen, die mit "GeneratedComInterfaceAttribute" gekennzeichnet sind, nicht generisch sein. Die COM-Quellgenerierung ignoriert die Methode "{0}".
es: El método "{0}" debe ser no genérico cuando se encuentra en interfaces marcadas con 'GeneratedComInterfaceAttribute'. La generación de código fuente COM omitirá el método "{0}".
fr: La méthode '{0}' doit être non générique sur les interfaces marquées avec l’attribut GeneratedComInterfaceAttribute. La génération de source COM ignore la méthode '{0}'.
it: Il metodo '{0}' deve essere non generico nelle interfacce contrassegnate con l'attributo 'GeneratedComInterfaceAttribute'. La generazione di origini COM ignorerà il metodo '{0}'.
ja: 'GeneratedComInterfaceAttribute' でマークされたインターフェイスでは、メソッド '{0}' は非ジェネリックである必要があります。COM ソース生成はメソッド '{0}' を無視します。
ko: 'GeneratedComInterfaceAttribute'로 표시된 인터페이스에서 '{0}' 메서드는 제네릭이 아니어야 합니다. COM 원본 생성은 '{0}' 메서드를 무시합니다.
pl: Metoda „{0}” powinna być nie-ogólna w interfejsach oznaczonych atrybutem „GeneratedComInterfaceAttribute”. Generowanie źródła COM zignoruje metodę „{0}”.
pt_br: O método '{0}' não deve ser genérico em interfaces marcadas com 'GeneratedComInterfaceAttribute'. A geração de origem do COM ignorará o método '{0}'.
ru: Метод "{0}" должен быть неуниверсальным для интерфейсов с атрибутом "GeneratedComInterfaceAttribute". Генерация исходного кода модели COM будет игнорировать метод "{0}".
tr: 'GeneratedComInterfaceAttribute' ile işaretlenmiş arabirimlerde '{0}' metodu genel olmamalıdır. COM kaynak üretimi, '{0}' metodunu yok sayar.
zh_hans: 在标记为 "GeneratedComInterfaceAttribute" 的接口上时，方法 "{0}" 应为非泛型。COM 源生成将忽略方法 "{0}"。
zh_hant: 在用 'GeneratedComInterfaceAttribute' 標示的介面上，方法 '{0}' 應該是非泛型的。COM 來源產生將略過方法 '{0}'。

# InvalidAttributedMethodSignatureMessageLibraryImport
source: Method '{0}' should be 'static', 'partial', and non-generic when marked with 'LibraryImportAttribute'. P/Invoke source generation will ignore method '{0}'.
cs: Metoda {0} by měla mít vlastnost „static“, „partial“ a non-generic, když je označena atributem LibraryImportAttribute. Generování zdroje voláním P/Invoke bude metodu {0} ignorovat.
de: Die Methode \"{0}\" muss \"statisch\", \"partiell\" und nicht generisch sein, wenn sie mit \"LibraryImportAttribute\" markiert ist. Die P/Invoke-Quellgenerierung ignoriert die Methode \"{0}\".
es: El método “{0}” debe ser “static”, “partial”, y no genérico cuando está marcado con “LibraryImportAttribute”. La generación del código fuente P/Invoke omitirá el método “{0}”.
fr: La méthode « {0} » doit être « static », « partial » et non générique quand elle est marquée avec « LibraryImportAttribute ». La génération source P/Invoke ignore la méthode « {0} ».
it: Il metodo '{0}' deve essere 'static', 'partial' e non generico quando è contrassegnato con 'LibraryImportAttribute'. Durante la generazione dell'origine P/Invoke il metodo '{0}' verrà ignorato.
ja: 'LibraryImportAttribute' でマークされている場合、メソッド '{0}'は 'static'、'partial'、非ジェネリックである必要があります。P/Invoke ソース生成では、メソッド '{0}' は無視されます。
ko: '{0}' 메서드는 'LibraryImportAttribute'로 표시된 경우 '정적', '부분적'이어야 하며 일반이 아니어야 합니다. P/Invoke 소스 생성은 '{0}' 메서드를 무시합니다.
pl: Metoda „{0}” powinna być „statyczna”, „częściowa” i nieogólna, gdy jest oznaczona za pomocą atrybutu „LibraryImportAttribute”. Generowanie źródła funkcji P/Invoke zignoruje metodę „{0}”.
pt_br: O método '{0}' deve ser 'static', 'partial' e não genérico quando marcado com 'LibraryImportAttribute'. A geração de origem P/Invoke ignorará o método '{0}'.
ru: Метод \"{0}\" должен быть \"static\", \"partial\" и неуниверсальным, если он имеет атрибут \"LibraryImportAttribute\". При создании источника в P/Invoke метод \"{0}\" игнорируется.
tr: 'LibraryImportAttribute' ile işaretlendiğinde '{0}' metodu 'static', 'partial' ve genel olmayan özellikte olmalıdır. P/Invoke kaynak oluşturma '{0}' metodunu yok sayar.
zh_hans: 在标记为 “LibraryImportAttribute” 时，方法“{0}”应为 “static”、“partial” 和非泛型。P/Invoke 源生成将忽略方法“{0}”。
zh_hant: 以 'LibraryImportAttribute' 標示時，方法'{0}'應為 'static'、'partial' 和非泛型。產生 P/Invoke 来源會忽略方法'{0}'。

# InvalidCustomMarshallerAttributeUsageTitle
source: Invalid 'CustomMarshallerAttribute' usage
cs: Neplatné použití atributu CustomMarshallerAttribute
de: Ungültige Verwendung von "CustomMarshallerAttribute"
es: Uso de "CustomMarshallerAttribute" no válido
fr: Utilisation de 'CustomMarshallerAttribute' non valide
it: Utilizzo di 'CustomMarshallerAttribute' non valido
ja: 'CustomMarshallerAttribute' の使用状況が無効です
ko: 잘못된 'CustomMarshallerAttribute' 사용
pl: Nieprawidłowe użycie atrybutu „CustomMarshallerAttribute”
pt_br: Uso de 'CustomMarshallerAttribute' inválido
ru: Недопустимое использование "CustomMarshallerAttribute"
tr: Geçersiz 'CustomMarshallerAttribute' kullanımı
zh_hans: “CustomMarshallerAttribute”用法无效
zh_hant: `CustomMarshallerAttribute` 使用方式無效

# InvalidExceptionMarshallingConfigurationDescription
source: The configuration of 'ExceptionMarshalling' and 'ExceptionMarshallingCustomType' is invalid.
cs: Konfigurace ExceptionMarshalling a ExceptionMarshallingCustomType je neplatná.
de: Die Konfiguration von „ExceptionMarshalling“ und „ExceptionMarshallingCustomType“ ist ungültig.
es: La configuración de “ExceptionMarshalling” y “ExceptionMarshallingCustomType” no es válida.
fr: La configuration de « ExceptionMarshalling » et de « ExceptionMarshallingCustomType » est non valide.
it: La configurazione di 'ExceptionMarshalling' e 'ExceptionMarshallingCustomType' non è valida.
ja: 'ExceptionMarshalling' と 'ExceptionMarshallingCustomType' の構成が無効です。
ko: 'ExceptionMarshalling' 및 'ExceptionMarshallingCustomType'의 구성이 잘못되었습니다.
pl: Konfiguracja elementów „ExceptionMarshalling” i „ExceptionMarshallingCustomType” jest nieprawidłowa.
pt_br: A configuração de 'ExceptionMarshalling' e 'ExceptionMarshallingCustomType' é inválida.
ru: Недопустимая конфигурация ExceptionMarshalling и ExceptionMarshallingCustomType.
tr: 'ExceptionMarshalling' ve 'ExceptionMarshallingCustomType' yapılandırması geçersiz.
zh_hans: “ExceptionMarshalling” 和 “ExceptionMarshallingCustomType” 的配置无效。
zh_hant: 'ExceptionMarshalling' 和 'ExceptionMarshallingCustomType' 的設定無效。

# InvalidExceptionMarshallingConfigurationMessage
source: The configuration of 'ExceptionMarshalling' and 'ExceptionMarshallingCustomType' on method '{0}' is invalid. {1}
cs: Konfigurace ExceptionMarshalling a ExceptionMarshallingCustomType u metody {0} je neplatná. {1}
de: Die Konfiguration von „ExceptionMarshalling“ und „ExceptionMarshallingCustomType“ für die Methode „{0}“ ist ungültig. {1}
es: La configuración de “ExceptionMarshalling” y “ExceptionMarshallingCustomType” en el método “{0}” no es válida. {1}
fr: La configuration de « ExceptionMarshalling » et de « ExceptionMarshallingCustomType » sur la méthode « {0} » est non valide. {1}
it: La configurazione di 'ExceptionMarshalling' e 'ExceptionMarshallingCustomType' nel metodo '{0}' non è valida. {1}
ja: メソッド '{0}' の 'ExceptionMarshalling' と 'ExceptionMarstailingCustomType' の構成が無効です。 {1}
ko: 메서드 '{0}'의 'ExceptionMarshalling' 및 'ExceptionMarshallingCustomType'의 구성이 잘못되었습니다. {1}
pl: Konfiguracja elementów „ExceptionMarshalling” i „ExceptionMarshallingCustomType” w metodzie „{0}” jest nieprawidłowa. {1}
pt_br: A configuração de 'ExceptionMarshalling' e 'ExceptionMarshallingCustomType' no método '{0}' é inválida. {1}
ru: Недопустимая конфигурация ExceptionMarshalling и ExceptionMarshallingCustomType в методе "{0}". {1}
tr: '{0}' yönteminde 'ExceptionMarshalling' ve 'ExceptionMarshallingCustomType' yapılandırması geçersiz. {1}
zh_hans: 方法“{0}”上的 “ExceptionMarshalling” 和 “ExceptionMarshallingCustomType” 配置无效。{1}
zh_hant: 方法 '{0}' 上的 'ExceptionMarshalling' 和 'ExceptionMarshallingCustomType' 的設定無效。{1}

# InvalidExceptionMarshallingConfigurationMissingCustomType
source: 'ExceptionMarshallingCustomType' must be specified when 'ExceptionMarshalling' is set to 'ExceptionMarshalling.Custom'.
cs: ExceptionMarshallingCustomType musí být určený, pokud je vExceptionMarshalling nastavený na ExceptionMarshalling.Custom.
de: „ExceptionMarshallingCustomType“ muss angegeben werden, wenn „ExceptionMarshalling“ auf „ExceptionMarshalling.Custom“ festgelegt ist.
es: Se deberá especificar “ExceptionMarshallingCustomType” cuando “ExceptionMarshalling” esté establecido en “ExceptionMarshalling.Custom”.
fr: « ExceptionMarshallingCustomType » doit être spécifié quand « ExceptionMarshalling » a la valeur « ExceptionMarshalling.Custom ».
it: È necessario specificare 'ExceptionMarshallingCustomType' quando 'ExceptionMarshalling' è impostato su 'ExceptionMarshalling.Custom'.
ja: 'ExceptionMarshalling' が 'ExceptionMarshalling.Custom' に設定されている場合は、'ExceptionMarshallingCustomType' を指定する必要があります。
ko: 'ExceptionMarshalling'이 'ExceptionMarshalling.Custom'으로 설정된 경우 'ExceptionMarshallingCustomType'을 지정해야 합니다.
pl: Element „ExceptionMarshallingCustomType” musi być określony kiedy „ExceptionMarshalling” jest ustawiony na „ExceptionMarshalling.Custom”.
pt_br: 'ExceptionMarshallingCustomType' deve ser especificado quando 'ExceptionMarshalling' está definido como 'ExceptionMarshalling.Custom'.
ru: Необходимо указать ExceptionMarshallingCustomType, если для ExceptionMarshalling настроено значение ExceptionMarshalling.Custom.
tr: 'ExceptionMarshalling' 'ExceptionMarshalling.Custom' olarak ayarlandığında 'ExceptionMarshallingCustomType' belirtilmelidir.
zh_hans: 当 “ExceptionMarshalling” 设置为 “ExceptionMarshalling.Custom” 时，必须指定 “ExceptionMarshallingCustomType”。
zh_hant: 當 'ExceptionMarshalling' 設定為 'ExceptionMarshalling.Custom' 時，必須指定 'ExceptionMarshallingCustomType'。

# InvalidExceptionMarshallingConfigurationNotCustom
source: 'ExceptionMarshalling' should be set to 'ExceptionMarshalling.Custom' when 'ExceptionMarshallingCustomType' is specified.
cs: ExceptionMarshalling by měl být nastavený na ExceptionMarshalling.Custom, když je pokud je určený ExceptionMarshallingCustomType.
de: „ExceptionMarshalling“ muss auf „ExceptionMarshalling.Custom“ festgelegt werden, wenn „ExceptionMarshallingCustomType“ angegeben ist.
es: ”ExceptionMarshalling” deberá establecerse en ”ExceptionMarshalling.Custom” cuando se especifique ”ExceptionMarshallingCustomType”.
fr: « ExceptionMarshalling » doit avoir la valeur « ExceptionMarshalling.Custom » quand « ExceptionMarshallingCustomType » est spécifié.
it: 'ExceptionMarshalling' deve essere impostato su 'ExceptionMarshalling.Custom' quando è specificato 'ExceptionMarshallingCustomType'.
ja: 'ExceptionMarshallingCustomType' が指定されている場合は、'ExceptionMarshalling' を 'ExceptionMarshalling.Custom' に設定する必要があります。
ko: 'ExceptionMarshallingCustomType'이 지정된 경우 'ExceptionMarshalling'은 'ExceptionMarshalling.Custom'으로 설정해야 합니다.
pl: Element „ExceptionMarshalling” powinien być ustawiony na „ExceptionMarshalling.Custom” kiedy typ „ExceptionMarshallingCustomType” jest określony.
pt_br: 'ExceptionMarshalling' deve ser definido como 'ExceptionMarshalling.Custom' quando 'ExceptionMarshallingCustomType' é especificado.
ru: ExceptionMarshalling должен иметь значение ExceptionMarshalling.Custom, если указано ExceptionMarshallingCustomType.
tr: 'ExceptionMarshallingCustomType' belirtilirken 'ExceptionMarshalling', 'ExceptionMarshalling.Custom' olarak ayarlanmalıdır.
zh_hans: 指定 “ExceptionMarshallingCustomType” 时，应将 “ExceptionMarshalling” 设置为 “ExceptionMarshalling.Custom”。
zh_hant: 指定 'ExceptionMarshallingCustomType' 時，'ExceptionMarshalling' 應設定為 'ExceptionMarshalling.Custom'。

# InvalidExceptionMarshallingValue
source: The provided value is not a known flag of the 'ExceptionMarshalling' enum.
cs: Zadaná hodnota není známý příznak výčtu ExceptionMarsnuming.
de: Der angegebene Wert ist kein bekanntes Flag der „ExceptionMarshalling“-Enumeration.
es: El valor proporcionado no es una marca conocida de la enumeración “ExceptionMarshalling”.
fr: La valeur fournie n’est pas un indicateur connu de l’énumération « ExceptionMarshalling ».
it: Il valore specificato non è un flag noto dell'enumerazione 'ExceptionMarshalling'.
ja: 指定された値は、'ExceptionMarshalling' 列挙型の既知のフラグではありません。
ko: 제공된 값은 'ExceptionMarshalling' 열거형의 알려진 플래그가 아닙니다.
pl: Podana wartość nie jest znaną flagą wyliczenia „'ExceptionMarshalling”.
pt_br: O valor fornecido não é um sinalizador conhecido da enumeração 'ExceptionMarshalling'.
ru: Указанное значение не является известным флагом перечисления ExceptionMarshalling.
tr: Sağlanan değer bilinen bir 'ExceptionMarshalling' sabit listesi bayrağı değil.
zh_hans: 提供的值不是 “ExceptionMarshalling” 枚举的已知标志。
zh_hant: 提供的值不是 'ExceptionMarshalling' 列舉的已知旗標。

# InvalidGeneratedComClassAttributeUsageDescription
source: Classes with 'GeneratedComClassAttribute' must implement one or more interfaces with 'GeneratedComInterfaceAttribute', be marked partial, and be non-generic.
cs: Třídy s třídou GeneratedComClassAttribute musí implementovat jedno nebo více rozhraní s „GeneratedComInterfaceAttribute“, být označeny jako částečné a musí být neobecné.
de: Klassen mit "GeneratedComClassAttribute" müssen mindestens eine Schnittstelle mit "GeneratedComInterfaceAttribute" implementieren, als "Partiell" gekennzeichnet und nicht generisch sein.
es: Las clases con "GeneratedComClassAttribute" deben implementar una o varias interfaces con "GeneratedComInterfaceAttribute", marcarse como parciales y no ser genéricas.
fr: Les classes avec 'GeneratedComClassAttribute' doivent implémenter une ou plusieurs interfaces avec 'GeneratedComInterfaceAttribute', être marquées comme partielles et non génériques.
it: Le classi con 'GeneratedComClassAttribute' devono implementare una o più interfacce con 'GeneratedComInterfaceAttribute', essere contrassegnate come parziali e non generiche.
ja: 'GeneratedComClassAttribute' を持つクラスは、'GeneratedComInterfaceAttribute' を持つ 1 つ以上のインターフェイスを実装し、partial に設定し、非ジェネリックにする必要があります。
ko: 'GeneratedComClassAttribute'가 있는 클래스는 'GeneratedComInterfaceAttribute'를 사용하여 인터페이스를 하나 이상 구현하고 'partial'로 표시되어야 하며 제네릭이 아니어야 합니다.
pl: Klasy z atrybutem „GeneratedComClassAttribute” muszą implementować co najmniej jeden interfejs z atrybutem „GeneratedComInterfaceAttribute”, być oznaczone jako częściowe i nie być ogólne.
pt_br: As classes com 'GeneratedComClassAttribute' devem implementar uma ou mais interfaces com 'GeneratedComInterfaceAttribute', ser marcadas como parciais e não genéricas.
ru: Классы с "GeneratedComClassAttribute" должны реализовывать один или несколько интерфейсов с "GeneratedComInterfaceAttribute", помечаться как частичные и быть неуниверсальными.
tr: 'GeneratedComClassAttribute' içeren sınıflar 'GeneratedComInterfaceAttribute' ile bir veya daha fazla arabirim uygulamalı, kısmi olarak işaretlenmeli ve genel olmayan olmalıdır.
zh_hans: 具有“GeneratedComClassAttribute”的类必须执行一个或多个具有“GeneratedComInterfaceAttribute”的接口，并标记为部分和非泛型。
zh_hant: 具有 'GeneratedComClassAttribute' 的類別必須實作一或多個具有 'GeneratedComInterfaceAttribute' 的介面、標示為部份且非泛型。
