Repository: dotnet/runtime
Catalog: src/libraries/System.Runtime.InteropServices/gen/Common/Resources/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ClassDoesNotImplementAnyGeneratedComInterfacesMessage
source: Class '{0}' with 'GeneratedComClassAttribute' does not implement any interfaces with 'GeneratedComInterfaceAttribute'. Source will not be generated for '{0}'.
cs: Třída {0} s atributem GeneratedComClassAttribute neimplementuje žádná rozhraní s GeneratedComInterfaceAttribute. Zdroj se pro {0} nevygeneruje.
de: Die Klasse '{0}' mit 'GeneratedComClassAttribute' implementiert keine Schnittstellen mit 'GeneratedComInterfaceAttribute'. Die Quelle wird für '{0}' nicht generiert.
es: La clase "{0}" con "GeneratedComClassAttribute" no implementa ninguna interfaz con "GeneratedComInterfaceAttribute". No se generará el origen para "{0}".
fr: La classe « {0} » avec « GeneratedComClassAttribute » n’implémente aucune interface avec « GeneratedComInterfaceAttribute ». La source ne sera pas générée pour « {0} ».
it: La classe '{0}' con 'GeneratedComClassAttribute' non implementa interfacce con 'GeneratedComInterfaceAttribute'. L'origine non verrà generata per '{0}'.
ja: 'GeneratedComClassAttribute' を持つクラス '{0}' は、'GeneratedComInterfaceAttribute' を持つインターフェイスを実装しません。'{0}' のソースは生成されません。
ko: 'GeneratedComClassAttribute'가 있는 '{0}' 클래스는 'GeneratedComInterfaceAttribute'가 있는 인터페이스를 구현하지 않습니다. '{0}'에 대해 원본이 생성되지 않습니다.
pl: Klasa „{0}” z atrybutem „GeneratedComClassAttribute” nie implementuje żadnych interfejsów z atrybutem „GeneratedComInterfaceAttribute”. Źródło nie zostanie wygenerowane dla „{0}”.
pt_br: A classe "{0}" com "GeneratedComClassAttribute" não implementa nenhuma interface com "GeneratedComInterfaceAttribute". A origem não será gerada para "{0}".
ru: Класс "{0}" с "GeneratedComClassAttribute" не реализует интерфейсы с "GeneratedComInterfaceAttribute". Источник не будет создан для "{0}".
tr: 'GeneratedComClassAttribute' içeren '{0}' sınıfı, 'GeneratedComInterfaceAttribute' içeren arabirimler uygulamıyor. Kaynak, '{0}' için oluşturulmayacak.
zh_hans: 具有“GeneratedComClassAttribute”的类 {0} 不实现具有“GeneratedComInterfaceAttribute”的任何接口。不会为“{0}”生成源。
zh_hant: 具有 'GeneratedComClassAttribute' 的類別 '{0}' 未使用 'GeneratedComInterfaceAttribute' 來實作任何介面。將不會為 '{0}' 產生來源。

# CollectionSizeParamTypeMustBeIntegral
source: The specified collection size parameter for an collection must be an integer type. If the size information is applied to a nested collection, the size parameter must be a collection of one less level of nesting with an integral element.
cs: Zadaný parametr velikosti kolekce musí být u kolekce celočíselný. Pokud se informace o velikosti použijí na vnořenou kolekci, parametr velikosti musí být kolekce o jednu nižší úrovně vnoření s integrálním elementem.
de: Der angegebene Parameter für die Sammlungsgröße für eine Auflistung muss ein ganzzahliger Typ sein. Wenn die Größeninformationen auf eine geschachtelte Auflistung angewendet werden, muss der Größenparameter eine Auflistung mit einer geringeren Schachtelungsebene mit einem ganzzahligen Element sein.
es: El parámetro de tamaño de colección especificado para una colección debe ser de tipo entero. Si la información de tamaño se aplica a una colección anidada, el parámetro de tamaño debe ser una colección de un nivel menos de anidamiento con un elemento integral.
fr: Le paramètre de taille de collection spécifié pour une collection doit être un type entier. Si les informations de taille sont appliquées à une collection imbriqué, le paramètre de taille doit être une collection d’un niveau d’imbrication inférieur avec un élément intégral.
it: Il parametro size specificato per una raccolta deve essere un tipo Integer. Se le informazioni sulle dimensioni vengono applicate a una raccolta annidata, il parametro size deve essere una raccolta di un livello inferiore di annidamento con un elemento integrale.
ja: コレクション用のコレクション サイズ パラメーターは整数型にする必要があります。サイズ情報が入れ子になったコレクションに適用される場合、size パラメーターは、整数要素を持つ 1 つ下のレベルのコレクションである必要があります。
ko: 컬렉션에 대해 지정된 컬렉션 크기 매개 변수는 정수 형식이어야 합니다. 크기 정보가 중첩된 컬렉션에 적용되는 경우 크기 매개 변수는 정수 요소가 있는 중첩 수준이 한 단계 낮은 컬렉션이어야 합니다.
pl: Określony parametr rozmiaru kolekcji dla kolekcji musi być liczbą całkowitą. Jeśli informacje o rozmiarze są stosowane do kolekcji zagnieżdżonej, parametr rozmiaru musi być kolekcją o jednym poziomie zagnieżdżenia mniej, o liczbie całkowitej.
pt_br: O parâmetro de tamanho de coleção especificado para uma coleção deve ser um tipo inteiro. Se as informações de tamanho são aplicadas a uma coleção aninhada, o parâmetro de tamanho deve ser uma coleção de um nível a menos de aninhamento com um elemento integral.
ru: Указанный параметр размера коллекции должен быть целочисленным типом. Если сведения о размере применяются к вложенной коллекции, параметр размера должен быть коллекцией на один уровень вложения меньше с целочисленным элементом.
tr: Bir koleksiyon için belirtilen koleksiyon boyutu parametresi tamsayı türünde olmalıdır. Boyut bilgisi iç içe yerleştirilmiş bir koleksiyona uygulanırsa boyut parametresinin, bir tam sayı öğesiyle daha az iç içe yerleştirme düzeyine sahip bir koleksiyon olması gerekir.
zh_hans: 为集合指定的集合大小参数必须是整数类型。如果大小信息应用于嵌套集合，则大小参数必须是具有整数元素的嵌套级别少一个层次的集合。
zh_hant: 為集合指定的集合大小參數必須是整數類型。如果大小資訊套用至巢狀集合，大小參數必須是少於一層巢狀元素的集合。

# ComHostingDoesNotSupportGeneratedComInterfaceDescription
source: .NET COM hosting with 'EnableComHosting' only supports built-in COM interop. It does not support source-generated COM interop with 'GeneratedComInterfaceAttribute'.
cs: Hostování .NET COM s EnableComHosting podporuje jenom integrovaného zprostředkovatele komunikace s objekty COM. Nepodporuje zprostředkovatele komunikace s objekty COM vygenerovaného zdrojem s generatedComInterfaceAttribute.
de: Das .NET COM-Hosting mit "EnableComHosting" unterstützt nur integrierte COM-Interop. Der vom Quellcode generierte COM-Interop mit "GeneratedComInterfaceAttribute" wird nicht unterstützt.
es: El hospedaje COM de .NET con "EnableComHosting" solo admite interoperabilidad COM integrada. No admite la interoperabilidad COM generada por origen con "GeneratedComInterfaceAttribute".
fr: L'hébergement .NET COM avec 'EnableComHosting' ne prend en charge que l'interopérabilité COM intégrée. Il ne prend pas en charge l'interopérabilité COM générée par la source avec 'GeneratedComInterfaceAttribute'.
it: L'hosting COM .NET con 'EnableComHosting' supporta solo l'interoperabilità COM predefinita. Non supporta l'interoperabilità COM generata dall’origine con 'GeneratedComInterfaceAttribute'.
ja: 'EnableComHosting' を使用した .NET COM ホスティングでは、組み込みの COM 相互運用機能のみがサポートされます。ソース生成 COM 相互運用機能と 'GeneratedComInterfaceAttribute' はサポートされていません。
ko: 'EnableComHosting'을 사용한 .NET COM 호스팅은 기본 제공 COM interop만 지원합니다. 'GeneratedComInterfaceAttribute'와의 소스 생성 COM 상호 운용성을 지원하지 않습니다.
pl: Hosting modelu COM platformy .NET z elementem „EnableComHosting” obsługuje tylko wbudowaną usługę międzyoperacyjną modelu COM. Nie obsługuje usługi międzyoperacyjnej modelu COM wygenerowanej przez źródło przy użyciu atrybutu „GeneratedComInterfaceAttribute”.
pt_br: A hospedagem .NET COM com 'EnableComHosting' suporta apenas interoperabilidade COM integrada. Ele não dá suporte à interoperabilidade COM gerada pela origem com 'GeneratedComInterfaceAttribute'.
ru: Размещение .NET COM с "EnableComHosting" поддерживает только встроенное COM-взаимодействие. Не поддерживается COM-взаимодействие, созданное источником, с "GeneratedComInterfaceAttribute".
tr: 'EnableComHosting' ile .NET COM barındırma, yalnızca yerleşik COM birlikte çalışmayı destekler. 'GeneratedComInterfaceAttribute' ile kaynak tarafından oluşturulan COM birlikte çalışmasını desteklemez.
zh_hans: 具有“EnableComHosting”的 .NET COM 托管仅支持内置 COM 互操作。它不支持源生成的 COM 与“GeneratedComInterfaceAttribute”的互操作。
zh_hant: 以 'EnableComHosting' 裝載的 .NET COM 僅支援內建 COM Interop。它並不支援使用 'GeneratedComInterfaceAttribute'來源產生的 COM Interop。

# ComHostingDoesNotSupportGeneratedComInterfaceMessage
source: .NET COM hosting with 'EnableComHosting' does not support interfaces with the 'GeneratedComInterfaceAttribute'. Change any COM exposed interfaces implemented by '{0}' to use the 'System.Runtime.InteropServices.ComVisibleAttribute' instead
cs: Hostování .NET COM s EnableComHosting nepodporuje rozhraní s GeneratedComInterfaceAttribute. Změňte všechna rozhraní vystavená modelem COM implementovaná {0} tak, aby místo toho používala System.Runtime.InteropServices.ComVisibleAttribute.
de: Das .NET COM-Hosting mit "EnableComHosting" unterstützt keine Schnittstellen mit dem "GeneratedComInterfaceAttribute". Ändern Sie alle von "{0}" implementierten COM-verfügbar gemachten Schnittstellen, sodass stattdessen "System.Runtime.InteropServices.ComVisibleAttribute" verwendet wird.
es: El hospedaje COM de .NET con “EnableComHosting” no admite interfaces con “GeneratedComInterfaceAttribute”. Cambie las interfaces expuestas a COM implementadas por “{0}” para usar “System.Runtime.InteropServices.ComVisibleAttribute” en su lugar
fr: L'hébergement .NET COM avec 'EnableComHosting' ne prend pas en charge les interfaces avec 'GeneratedComInterfaceAttribute'. Modifiez toutes les interfaces COM exposées implémentées par '{0}' pour utiliser le 'System.Runtime.InteropServices.ComVisibleAttribute' à la place
it: L'hosting COM .NET con 'EnableComHosting' non supporta le interfacce con 'GeneratedComInterfaceAttribute'. Modificare tutte le interfacce esposte a COM implementate da '{0}' in modo da usare 'System.Runtime.InteropServices.ComVisibleAttribute'.
ja: 'EnableComHosting' を使用した .NET COM ホスティングでは、'GeneratedComInterfaceAttribute' のインターフェイスはサポートされていません。'{0}' によって実装された COM 公開インターフェイスを変更して、代わりに 'System.Runtime.InteropServices.ComVisibleAttribute' を使用するようにします
ko: 'EnableComHosting'을 사용한 .NET COM 호스팅은 'GeneratedComInterfaceAttribute'를 사용한 인터페이스를 지원하지 않습니다. 대신 'System.Runtime.InteropServices.ComVisibleAttribute'를 사용하도록 '{0}'에 의해 구현된 모든 COM 노출 인터페이스를 변경합니다.
pl: Hosting modelu COM platformy .NET z elementem „EnableComHosting” nie obsługuje interfejsów z atrybutem „GeneratedComInterfaceAttribute”. Zmień wszystkie interfejsy ujawnione przez model COM zaimplementowane przez „{0}”, aby zamiast tego użyć atrybutu „System.Runtime.InteropServices.ComVisibleAttribute”
pt_br: A hospedagem .NET COM com 'EnableComHosting' não dá suporte interfaces com o 'GeneratedComInterfaceAttribute'. Altere quaisquer interfaces COM expostas implementadas por '{0}' para usar o 'System.Runtime.InteropServices.ComVisibleAttribute' em vez disso
ru: Размещение .NET COM с "EnableComHosting" не поддерживает интерфейсы с "GeneratedComInterfaceAttribute". Измените все доступные в COM интерфейсы, реализованные с помощью "{0}", на использование "System.Runtime.InteropServices.ComVisibleAttribute"
tr: 'EnableComHosting' ile barındırma .NET COM, 'GeneratedComInterfaceAttribute' ile arabirimleri desteklemez. Bunun yerine 'System.Runtime.InteropServices.ComVisibleAttribute' kullanmak için '{0}' tarafından uygulanan COM'a maruz kalan arabirimleri değiştirin
zh_hans: 具有“EnableComHosting”的 .NET COM 托管不支持具有“GeneratedComInterfaceAttribute”的接口。将“{0}”实现的任何 COM 公开接口更改为改用“System.Runtime.InteropServices.ComVisibleAttribute”
zh_hant: 以 'EnableComHosting' 裝載的 .NET COM 不支援具有 'GeneratedComInterfaceAttribute' 的介面。變更 '{0}' 實作的任何 COM 公開介面，以改為使用 'System.Runtime.InteropServices.ComVisibleAttribute'

# ComHostingDoesNotSupportGeneratedComInterfaceTitle
source: .NET COM hosting with 'EnableComHosting' does not support interfaces with the 'GeneratedComInterfaceAttribute'
cs: Hostování .NET COM s EnableComHosting nepodporuje rozhraní s generatedComInterfaceAttribute
de: Das .NET COM-Hosting mit "EnableComHosting" unterstützt keine Schnittstellen mit "GeneratedComInterfaceAttribute".
es: El hospedaje COM de .NET con “EnableComHosting” no admite interfaces con “GeneratedComInterfaceAttribute”
fr: L'hébergement .NET COM avec 'EnableComHosting' ne prend pas en charge les interfaces avec 'GeneratedComInterfaceAttribute'
it: L'hosting COM .NET con 'EnableComHosting' non supporta le interfacce con 'GeneratedComInterfaceAttribute'.
ja: 'EnableComHosting' を使用した .NET COM ホスティングでは、'GeneratedComInterfaceAttribute' のインターフェイスはサポートされていません
ko: 'EnableComHosting'을 사용한 .NET COM 호스팅은 'GeneratedComInterfaceAttribute'를 사용한 인터페이스를 지원하지 않습니다.
pl: Hosting modelu COM platformy .NET z elementem „EnableComHosting” nie obsługuje interfejsów z atrybutem „GeneratedComInterfaceAttribute”
pt_br: A hospedagem .NET COM com 'EnableComHosting' não dá suporte a interfaces com 'GeneratedComInterfaceAttribute'
ru: Размещение .NET COM с "EnableComHosting" не поддерживает интерфейсы с "GeneratedComInterfaceAttribute"
tr: 'EnableComHosting' ile barındırma .NET COM, 'GeneratedComInterfaceAttribute' ile arabirimleri desteklemez
zh_hans: 具有“EnableComHosting”的 .NET COM 托管不支持具有“GeneratedComInterfaceAttribute”的接口
zh_hant: 以 'EnableComHosting' 裝載的 .NET COM 不支援具有 'GeneratedComInterfaceAttribute' 的介面

# ComInterfaceUsageDoesNotFollowBestPracticesMessageWithDetails
source: The usage of 'GeneratedComInterfaceAttribute' does not follow recommendations. {0}
cs: Použití „GeneratedComInterfaceAttribute“ není v souladu s doporučeními. {0}
de: Die Verwendung von "GeneratedComInterfaceAttribute" entspricht nicht den Empfehlungen. {0}
es: El uso de "GeneratedComInterfaceAttribute" no sigue las recomendaciones. {0}
fr: L'utilisation de « GeneratedComInterfaceAttribute » ne suit pas les recommandations. {0}
it: L'utilizzo di 'GeneratedComInterfaceAttribute' non segue le raccomandazioni.{0}
ja: 'GeneratedComInterfaceAttribute' の使用は推奨事項に従っていません。{0}
ko: 'GeneratedComInterfaceAttribute' 사용법이 권장 사항을 따르지 않습니다. {0}
pl: Użycie atrybutu „GeneratedComInterfaceAttribute” nie jest zgodne z zaleceniami. {0}
pt_br: O uso de 'GeneratedComInterfaceAttribute' não segue as recomendações. {0}
ru: Использование "GeneratedComInterfaceAttribute" не соответствует рекомендациям. {0}
tr: 'GeneratedComInterfaceAttribute' kullanımı önerilere uygun değil. {0}
zh_hans: “GeneratedComInterfaceAttribute”的使用未遵循建议。{0}
zh_hant: 'GeneratedComInterfaceAttribute' 的使用方式未遵循建議。{0}

# ComInterfaceUsageDoesNotFollowBestPracticesTitle
source: The usage of 'GeneratedComInterfaceAttribute' does not follow recommendations.
cs: Použití „GeneratedComInterfaceAttribute“ není v souladu s doporučeními.
de: Die Verwendung von "GeneratedComInterfaceAttribute" entspricht nicht den Empfehlungen.
es: El uso de "GeneratedComInterfaceAttribute" no sigue las recomendaciones.
fr: L'utilisation de « GeneratedComInterfaceAttribute » ne suit pas les recommandations.
it: L'utilizzo di 'GeneratedComInterfaceAttribute' non segue le raccomandazioni.
ja: 'GeneratedComInterfaceAttribute' の使用は推奨事項に従っていません。
ko: 'GeneratedComInterfaceAttribute' 사용법이 권장 사항을 따르지 않습니다.
pl: Użycie atrybutu „GeneratedComInterfaceAttribute” nie jest zgodne z zaleceniami.
pt_br: O uso de 'GeneratedComInterfaceAttribute' não segue as recomendações.
ru: Использование "GeneratedComInterfaceAttribute" не соответствует рекомендациям.
tr: 'GeneratedComInterfaceAttribute' kullanımı önerilere uygun değil.
zh_hans: “GeneratedComInterfaceAttribute”的使用未遵循建议。
zh_hant: 'GeneratedComInterfaceAttribute' 的使用方式未遵循建議。

# ComMethodReturningIntWillBeOutParameterMessage
source: The return value in the managed definition will be converted to an 'out' parameter when calling the unmanaged COM method. If the return value is intended to be the HRESULT code returned by the unmanaged COM method, use '[PreserveSig]' on the method.
cs: Vrácená hodnota ve spravované definici se při volání nespravované metody COM převede na parametr out. Pokud má být návratovou hodnotou kód HRESULT vrácený nespravovanou metodou COM, použijte u metody [PreserveSig].
de: Der Rückgabewert in der verwalteten Definition wird beim Aufrufen der nicht verwalteten COM-Methode in einen out-Parameter konvertiert. Wenn als Rückgabewert der von der nicht verwalteten COM-Methode zurückgegebene HRESULT-Code eingesetzt werden soll, verwenden Sie "[PreserveSig]" für die Methode.
es: El valor devuelto en la definición administrada se convertirá en un parámetro “out” al llamar al método COM no administrado. Si el valor devuelto debe ser el código HRESULT devuelto por el método COM no administrado, use “[PreserveSig]” en el método.
fr: La valeur de retour dans la définition managée est convertie en paramètre 'out' lors de l’appel de la méthode COM non managée. Si la valeur de retour doit être le code HRESULT retourné par la méthode COM non managée, utilisez '[PreserveSig]' sur la méthode.
it: Il valore restituito nella definizione gestita verrà convertito in un parametro 'out' quando si chiama il metodo COM non gestito. Se il valore restituito deve essere il codice HRESULT restituito dal metodo COM non gestito, utilizzare '[PreserveSig]' sul metodo.
ja: マネージド定義の戻り値は、アンマネージド COM メソッドを呼び出すときに 'out' パラメーターに変換されます。戻り値を、アンマネージド COM メソッドによって返される HRESULT コードにする場合は、メソッドで '[PreserveSig]' を使用してください。
ko: 관리 정의의 반환 값은 관리되지 않는 COM 메서드를 호출할 때 'out' 매개 변수로 변환됩니다. 반환 값이 관리되지 않는 COM 메서드에서 반환된 HRESULT 코드인 경우 메서드에서 '[PreserveSig]'를 사용하세요.
pl: Wartość zwracana w definicji zarządzanej zostanie przekonwertowana na parametr „out” podczas wywoływania niezarządzanej metody COM. Jeśli wartość zwracana ma być kodem HRESULT zwracanym przez niezarządzaną metodę COM, należy użyć „[PreserveSig]” w metodzie.
pt_br: O valor de retorno na definição gerenciada será convertido em um parâmetro 'out' ao chamar o método COM não gerenciado. Se o valor de retorno for o código HRESULT retornado pelo método COM não gerenciado, use '[PreserveSig]' no método.
ru: Возвращаемое значение в управляемом определении будет преобразовано в параметр "out" при вызове неуправляемого метода COM. Если возвращаемое значение должно быть кодом HRESULT, возвращаемым неуправляемым COM-методом, используйте "[PreserveSig]" в методе.
tr: Yönetilen tanımdaki dönüş değeri, yönetilmeyen COM yöntemi çağrılırken 'out' parametresine dönüştürülür. Dönüş değerinin yönetilmeyen COM yöntemi tarafından döndürülen HRESULT kodu olması amaçlanmışsa, yöntemde '[PreserveSig]' kullanın.
zh_hans: 调用非托管 COM 方法时，托管定义中的返回值将转换为 "out" 参数。如果返回值是非托管 COM 方法返回的 HRESULT 代码，请对方法使用 "[PreserveSig]"。
zh_hant: 呼叫未受控 COM 方法時，受控定義中的傳回值將轉換為 'out' 參數。如果傳回值預期是未受控 COM 方法傳回的 HRESULT 代碼，請在方法上使用 '[PreserveSig]'。

# ComMethodReturningIntWillBeOutParameterTitle
source: The return value in the managed definition will be converted to an additional 'out' parameter at the end of the parameter list when calling the unmanaged COM method.
cs: Návratová hodnota ve spravované definici se při volání nespravované metody COM převede na další parametr out na konci seznamu parametrů.
de: Der Rückgabewert in der verwalteten Definition wird beim Aufrufen der nicht verwalteten COM-Methode in einen zusätzlichen out-Parameter am Ende der Parameterliste konvertiert.
es: El valor devuelto en la definición administrada se convertirá en un parámetro “out” adicional al final de la lista de parámetros al llamar al método COM no administrado.
fr: La valeur de retour dans la définition managée est convertie en paramètre 'out' supplémentaire à la fin de la liste de paramètres lors de l’appel de la méthode COM non managée.
it: Il valore restituito nella definizione gestita verrà convertito in un parametro 'out' aggiuntivo alla fine dell'elenco di parametri quando si chiama il metodo COM non gestito.
ja: マネージド定義の戻り値は、アンマネージド COM メソッドを呼び出すときに、パラメーター リストの末尾にある追加の 'out' パラメーターに変換されます。
ko: 관리 정의의 반환 값은 관리되지 않는 COM 메서드를 호출할 때 매개 변수 목록 끝에 있는 추가 'out' 매개 변수로 변환됩니다.
pl: Wartość zwracana w definicji zarządzanej zostanie przekonwertowana na dodatkowy parametr „out” na końcu listy parametrów podczas wywoływania niezarządzanej metody COM.
pt_br: O valor de retorno na definição gerenciada será convertido em um parâmetro 'out' adicional no final da lista de parâmetros ao chamar o método COM não gerenciado.
ru: Возвращаемое значение в управляемом определении будет преобразовано в дополнительный параметр "out" в конце списка параметров при вызове неуправляемого метода COM.
tr: Yönetilen tanımdaki dönüş değeri, yönetilmeyen COM yöntemi çağrılırken parametre listesinin sonunda ek bir 'out' parametresine dönüştürülür.
zh_hans: 调用非托管 COM 方法时，托管定义中的返回值将转换为参数列表末尾的附加 "out" 参数。
zh_hant: 呼叫未受控 COM 方法時，受控定義中的傳回值將在參數清單尾端轉換為額外的 'out' 參數。

# ConfigurationNotSupportedDescriptionCom
source: Source-generated COM will ignore any configuration that is not supported.
cs: Model COM vygenerovaný zdrojem bude ignorovat všechny nepodporované konfigurace.
de: Quellgeneriertes COM ignoriert alle Konfigurationen, die nicht unterstützt werden.
es: COM generado por el origen omitirá cualquier configuración que no se admita.
fr: COM généré par la source ignore toute configuration qui n’est pas prise en charge.
it: I COM generati dall'origine ignoreranno qualsiasi configurazione non supportata.
ja: ソース生成済みの COM は、サポートされていない構成を無視します。
ko: 소스 생성 COM은 지원되지 않는 구성을 무시합니다.
pl: COM wygenerowany przez źródło zignoruje każdą konfigurację, która nie jest obsługiwana.
pt_br: Um COM gerado pela origem ignorará qualquer configuração sem suporte.
ru: Модель COM генератора исходного кода будет игнорировать любую неподдерживаемую конфигурацию.
tr: Kaynak tarafından oluşturulan COM, desteklenmeyen herhangi bir yapılandırmayı yok sayar.
zh_hans: 源生成的 COM 将忽略任何不受支持的配置。
zh_hant: 来源產生的 COM 將會略過任何不支援的設定。

# ConfigurationNotSupportedDescriptionLibraryImport
source: Source-generated P/Invokes will ignore any configuration that is not supported.
cs: Zdrojem generovaná volání P/Invokes budou ignorovat všechny nepodporované konfigurace.
de: Quellgenerierte P/Invokes ignorieren alle Konfigurationen, die nicht unterstützt werden.
es: Los P/Invoke de un generador de código fuente omitirán cualquier configuración que no esté admitida.
fr: Les P/Invokes générés par la source ignorent toute configuration qui n’est pas prise en charge.
it: I P/Invoke generati dall'origine ignoreranno qualsiasi configurazione non supportata.
ja: ソース生成済みの P/Invoke は、サポートされていない構成を無視します。
ko: 소스 생성 P/Invoke는 지원되지 않는 구성을 무시합니다.
pl: Funkcja P/Invokes generowana przez źródło zignoruje każdą nieobsługiwaną konfigurację.
pt_br: P/Invokes gerados pela origem ignorarão qualquer configuração sem suporte.
ru: P/Invoke с созданием источника будут игнорировать все неподдерживаемые конфигурации.
tr: Kaynak tarafından oluşturulan P/Invokes desteklenmeyen yapılandırmaları yok sayar.
zh_hans: 源生成的 P/Invoke 将忽略任何不受支持的配置。
zh_hant: 来源產生的 P/Invokes 將會忽略任何不支援的設定。
