Repository: dotnet/runtime
Catalog: src/libraries/System.Runtime.InteropServices/gen/Common/Resources/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ConstantAndElementCountInfoDisallowed
source: Only one of 'ConstantElementCount' or 'ElementCountInfo' may be used in a 'MarshalUsingAttribute' for a given 'ElementIndirectionDepth'
cs: U atributu MarshalUsingAttribute pro daný ElementIndirectionDepth se může se použít jen jeden z prvků ConstantElementCount nebo ElementCountInfo
de: Nur eines von \"ConstantElementCount\" oder \"ElementCountInfo\" kann in einem \"MarshalUsingAttribute\" für ein angegebenes \"ElementIndirectionDepth\" verwendet werden.
es: De entre “ConstantElementCount” y “ElementCountInfo”, solo se puede usar uno de los dos en un “MarshalUsingAttribute” para un “ElementIndirectionDepth” determinado
fr: Un seul de « ConstantElementCount » ou « ElementCountInfo » peut être utilisé dans un « MarshalUsingAttribute » pour un « ElementIndirectionDepth » donné
it: In un elemento 'MarshalUsingAttribute' per un elemento 'ElementIndirectionDepth' specificato è possibile usare solo uno dei valori 'ConstantElementCount' o 'ElementCountInfo'
ja: 指定された 'ElementIndirectionDepth' 向けに 'MarshalUsingAttribute' で使用できるのは、'ConstantElementCount' または 'ElementCountInfo' のいずれか 1 つだけです
ko: 'ConstantElementCount' 또는 'ElementCountInfo' 중 하나만 지정된 'ElementIndirectionDepth'에 대한 'MarshalUsingAttribute'에서 사용할 수 있습니다.
pl: Tylko jedna z wartości „ConstantElementCount” lub element „ElementCountInfo” może być użyty w atrybucie „MarshalUsingAttribute” dla danego elementu „ElementIndirectionDepth”
pt_br: Somente um de 'ConstantElementCount' ou 'ElementCountInfo' pode ser usado em um 'MarshalUsingAttribute' para um determinado 'ElementIndirectionDepth'
ru: В \"MarshalUsingAttribute\" для заданного \"ElementIndirectionDepth\" можно использовать либо \"ConstantElementCount\", либо \"ElementCountInfo\".
tr: Belirli bir 'ElementIndirectionDepth' için 'MarshalUsingAttribute' içinde 'ConstantElementCount' veya 'ElementCountInfo' değerlerinden yalnızca biri kullanılabilir
zh_hans: 对于给定的 “ElementIndirectionDepth”，在 “MarshalUsingAttribute” 中只能使用 “ConstantElementCount” 或 “ElementCountInfo” 中的一个
zh_hant: 在指定的 'ElementIndirectionDepth' 的 'MarshalUsingAttribute' 中只能使用 'ConstantElementCount' 或 'ElementCountInfo' 其中之一

# ContainingTypeAccessibilityDetails
source: Containing type '{0}' has accessibility '{1}'.
cs: Obsahující typ „{0}“má přístupnost „{1}“.
de: Der Enthaltende Typ '{0}' verfügt über Barrierefreiheit '{1}'.
es: El tipo contenedor '{0}' tiene accesibilidad '{1}'.
fr: Le type conteneur '{0}' a une accessibilité '{1}'.
it: Il tipo contenitore '{0}' ha accessibilità '{1}'.
ja: 包含型 '{0}' にはアクセシビリティ '{1}' があります。
ko: '{0}' 형식을 포함하는 경우 접근성 '{1}'이(가) 있습니다.
pl: Zawierający typ „{0}” ma ułatwienia dostępu „{1}”.
pt_br: Contendo o tipo '{0}' tem acessibilidade '{1}'.
ru: Содержащий тип "{0}" обеспечивает уровень доступности "{1}".
tr: '{0}' kapsayan türü '{1}' erişilebilirlik özelliğine sahip.
zh_hans: 包含类型“{0}”具有可访问性“{1}”。
zh_hant: 包含的類型 '{0}' 具有存取範圍 '{1}'。

# ConvertComInterfaceMayProduceInvalidCode
source: Converting this interface to use 'GeneratedComInterfaceAttribute' may produce invalid code and may require additional work
cs: Převod tohoto rozhraní na generatedComInterfaceAttribute může způsobit neplatný kód a může vyžadovat další práci.
de: Das Konvertieren dieser Schnittstelle zur Verwendung von "GeneratedComInterfaceAttribute" erzeugt möglicherweise ungültigen Code und erfordert möglicherweise zusätzliche Arbeit.
es: Convertir esta interfaz para que use “GeneratedComInterfaceAttribute” puede producir código no válido y puede requerir trabajo adicional
fr: La conversion de cette interface pour utiliser 'GeneratedComInterfaceAttribute' peut produire un code invalide et peut nécessiter un travail supplémentaire
it: La conversione di questa interfaccia per l'uso di 'GeneratedComInterfaceAttribute' può produrre codice non valido e può richiedere lavoro aggiuntivo
ja: このインターフェイスを 'GeneratedComInterfaceAttribute' を使用するように変換すると、無効なコードが生成され、追加の作業が必要になる場合があります
ko: 이 인터페이스를 'GeneratedComInterfaceAttribute'를 사용하도록 변환하면 잘못된 코드가 생성될 수 있으며 추가 작업이 필요할 수 있습니다.
pl: Przekonwertowanie tego interfejsu w celu użycia atrybutu „GeneratedComInterfaceAttribute” może spowodować wygenerowanie nieprawidłowego kodu i może wymagać dodatkowej pracy
pt_br: Converter esta interface para usar 'GeneratedComInterfaceAttribute' pode produzir código inválido e pode exigir trabalho adicional
ru: Преобразование этого интерфейса для использования "GeneratedComInterfaceAttribute" может создать недопустимый код и потребовать дополнительной работы
tr: Bu arabirimin 'GeneratedComInterfaceAttribute' kullanmak üzere dönüştürülmesi geçersiz kod üretebilir ve ek çalışma gerektirebilir
zh_hans: 将此接口转换为使用“GeneratedComInterfaceAttribute”可能会产生无效代码，并且可能需要执行其他工作
zh_hant: 將此介面轉換為使用 'GeneratedComInterfaceAttribute' 可能會產生無效程式碼，而且可能需要額外作業

# ConvertNoPreserveSigDllImportToGeneratedMayProduceInvalidCode
source: Automatically converting a P/Invoke with 'PreserveSig' set to 'false' to a source-generated P/Invoke may produce invalid code
cs: Automatická konverze volání P/Invoke s PreserveSig nastaveným na hodnotu False na zdrojem generované volání P/Invoke může mít za následek neplatný kód.
de: Das automatische Konvertieren eines P/Invoke mit \"PreserveSig\" auf \"false\" in einen vom Quellcode generierten P/Invoke erzeugt möglicherweise ungültigen Code.
es: Convertir automáticamente un P/Invoke con “PreserveSig” establecido en “false” en un P/Invoke de un generador de código fuente puede producir código no válido
fr: La conversion automatique d’un P/Invoke avec « PreserveSig » défini sur « false » en P/Invoke généré par la source peut produire du code non valide
it: La conversione automatica di un P/Invoke con 'PreserveSig' impostato su 'false' in un P/Invoke generato dall'origine può produrre codice non valido
ja: 'PreserveSig' が 'false' に設定された P/Invoke をソース生成済みの P/Invoke に自動的に変換すると、無効なコードが生成される場合があります
ko: 'PreserveSig'가 'false'로 설정된 P/Invoke를 소스 생성 P/Invoke로 자동 변환하면 잘못된 코드가 생성될 수 있습니다.
pl: Automatyczne konwertowanie funkcji P/Invoke z parametrem „PreserveSig” ustawionym na wartość „false” na wygenerowaną przez źródło funkcję P/Invoke może spowodować utworzenie nieprawidłowego kodu
pt_br: Converter automaticamente um P/Invoke com 'PreserveSig' definido como 'false' em um P/Invoke gerado pela origem pode produzir código inválido
ru: Автоматическое преобразование P/Invoke с параметром \"PreserveSig\" со значением \"false\" в P/Invoke с созданием источника может привести к неправильному коду
tr: 'PreserveSig' değeri 'false' olarak ayarlanmış bir P/Invoke öğesini kaynak tarafından oluşturulan bir P/Invoke'a otomatik olarak dönüştürülmesi sonucunda geçersiz kod üretilebilir
zh_hans: 将 “PreserveSig” 设置为 “false” 的 P/Invoke 自动转换为源生成的 P/Invoke 可能会产生无效代码
zh_hant: 將 'PreserveSig' 設為 'false' 的 P/Invoke 自動轉換來源產生的 P/Invoke 可能會產生無效的程式碼

# ConvertToGeneratedComInterfaceAddUnsafe
source: Convert to 'GeneratedComInterface' and allow unsafe code
cs: Převést na GeneratedComInterface a povolit nebezpečný kód
de: In "GeneratedComInterface" konvertieren und unsicheren Code zulassen
es: Convertir en "GeneratedComInterface" y permitir código no seguro
fr: Convertir en 'GeneratedComInterface' et autoriser le code non sécurisé
it: Converti in 'GeneratedComInterface' e consenti codice non gestito
ja: 'GeneratedComInterface' に変換し、安全でないコードを許可する
ko: 'GeneratedComInterface'로 변환하고 안전하지 않은 코드 허용
pl: Konwertuj na element „GeneratedComInterface” i zezwalaj na niebezpieczny kod
pt_br: Converter para 'GeneratedComInterface' e permitir código não seguro
ru: Преобразовать в "GeneratedComInterface" и разрешить небезопасный код
tr: 'GeneratedComInterface'e dönüştürün ve güvenli olmayan koda izin verin
zh_hans: 转换为“GeneratedComInterface”并允许不安全的代码
zh_hant: 轉換為 'GeneratedComInterface' 並允許不安全的程式碼

# ConvertToGeneratedComInterfaceDescription
source: Use 'GeneratedComInterfaceAttribute' instead of 'ComImportAttribute' to generate COM marshalling code at compile time
cs: Pokud chcete vygenerovat kód zařazování modelu COM při kompilaci, použijte atribut GeneratedComInterfaceAttribute místo ComImportAttribute.
de: Verwenden Sie "GeneratedComInterfaceAttribute" anstelle von "ComImportAttribute", um COM-Marshallingcode zur Kompilierzeit zu generieren.
es: Usar “GeneratedComInterfaceAttribute” en lugar de “ComImportAttribute” para generar código de serialización COM en tiempo de compilación
fr: Utilisez 'GeneratedComInterfaceAttribute' au lieu de 'ComImportAttribute' pour générer le code de marshaling COM au moment de la compilation
it: Usare 'GeneratedComInterfaceAttribute' invece di 'ComImportAttribute' per generare codice di marshalling COM in fase di compilazione
ja: コンパイル時に COM マーシャリング コードを生成するには、'ComImportAttribute' ではなく 'GeneratedComInterfaceAttribute' を使用します
ko: 컴파일 시간에 COM 마샬링 코드를 생성하려면 'ComImportAttribute' 대신 'GeneratedComInterfaceAttribute'를 사용하세요.
pl: Użyj atrybutu „GeneratedComInterfaceAttribute” zamiast „ComImportAttribute”, aby wygenerować kod marshallingu modelu COM w czasie kompilacji
pt_br: Use 'GeneratedComInterfaceAttribute' em vez de 'ComImportAttribute' para gerar código de empacotamento COM em tempo de compilação
ru: Используйте "GeneratedComInterfaceAttribute" вместо "ComImportAttribute" для создания кода маршалирования COM во время компиляции
tr: Derleme zamanında COM hazırlayıcı kodunu oluşturmak için 'ComImportAttribute' yerine 'GeneratedComInterfaceAttribute' kullanın
zh_hans: 使用“GeneratedComInterfaceAttribute”而不是“ComImportAttribute”以在编译时生成 COM 封送代码
zh_hant: 使用 GeneratedComInterfaceAttribute' (而非 'ComImportAttribute') 以於編譯時間產生 COM 封送處理程式碼

# ConvertToGeneratedComInterfaceMayRequireCustomMarshalling
source: Converting this API to 'GeneratedComInterfaceAttribute' will require additional code to provide custom marshallers for some parameters.
cs: Převod tohoto rozhraní API na GeneratedComInterfaceAttribute bude vyžadovat další kód, který poskytne vlastní zařazovače pro některé parametry.
de: Zum Konvertieren dieser API in "GeneratedComInterfaceAttribute" ist zusätzlicher Code erforderlich, um benutzerdefinierte Marshaller für einige Parameter bereitzustellen.
es: La conversión de esta API a “GeneratedComInterfaceAttribute” requerirá código adicional para proporcionar serializadores personalizados para algunos parámetros.
fr: La conversion de cette API en "GeneratedComInterfaceAttribute" nécessitera du code supplémentaire pour fournir des marshallers personnalisés pour certains paramètres.
it: La conversione di questa API in 'GeneratedComInterfaceAttribute' richiederà codice aggiuntivo per fornire marshaller personalizzati per alcuni parametri.
ja: この API を 'GeneratedComInterfaceAttribute' に変換するには、一部のパラメーターにカスタム マーシャラーを提供するために追加のコードが必要です。
ko: 이 API를 'GeneratedComInterfaceAttribute'로 변환하려면 일부 매개 변수에 대한 사용자 지정 마샬러를 제공하는 추가 코드가 필요합니다.
pl: Przekonwertowanie tego interfejsu API na atrybut „GeneratedComInterfaceAttribute” będzie wymagać dodatkowego kodu w celu udostępnienia niestandardowych organizatorów dla niektórych parametrów.
pt_br: A conversão desta API para 'GeneratedComInterfaceAttribute' exigirá código adicional para fornecer empacotadores personalizados para alguns parâmetros.
ru: Преобразование этого API в "GeneratedComInterfaceAttribute" потребует дополнительного кода для предоставления настраиваемых маршалеров для некоторых параметров.
tr: Bu API'yi 'GeneratedComInterfaceAttribute'e dönüştürmek, bazı parametreler için özel hazırlayıcılar sağlamak üzere ek kod gerektirecektir.
zh_hans: 将此 API 转换为“GeneratedComInterfaceAttribute”将需要其他代码来为某些参数提供自定义封送程序。
zh_hant: 將此 API 轉換為 'GeneratedComInterfaceAttribute' 需要額外的程式碼，才能提供某些參數的自訂封送處理器。

# ConvertToGeneratedComInterfaceMessage
source: Mark the type '{0}' with 'GeneratedComInterfaceAttribute' instead of 'ComImportAttribute' to generate COM marshalling code at compile time
cs: Pokud chcete vygenerovat kód zařazování modelu COM při kompilaci, označte typ {0} atributem GeneratedComInterfaceAttribute místo ComImportAttribute.
de: Markieren Sie den Typ "{0}" mit "GeneratedComInterfaceAttribute" anstelle von "ComImportAttribute", um COM-Marshallingcode zur Kompilierzeit zu generieren.
es: Marcar el tipo “{0}” con “GeneratedComInterfaceAttribute” en lugar de “ComImportAttribute” para generar código de serialización COM en tiempo de compilación
fr: Marquez le type '{0}' avec 'GeneratedComInterfaceAttribute' au lieu de 'ComImportAttribute' pour générer le code de marshaling COM au moment de la compilation
it: Contrassegnare il tipo '{0}' con 'GeneratedComInterfaceAttribute' invece di 'ComImportAttribute' per generare codice di marshalling COM in fase di compilazione
ja: コンパイル時に COM マーシャリング コードを生成するには、型 '{0}' を 'ComImportAttribute' ではなく 'GeneratedComInterfaceAttribute' でマークします
ko: 컴파일 시간에 COM 마샬링 코드를 생성하려면 'ComImportAttribute' 대신 'GeneratedComInterfaceAttribute'로 '{0}' 유형을 표시하세요.
pl: Oznacz typ „{0}” atrybutem „GeneratedComInterfaceAttribute” zamiast „ComImportAttribute”, aby wygenerować kod marshallingu modelu COM w czasie kompilacji
pt_br: Marque o tipo '{0}' com 'GeneratedComInterfaceAttribute' em vez de 'ComImportAttribute' para gerar o código de empacotamento COM em tempo de compilação
ru: Помечайте тип "{0}" с помощью "GeneratedComInterfaceAttribute" вместо "ComImportAttribute" для создания кода маршалирования COM во время компиляции
tr: Derleme zamanında COM hazırlayıcı kodunu oluşturmak için "ComImportAttribute" yerine "GeneratedComInterfaceAttribute" ile '{0}' türünü işaretleyin
zh_hans: 使用“GeneratedComInterfaceAttribute”而不是“ComImportAttribute”标记类型“{0}”，以便在编译时生成 COM 封送代码
zh_hant: 使用 GeneratedComInterfaceAttribute' (而非 'ComImportAttribute') 標記類型 '{0}'，以於編譯時間產生 COM 封送處理程式碼

# ConvertToGeneratedComInterfaceTitle
source: Convert to 'GeneratedComInterface'
cs: Převést na GeneratedComInterface
de: In "GeneratedComInterface" konvertieren
es: Convertir en “GeneratedComInterface”
fr: Convertir en 'GeneratedComInterface'
it: Converti in 'GeneratedComInterface'
ja: 'GeneratedComInterface' に変換する
ko: 'GeneratedComInterface'로 변환
pl: Konwertowanie na element „GeneratedComInterface”
pt_br: Converter para 'GeneratedComInterface'
ru: Преобразовать в "GeneratedComInterface"
tr: 'GeneratedComInterface'e Dönüştür
zh_hans: 转换为“GeneratedComInterface”
zh_hant: 轉換為 'GeneratedComInterface'

source: Convert to 'LibraryImport'
cs: Převést na LibraryImport
de: In "LibraryImport" konvertieren
es: Convertir en “LibraryImport”
fr: Convertir en « LibraryImport »
it: Converti in 'LibraryImport'
ja: 'LibraryImport' への変換
ko: 'LibraryImport'로 변환
pl: Konwertuj na element „LibraryImport”
pt_br: Converter em 'LibraryImport'
ru: Преобразовать в "LibraryImport"
tr: 'LibraryImport' olarak dönüştür
zh_hans: 转换为 “LibraryImport”
zh_hant: 轉換為 'LibraryImport'

# ConvertToLibraryImportAddUnsafe
source: Convert to 'LibraryImport' and enable unsafe code
cs: Převést na LibraryImport a povolit nebezpečný kód
de: Konvertieren Sie in „LibraryImport“, und aktivieren Sie unsicheren Code.
es: Convertir a 'LibraryImport' y habilitar código no seguro
fr: Convertir en 'LibraryImport' et activer le code non sécurisé
it: Converti in 'LibraryImport' e abilita codice non sicuro
ja: 'LibraryImport' に変換し、アンセーフ コードを有効にする
ko: 'LibraryImport'로 변환하고 안전하지 않은 코드 활성화
pl: Konwertuj na element „LibraryImport” i włącz niebezpieczny kod
pt_br: Converta em 'LibraryImport' e habilite código não seguro
ru: Преобразование в "LibraryImport" и включение небезопасного кода
tr: 'LibraryImport' türüne dönüştür ve güvenli olmayan kodu etkinleştir
zh_hans: 转换为 “LibraryImport” 并启用不安全代码
zh_hant: 轉換為 'LibraryImport'，並啟用不安全的程式碼

# ConvertToLibraryImportDescription
source: Use 'LibraryImportAttribute' instead of 'DllImportAttribute' to generate P/Invoke marshalling code at compile time
cs: K vygenerování kódu zařazování P/Invoke v době kompilace použijte LibraryImportAttribute místo DllImportAttribute
de: Verwenden Sie \"LibraryImportAttribute\" anstelle von \"DllImportAttribute\", um P/Invoke-Marshallingcode zur Kompilierzeit zu generieren.
es: Use “LibraryImportAttribute” en lugar de “DllImportAttribute” para generar código de serialización P/Invoke en el tiempo de compilación
fr: Utilisez « LibraryImportAttribute » à la place de « DllImportAttribute » pour générer du code de marshaling P/Invoke au moment de la compilation
it: Usare 'LibraryImportAttribute' invece di 'DllImportAttribute' per generare codice di marshalling di P/Invoke in fase di compilazione
ja: コンパイル時に P/Invoke マーシャリング コードを生成するには、'DllImportAttribute' の代わりに 'LibraryImportAttribute' を使用します
ko: 컴파일 타임에 P/Invoke 마샬링 코드를 생성하려면 'DllImportAttribute' 대신 'LibraryImportAttribute'를 사용하세요.
pl: Użyj elementu „LibraryImportAttribute” zamiast elementu „DllImportAttribute”, aby wygenerować kod skierowania funkcji P/Invoke w czasie kompilacji
pt_br: Use 'LibraryImportAttribute' em vez de 'DllImportAttribute' para gerar código de marshalling P/Invoke no tempo de compilação
ru: Используйте \"LibraryImportAttribute\" вместо \"DllImportAttribute\" для генерирования кода маршализации P/Invoke во время компиляции
tr: P/Invoke sıralama kodunu derleme zamanında oluşturmak için 'DllImportAttribute' yerine 'LibraryImportAttribute' kullanın
zh_hans: 使用 “LibraryImportAttribute” 而不是 “DllImportAttribute” 在编译时生成 P/Invoke 封送代码
zh_hant: 使用 'LibraryImportAttribute' 而非 'DllImportAttribute' 在編譯時間產生 P/Invoke 封送處理程式碼

# ConvertToLibraryImportMayRequireCustomMarshalling
source: Converting this API to 'LibraryImport' will require additional code to provide custom marshallers for some parameters.
cs: Převod tohoto rozhraní API na LibraryImport bude vyžadovat další kód, který poskytne vlastní zařazovače pro některé parametry.
de: Zum Konvertieren dieser API in „LibraryImport“ ist zusätzlicher Code erforderlich, um benutzerdefinierte Marshaller für einige Parameter bereitzustellen.
es: La conversión de esta API a 'LibraryImport' requerirá código adicional para proporcionar serializadores personalizados para algunos parámetros.
fr: La conversion de cette API en 'LibraryImport' nécessite du code supplémentaire pour fournir des marshaleurs personnalisés pour certains paramètres.
it: La conversione di questa API in 'LibraryImport' richiederà codice aggiuntivo per fornire gestori di marshalling personalizzati per alcuni parametri.
ja: この API を 'LibraryImport' に変換するには、一部のパラメーターにカスタム マーシャラーを提供するために追加のコードが必要です。
ko: 이 API를 'LibraryImport'로 변환하려면 일부 매개 변수에 대한 사용자 지정 마샬러를 제공하기 위한 추가 코드가 필요합니다.
pl: Przekonwertowanie tego interfejsu API na element „LibraryImport” będzie wymagać dodatkowego kodu w celu udostępnienia niestandardowych poleceń dla niektórych parametrów.
pt_br: Converter essa API em 'LibraryImport' exigirá código adicional para fornecer marshallers personalizados para alguns parâmetros.
ru: Преобразование этого API в "LibraryImport" потребует дополнительного кода для предоставления настраиваемых маршалеров для некоторых параметров.
tr: Bu API'yi 'LibraryImport' olarak dönüştürmek, bazı parametreler için özel hazırlayıcılar sağlamak amacıyla ek kod gerektirir.
zh_hans: 将此 API 转换为 “LibraryImport” 将需要额外的代码来为某些参数提供自定义封送程序。
zh_hant: 將此 API 轉換為 'LibraryImport' 需要額外的程式碼，才能提供某些參數的自訂封送處理器。

# ConvertToLibraryImportMessage
source: Mark the method '{0}' with 'LibraryImportAttribute' instead of 'DllImportAttribute' to generate P/Invoke marshalling code at compile time
cs: Označit metodu {0} pomocí LibraryImportAttribute místo DllImportAttribute, aby došlo k vygenerování kódu zařazování volání P/Invoke za kompilace.
de: Markieren Sie die Methode \"{0}\" mit \"LibraryImportAttribute\" anstelle von \"DllImportAttribute\", um zur Kompilierzeit P/Invoke-Marshallingcode zu generieren.
es: Marque el método “{0}” con “LibraryImportAttribute” en lugar de “DllImportAttribute” para generar código de serialización P/Invoke en el tiempo de compilación
fr: Marquer la méthode « {0} » avec « LibraryImportAttribute » à la place de « DllImportAttribute » pour générer du code de marshaling P/Invoke au moment de la compilation
it: Contrassegnare il metodo '{0}' con 'LibraryImportAttribute' invece di 'DllImportAttribute' per generare codice di marshalling di P/Invoke in fase di compilazione
ja: コンパイル時に P/Invoke マーシャリング コードを生成するには、'DllImportAttribute' の代わりに 'LibraryImportAttribute' を持つメソッド '{0}' をマークします
ko: 컴파일 타임에 P/Invoke 마샬링 코드를 생성하려면 'DllImportAttribute' 대신 'LibraryImportAttribute'를 사용하여 '{0}' 메서드를 표시하세요.
pl: Oznacz metodę „{0}” za pomocą elementu „LibraryImportAttribute” zamiast elementu „DllImportAttribute”, aby wygenerować kod skierowania funkcji P/Invoke w czasie kompilacji
pt_br: Marque o método '{0}' com 'LibraryImportAttribute' em vez de 'DllImportAttribute' para gerar código de marshaling P/Invoke em tempo de compilação
ru: Пометьте метод \"{0}\" атрибутом \"LibraryImportAttribute\" вместо \"DllImportAttribute\", чтобы генерировать код маршализации P/Invoke во время компиляции
tr: P/Invoke sıralama kodunu derleme zamanında oluşturmak için '{0}' metodunu, 'DllImportAttribute' yerine 'LibraryImportAttribute' ile işaretleyin
zh_hans: 使用 “LibraryImportAttribute” 而不是 “DllImportAttribute” 标记方法“{0}”，以便在编译时生成 P/Invoke 封送代码
zh_hant: 以 'LibraryImportAttribute' 代替 'DllImportAttribute' 標示方法'{0}'，以在編譯時間產生 P/Invoke 封送處理程式碼

# ConvertToLibraryImportTitle
source: Use 'LibraryImportAttribute' instead of 'DllImportAttribute' to generate P/Invoke marshalling code at compile time
cs: K vygenerování kódu zařazování P/Invoke v době kompilace použijte LibraryImportAttribute místo DllImportAttribute
de: Verwenden Sie \"LibraryImportAttribute\" anstelle von \"DllImportAttribute\", um P/Invoke-Marshallingcode zur Kompilierzeit zu generieren.
es: Use “LibraryImportAttribute” en lugar de “DllImportAttribute” para generar código de serialización P/Invoke en el tiempo de compilación
fr: Utilisez « LibraryImportAttribute » à la place de « DllImportAttribute » pour générer du code de marshaling P/Invoke au moment de la compilation
it: Usare 'LibraryImportAttribute' invece di 'DllImportAttribute' per generare codice di marshalling di P/Invoke in fase di compilazione
ja: コンパイル時に P/Invoke マーシャリング コードを生成するには、'DllImportAttribute' の代わりに 'LibraryImportAttribute' を使用します
ko: 컴파일 타임에 P/Invoke 마샬링 코드를 생성하려면 'DllImportAttribute' 대신 'LibraryImportAttribute'를 사용하세요.
pl: Użyj elementu „LibraryImportAttribute” zamiast elementu „DllImportAttribute”, aby wygenerować kod skierowania funkcji P/Invoke w czasie kompilacji
pt_br: Use 'LibraryImportAttribute' em vez de 'DllImportAttribute' para gerar código de marshalling P/Invoke no tempo de compilação
ru: Используйте \"LibraryImportAttribute\" вместо \"DllImportAttribute\" для генерирования кода маршализации P/Invoke во время компиляции
tr: P/Invoke sıralama kodunu derleme zamanında oluşturmak için 'DllImportAttribute' yerine 'LibraryImportAttribute' kullanın
zh_hans: 使用 “LibraryImportAttribute” 而不是 “DllImportAttribute” 在编译时生成 P/Invoke 封送代码
zh_hant: 使用 'LibraryImportAttribute' 而非 'DllImportAttribute' 在編譯時間產生 P/Invoke 封送處理程式碼

# ConvertToLibraryImportWithSuffix
source: Convert to 'LibraryImport' with '{0}' suffix
cs: Převést na LibraryImport s příponou {0}
de: In \"LibraryImport\" mit Suffix \"{0}\" konvertieren
es: Convertir a “LibraryImport” con sufijo “{0}”
fr: Convertir en « LibraryImport » avec suffixe « {0} »
it: Converti in 'LibraryImport' con il suffisso '{0}'
ja: '{0}' サフィックスを持つ 'LibraryImport' への変換
ko: '{0}' 접미사가 있는 'LibraryImport'로 변환
pl: Konwertuj na element „LibraryImport” z sufiksem „{0}”
pt_br: Converter em 'LibraryImport' com '{0}' sufixo
ru: Преобразовать в \"LibraryImport\" с суффиксом \"{0}\"
tr: '{0}' soneki ile 'LibraryImport' olarak dönüştür
zh_hans: 转换为带“{0}”后缀的 “LibraryImport”
zh_hant: 轉換為具有 '{0}'後綴的 'LibraryImport'
