Repository: dotnet/runtime
Catalog: src/libraries/System.Runtime.InteropServices/gen/Common/Resources/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# TypeNotSupportedMessageReturnLibraryImport
source: The type '{0}' is not supported by source-generated P/Invokes. The generated source will not handle marshalling of the return value of method '{1}'.
cs: Typ {0} nepodporují zdrojem generovaná volání P/Invokes. Vygenerovaný zdroj nebude zpracovávat zařazování návratové hodnoty metody {1}.
de: Der Typ \"{0}\" wird von vom Quellcode generierten P/Invokes nicht unterstützt. Die generierte Quelle verarbeitet das Marshalling des Rückgabewerts der Methode \"{1}\" nicht.
es: El tipo “{0}” no es compatible con P/Invokes de un generador de código fuente. El código fuente generado no controlará la serialización del valor devuelto del método “{1}”.
fr: Le type « {0} » n’est pas pris en charge par les P/Invokes générés par la source. La source générée ne gère pas le marshaling de la valeur de retour de la méthode « {1} ».
it: Il tipo '{0}' non è supportato dai P/Invoke generati dall'origine. L'origine generata non gestirà il marshalling del valore restituito del metodo '{1}'.
ja: 型 '{0}' は、ソース生成済みの P/Invoke ではサポートされていません。生成されたソースは、メソッド '{1}' の戻り値のマーシャリングを処理しません。
ko: 형식 '{0}'은(는) 소스 생성 P/Invoke에서 지원되지 않습니다. 생성된 소스는 '{1}' 메서드의 반환 값 마샬링을 처리하지 않습니다.
pl: Typ „{0}” nie jest obsługiwany przez funkcję P/Invokes generowaną przez źródło. Wygenerowane źródło nie obsługuje skierowania wartości zwracanej przez metodę „{1}”.
pt_br: O tipo '{0}' não é suportado por P/Invokes gerados pela origem. A origem gerada não tratará marshaling do valor de retorno do método '{1}'.
ru: Тип \"{0}\" не поддерживается в P/Invoke с созданием источника. Созданный источник не будет обрабатывать маршализацию возвращаемого значения метода \"{1}\".
tr: '{0}' türü, kaynak tarafından oluşturulan P/Invokes tarafından desteklenmiyor. Oluşturulan kaynak, '{1}' metodunun dönüş değerinin sıralamasını işlemez.
zh_hans: 源生成的 P/Invoke 不支持“{0}”类型。生成的源将不处理方法“{1}”的返回值的封送。
zh_hant: 来源產生的 P/Invokes 不支援類型 '{0}'。產生的來源將不會處理方法 '{1}' 的傳回值排列。

# TypeNotSupportedMessageReturnWithDetails
source: {0} The generated source will not handle marshalling of the return value of method '{1}'.
cs: {0} Generovaný zdroj nebude zpracovávat zařazování návratové hodnoty metody {1}.
de: {0} Die generierte Quelle verarbeitet das Marshalling des Rückgabewerts der Methode \"{1}\" nicht.
es: {0} El código fuente generado no controlará la serialización del valor devuelto del método “{1}”.
fr: {0} La source générée ne gère pas le marshaling de la valeur de retour de la méthode « {1} ».
it: {0} L'origine generata non gestirà il marshalling del valore restituito del metodo '{1}'.
ja: {0} 生成されたソースは、メソッド '{1}' の戻り値のマーシャリングを処理しません。
ko: {0} 생성된 소스는 '{1}' 메서드의 반환 값 마샬링을 처리하지 않습니다.
pl: {0}Wygenerowane źródło nie obsługuje skierowania wartości zwracanej przez metodę „{1}”.
pt_br: {0} A origem gerada não manipulará o marshalling do valor retornado do método '{1}'.
ru: {0} Созданный источник не будет обрабатывать маршализацию возвращаемого значения метода \"{1}\".
tr: {0} Oluşturulan kaynak, '{1}' metodunun dönüş değerinin sıralamasını işlemez.
zh_hans: {0} 生成的源将不处理方法“{1}”的返回值的封送。
zh_hant: {0} 產生的來源將不會處理方法 '{1}' 之傳回值的排列。

# TypeNotSupportedTitle
source: Specified type is not supported by source-generated P/Invokes
cs: Určený typ nepodporují zdrojem generovaná volání P/Invokes.
de: Der angegebene Typ wird von quellgenerierten P/Invokes nicht unterstützt.
es: El tipo especificado no está admitido por P/Invokes de un generador de código fuente
fr: Le type spécifié n’est pas prise en charge par les P/Invokes générés par la source.
it: Il tipo specificato non è supportato dai P/Invoke generati dall'origine
ja: 指定された型は、ソースで生成された P/Invoke ではサポートされていません
ko: 지정된 형식은 소스 생성 P/Invoke에서 지원되지 않습니다.
pl: Określony typ nie jest obsługiwany przez funkcję P/Invokes generowaną przez źródło
pt_br: O tipo especificado não tem suporte de P/Invokes gerados pela origem.
ru: Указанный тип не поддерживается в P/Invoke с созданием источника.
tr: Belirtilen tür, kaynak tarafından oluşturulan P/Invokes tarafından desteklenmiyor
zh_hans: 源生成的 P/Invoke 不支持指定的类型
zh_hant: 来源產生的 P/Invokes 不支援指定的類型。

# TypeNotSupportedTitleCom
source: Specified type is not supported by source-generated COM
cs: Zadaný typ není podporován modelem COM generovaným zdrojem.
de: Der angegebene Typ wird vom quellgenerierten COM nicht unterstützt.
es: El tipo especificado no es compatible con COM generado por el origen
fr: Le type spécifié n’est pas pris en charge par com généré par la source
it: Il tipo specificato non è supportato da COM generati dall'origine
ja: 指定された型は、ソース生成済みの COM ではサポートされていません
ko: 지정된 형식은 원본 생성 COM에서 지원되지 않습니다.
pl: Określony typ nie jest obsługiwany przez źródłowy COM
pt_br: Um COM gerado pela origem não dá suporte ao tipo especificado.
ru: Указанный тип не поддерживается моделью COM генератора исходного кода.
tr: Belirtilen tür, kaynak tarafından oluşturulan COM tarafından desteklenmiyor
zh_hans: 源生成的 COM 不支持指定的类型
zh_hant: 来源產生的 COM 不支援指定的類型。

# UnmanagedToManagedMissingRequiredMarshaller
source: The specified parameter needs to be marshalled from unmanaged to managed, but the marshaller type '{0}' does not support it.
cs: Určený parametr musí být zařazený z nespravovaného do spravovaného, ale zařazovací typ {0} to nepodporuje.
de: Der angegebene Parameter muss von nicht verwaltet zu verwaltet gemarshallt werden, aber der Marshaller-Typ ‚{0}‘ unterstützt dies nicht.
es: El parámetro especificado debe serializarse de no administrado a administrado, pero el tipo serializador “{0}” no lo admite.
fr: Le paramètre spécifié doit être marshalé de non managé à managé, mais le type marshaleur « {0} » ne le prend pas en charge.
it: È necessario effettuare il marshalling del parametro specificato da non gestito a gestito, ma il tipo di gestore del marshalling '{0}' non lo supporta.
ja: 指定されたパラメーターはアンマネージドからマネージドにマーシャリングする必要がありますが、マーシャラー型 '{0}' ではそれはサポートされていません。
ko: 지정된 매개 변수를 비관리에서 관리로 마샬링해야 하지만 마샬러 유형 '{0}'이(가) 지원하지 않습니다.
pl: Określony parametr musi być kierowany z niezarządzanego do zarządzanego, ale typ marszałka „{0}” go nie obsługuje.
pt_br: O parâmetro especificado precisa ser marshalled de não gerenciado para gerenciado, mas o tipo de marshaller '{0}' não dá suporte a ele.
ru: Указанный параметр необходимо маршалировать из неуправляемого в управляемый, но тип маршаллера "{0}" не поддерживает это.
tr: Belirtilen parametrenin yönetilmeyenden yönetilene doğru hazırlanması gerekiyor, ancak '{0}' hazırlayıcı türü bunu desteklemiyor.
zh_hans: 需要将指定的参数从非托管封送到托管，但封送程序类型“{0}”不支持它。
zh_hant: 指定的參數必須從非受控封送處理到受控，但封送處理程式類型 '{0}' 不支援。

# UnnecessaryMarshallingInfoDescription
source: Unnecesssary marshalling info was provided. This marshalling information can be removed without any change in behavior to the application.
cs: Poskytly se neúmyslné informace o zařazování. Tyto informace o zařazování lze odebrat bez jakékoli změny chování aplikace.
de: Es wurden nicht benötigte Marshallinginformationen angegeben. Diese Marshallinginformationen können entfernt werden, ohne dass sich das Verhalten der Anwendung ändert.
es: Se proporcionó información de serialización innecesaria. Esta información de serialización se puede quitar sin ningún cambio en el comportamiento de la aplicación.
fr: Des informations de triage inutiles ont été fournies. Ces informations de regroupement peuvent être supprimées sans aucune modification du comportement de l'application.
it: Sono state specificate informazioni di marshalling non necessarie. Queste informazioni di marshalling possono essere rimosse senza alcuna modifica nel comportamento dell'applicazione.
ja: 不要なマーシャリング情報が提供されました。このマーシャリング情報は、アプリケーションの動作を変更することなく削除できます。
ko: 불필요한 마샬링 정보가 제공되었습니다. 애플리케이션의 동작을 변경하지 않고 이 마샬링 정보를 제거할 수 있습니다.
pl: Niepotrzebne informacje o marshallingu zostały przekazane. Te informacje o marshallingu można usunąć bez żadnych zmian w zachowaniu aplikacji.
pt_br: Informações desnecessárias de organização foram fornecidas. Essas informações de empacotamento podem ser removidas sem qualquer alteração no comportamento do aplicativo.
ru: Указаны ненужные сведения маршалирования. Эти сведения маршалирования можно удалить без каких-либо изменений в работе приложения.
tr: Gereksiz sıralama bilgileri sağlandı. Bu sıralama bilgileri, uygulama davranışında herhangi bir değişiklik olmadan kaldırılabilir.
zh_hans: 提供了不必要的封送信息。可移除此封装信息，而不对应用程序的行为进行任何更改。
zh_hant: 已提供不必要的封送資訊。您可以移除此封送資訊，而不會對應用程式進行任何行為變更。

# UnnecessaryMarshallingInfoTitle
source: Unnecessary marshalling info was provided and can be removed.
cs: Byly poskytnuté nepotřebné informace o zařazování a dají se odebrat.
de: Es wurden nicht benötigte Marshallinginformationen angegeben, die entfernt werden können.
es: Se proporcionó información de serialización innecesaria y se puede quitar.
fr: Des informations de rassemblement inutiles ont été fournies et peuvent être supprimées.
it: Sono state fornite informazioni di marshalling non necessarie e possono essere rimosse.
ja: 不要なマーシャリング情報が指定されたため、削除できます。
ko: 불필요한 마샬링 정보가 제공되었으며 제거할 수 있습니다.
pl: Niepotrzebne informacje o marshallingu zostały przekazane i można je usunąć.
pt_br: Informações de organização desnecessárias foram fornecidas e podem ser removidas.
ru: Указаны ненужные сведения маршалирования, которые можно удалить.
tr: Gereksiz sıralama bilgileri sağlandı ve kaldırılabilir.
zh_hans: 提供了不必要的封送信息，可将此信息移除。
zh_hant: 已提供不必要的封送資訊，而且可以移除。

# UnnecessaryParameterMarshallingInfoMessage
source: Unnecessary marshalling info '{0}' was provided for parameter '{1}'. {2}
cs: Byly poskytnuty zbytečné informace o zařazování {0} pro parametr {1}. {2}
de: Für den Parameter "{1}" wurden unnötige Marshallinginformationen "{0}" bereitgestellt. {2}
es: Se proporcionó información de serialización innecesaria '{0}' para el parámetro '{1}'. {2}
fr: Des informations de regroupement inutiles '{0}' ont été fournies pour le paramètre '{1}'. {2}
it: Sono state fornite informazioni di mashalling '{0}' non necessarie per il parametro '{1}'. {2}
ja: パラメーター '{0}' に不要なマーシャリング情報 '{1}' が指定されました。{2}
ko: 불필요한 마샬링 정보 '{0}'이(가) 매개 변수 '{1}'에 제공되었습니다. {2}
pl: Niepotrzebne informacje o marshallingu „{0}” zostały przekazane dla parametru „{1}”. {2}
pt_br: Informações de organização desnecessárias '{0}' foram fornecidas para o parâmetro '{1}'. {2}
ru: Указаны ненужные сведения маршалирования "{0}" для параметра "{1}". {2}
tr: '{1}' parametresi için gereksiz '{0}' sıralama bilgisi sağlandı. {2}
zh_hans: 为参数“{0}”提供了不必要的封送信息“{1}”。{2}
zh_hant: 已為參數 '{0}' 提供了不必要的封送資訊 '{1}'。{2}

# UnnecessaryReturnMarshallingInfoMessage
source: Unnecessary marshalling info '{0}' was provided for the return type of method '{1}'. {2}
cs: Byly poskytnuty zbytečné informace o zařazování {0} pro návratový typ metody {1}. {2}
de: Für den Rückgabetyp der Methode "{1}" wurden unnötige Marshallinginformationen "{0}" bereitgestellt. {2}
es: Se proporcionó información de serialización innecesaria '{0}' para el tipo de valor devuelto del método '{1}'. {2}
fr: Des informations de regroupement inutiles '{0}' ont été fournies pour le type de retour de la méthode '{1}'. {2}
it: Sono state fornite informazioni di mashalling '{0}' non necessarie per il tipo restituito del metodo '{1}'. {2}
ja: メソッド '{0}' の戻り値の型に不要なマーシャリング情報 '{1}' が指定されました。{2}
ko: 불필요한 마샬링 정보 '{0}'이(가) '{1}' 메서드 반환 형식에 제공되었습니다. {2}
pl: Niepotrzebne informacje o marshallingu „{0}” zostały przekazane dla zwracanego typu metody „{1}”. {2}
pt_br: Informações de organização desnecessárias '{0}' foram fornecidas para o tipo de retorno do método '{1}'. {2}
ru: Указаны ненужные сведения маршалирования "{0}" для типа возвращаемого значения метода "{1}". {2}
tr: '{1}' yönteminin dönüş türü için gereksiz '{0}' sıralama bilgisi sağlandı. {2}
zh_hans: 为方法“{0}”的返回类型提供了不必要的封送信息“{1}”。{2}
zh_hant: 已為方法 '{0}' 的傳回類型提供了不必要的封送資訊 '{1}'。{2}

# ValueInCallerAllocatedBufferRequiresSpanConstructorDescription
source: A 'Value'-kind native type that supports the 'CallerAllocatedBuffer' feature must provide a two-parameter constructor taking the managed type and a 'Span' of an 'unmanaged' type as parameters
cs: Nativní typ druhu Value, který podporuje funkci CallerAllocatedBuffer, musí poskytovat dvouparametrový konstruktor přebírající spravovaný prvek a hodnotu Span jako parametry.
de: Ein nativer Typ „Value“, der das Feature „CallerAllocatedBuffer“ unterstützt, muss einen Konstruktor mit zwei Parametern bereitstellen, der den verwalteten Typ und „Span“ eines „Unmanaged“-Typs als Parameter verwendet.
es: Un tipo nativo de tipo \"Value\" que admita la característica \"CallerAllocatedBuffer\" debe proporcionar un constructor de dos parámetros que tome el tipo administrado y un \"Span\" de un tipo \"no administrado\" como parámetros
fr: Un type natif de type «Value» qui prend en charge la fonctionnalité «CallerAllocatedBuffer» doit fournir un constructeur à deux paramètres prenant le type managé et un « Span » d’un type « non géré » comme paramètres
it: Un tipo nativo di tipo 'Value' che supporta la funzionalità 'CallerAllocatedBuffer' deve fornire un costruttore a due parametri che accetta il tipo gestito e un 'Span' di un tipo 'non gestito' come parametri
ja: 'CallerAllocatedBuffer' 機能をサポートする 'Value' のネイティブ型では、マネージド型と 'アンマネージド' 型の 'Span' をパラメーターとして受け取る 2 つのパラメーター コンストラクターを指定する必要があります
ko: 'CallerAllocatedBuffer' 기능을 지원하는 '값' 종류의 네이티브 형식은 관리되는 형식과 '관리되지 않는' 형식의 'Span'을 매개 변수로 사용하는 두 개의 매개 변수 생성자를 제공해야 합니다.
pl: Typ natywny rodzaju „Value”, który obsługuje funkcję „CallerAllocatedBuffer” musi zapewniać konstruktora z dwoma parametrami przyjmującego typ zarządzany i wartość „Span” typu „unmanaged” jako parametry
pt_br: Um tipo nativo do tipo 'Value' que dá suporte ao recurso 'CallerAllocatedBuffer' deve fornecer um construtor de dois parâmetros usando o tipo gerenciado e um 'Span' de um tipo 'não gerenciado' como parâmetros
ru: Собственный тип вида \"Value\", который поддерживает функцию \"CallerAllocatedBuffer\", должен предоставлять конструктор с двумя параметрами: управляемый тип и \"Span неуправляемого типа\"
tr: 'CallerAllocatedBuffer' özelliğini destekleyen bir 'Value' tipi yerel türün, yönetilen türü ve 'unmanaged' türünün 'Span' değerini parametre olarak alan iki parametreli bir oluşturucu sağlaması gerekir
zh_hans: 支持 \"CallerAllocatedBuffer\" 功能的 \"Value\" 种类本机类型必须提供以托管类型和“非管理”类型的 \"Span\" 作为参数的双参数构造函数
zh_hant: 支援 'CallerAllocatedBuffer' 功能的 'Value'-kind 原生類型必須提供接受受管理類型的雙參數建構函示，以及以 'unmanaged' 類型的 'Span' 作為參數

# ValueInCallerAllocatedBufferRequiresSpanConstructorMessage
source: The type '{0}' specifies that it supports 'In' marshalling with the 'CallerAllocatedBuffer' feature for '{1}' but does not provide a two-parameter constructor that takes a '{1}' and 'Span' of an 'unmanaged' type as parameters
cs: Typ {0} určuje, že podporuje zařazování In s funkcí CallerAllocatedBuffer pro {1}, ale neposkytuje dvouparametrový konstruktor, který přebírá {1} a Span jako parametry.
de: Der Typ '{0}' gibt an, dass er 'In'-Marshalling mit der 'CallerAllocatedBuffer'-Funktion für '{1}' unterstützt, stellt aber keinen Konstruktor mit zwei Parametern bereit, der '{1}' und 'Span' eines 'nicht verwalteten' Typs als Parameter akzeptiert
es: El tipo “{0}” especifica que admite serializar “In” con la característica “CallerAllocatedBuffer” para “{1}” pero no provee un constructor de dos parámetro que tome un “{1}” y un “Span” de un tipo “no administrado” como parámetros
fr: Le type « {0} » spécifie qu’il prend en charge le marshaling «In» avec la fonctionnalité «CallerAllocatedBuffer» pour « {1} » mais ne fournit pas de constructeur à deux paramètre qui accepte un « {1} » et « Span » d’un type « non géré » comme paramètres.
it: Il tipo '{0}' specifica che supporta il marshalling 'In' con la funzionalità 'CallerAllocatedBuffer' per '{1}' ma non fornisce un costruttore con due parametri che accetta '{1}' e 'Span' di un tipo 'non gestito' come parametri
ja: 型 '{0}' は、'{1}' の 'CallerAllocatedBuffer' 機能を使用した 'In' マーシャリングをサポートすることを指定していますが、'{1}' と 'アンマネージド' 型の 'Span' をパラメーターとして受け取る、2 つのパラメーター コンストラクターを指定しません
ko: 형식 '{0}은(는) '{1}에 대한 'CallerAllocatedBuffer' 기능으로 'In' 마샬링을 지원하도록 지정하지만 '{1} 및 '관리되지 않는' 형식의 'Span'을 매개 변수로 사용하는 2개의 매개 변수 생성자는 제공하지 않습니다.
pl: Typ „{0}” określa, że obsługuje marshalling „In” z funkcją „CallerAllocatedBuffer” dla elementu „{1}”, ale nie zapewnia konstruktora z dwoma parametrami, który przyjmuje wartośći „{1}””Span” typu „unmanaged” jako parametry
pt_br: O tipo '{0}' especifica que ele dá suporte ao marshalling 'In' com o recurso 'CallerAllocatedBuffer' para '{1}', mas não fornece um construtor de dois parâmetro que usa um '{1}' e 'Span' de um tipo 'não gerenciado' como parâmetros
ru: Тип ''{0}'' указывает, что он поддерживает сортировку ''In'' с функцией ''CallerAllocatedBuffer'' для ''{1}'', но не предоставляет конструктор с двумя параметрами, который принимает ''{1}'' и 'Span' типа ''unmanaged'' в качестве параметров
tr: '{0}' türünde '{1}' için 'CallerAllocatedBuffer' özelliğiyle 'In' sıralamasının desteklendiği belirtiliyor, ancak parametre olarak '{1}' ve 'unmanaged' türünün 'Span' değerlerini alan iki parametreli bir oluşturucu sağlanmıyor
zh_hans: 类型“{0}”指定它支持使用“{1}”的 “CallerAllocatedBuffer” 功能进行 “In” 封送，但不提供以“{1}”和“非管理”类型的 “Span” 作为参数的双参数构造函数
zh_hant: 類型 '{0}' 指定其支援使用 'CallerAllocatedBuffer' 功能為 '{1}' 的 'In' 封送處理，但不提供接受 '{1}' 的二參數構建函式，以及以 'unmanaged' 類型的 'Span' 作為參數

# ValueInRequiresOneParameterConstructorDescription
source: A 'Value'-kind native type must provide a one-parameter constructor taking the managed type as a parameter
cs: Nativní typ druhu „Value“ musí poskytovat jednoparametrový konstruktor přebírající spravovaný typ jako parametr
de: Ein nativer Typ vom Typ \"Value\" muss einen Konstruktor mit einem Parameter bereitstellen, der den verwalteten Typ als Parameter akzeptiert.
es: Un tipo nativo de variante “Value” debe proporcionar un constructor de un solo parámetro tomando el tipo administrado como parámetro
fr: Un type natif de type « Value » doit fournir un constructeur à un paramètre prenant le type managé en tant que paramètre
it: Un tipo nativo di tipo 'Value' deve fornire un costruttore a un parametro che accetta il tipo gestito come parametro
ja: 'Value' のネイティブ型は、マネージド型をパラメーターとして受け取る 1 つのパラメーター コンストラクターを指定する必要があります
ko: 'Value' 종류의 네이티브 형식은 관리 형식을 매개 변수로 사용하는 단일 매개 변수 생성자를 제공해야 합니다.
pl: Typ natywny rodzaju „Value” musi zapewniać konstruktora z jednym parametrem przyjmującego typ zarządzany jako parametr
pt_br: Um tipo nativo do tipo 'Value' deve fornecer um construtor de um parâmetro usando o tipo gerenciado como um parâmetro
ru: Собственный тип вида \"Value\" должен предоставлять конструктор с одним параметром: управляемый тип
tr: 'Value' tipi yerel türün, yönetilen türü parametre olarak alan tek parametreli bir oluşturucu sağlaması gerekir
zh_hans: “Value” 种类本机类型必须提供一个以托管类型作为参数的单参数构造函数
zh_hant: 'Value'-kind 原生類型必須提供以 Managed 類型作為參數的單一參數構建函式

# ValueInRequiresOneParameterConstructorMessage
source: The type '{0}' specifies that it supports 'In' marshalling of '{1}' but does not provide a one-parameter constructor that takes a '{1}' as a parameter
cs: Typ {0} konkrétně určuje, že podporuje zařazování „In“ pro {1}, ale neposkytuje jednoparametrový konstruktor, který přebírá {1} jako parametr
de: Der Typ \"{0}\" gibt an, dass er das In-Marshalling von \"{1}\" unterstützt, aber keinen Konstruktor mit einem Parameter bereitstellt, der \"{1}\" als Parameter akzeptiert.
es: El tipo “{0}” especifica que admite la serialización “In” de “{1}” pero no proporciona un constructor de un solo parámetro que tome un “{1}” como parámetro
fr: Le type « {0} » spécifie qu’il prend en charge le marshaling « In » de « {1} » mais ne fournit pas de constructeur à paramètre unique qui accepte un « {1} » comme paramètre
it: Il tipo '{0}' specifica che supporta il marshalling 'In' di '{1}' ma non fornisce un costruttore con un solo parametro che accetta '{1}' come parametro
ja: 型 '{0}' では、'{1}' の 'In' マーシャリングをサポートするように指定されていますが、'{1}' をパラメーターとして受け取る 1 つのパラメーター コンストラクターは指定されません
ko: 형식 '{0}'은(는) '{1}'의 'In' 마샬링을 지원하도록 지정하지만 '{1}'을(를) 매개 변수로 사용하는 단일 매개 변수 생성자는 제공하지 않습니다.
pl: Typ „{0}” określa, że obsługuje skierowanie „In” z elementu „{1}”, ale nie zapewnia konstruktora z jednym parametrem, który przyjmuje element „{1}” jako parametr
pt_br: O tipo '{0}' especifica que ele dá suporte ao marshalling 'In' do '{1}', mas não fornece um construtor de um parâmetro que recebe um '{1}' como um parâmetro
ru: Тип \"{0}\" указывает, что поддерживает маршализацию \"{1}\" в направлении \"внутрь, но не предоставляет конструктор, принимающий один параметр \"{1}\"
tr: '{0}' türü '{1}' için 'In' sıralamasını desteklediğini belirtiyor, ancak parametre olarak '{1}' değerini alan tek parametreli bir oluşturucu sağlamıyor
zh_hans: 类型“{0}”指定它支持“{1}”的 “In” 封送，但不提供将“{1}”作为参数的单参数构造函数
zh_hant: 類型 '{0}'指定它支援 'In' 封送'{1}'，但不提供以'{1}'作為參數的單一參數建構函式
