Repository: dotnet/runtime
Catalog: src/libraries/System.Runtime.InteropServices/gen/Common/Resources/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# InAttributeOnlyIsDefault
source: The '[In]' attribute is not necessary unless the '[Out]' attribute is also used. The behavior of the '[In]' attribute without the '[Out]' attribute is the same as the default behavior.
cs: Atribut „[In]“ není nezbytný, pokud není použit také atribut „[Out]“. Chování atributu „[In]“ bez atributu „[Out]“ je stejné, jako výchozí chování.
de: Das [In]-Attribut ist nur erforderlich, wenn auch das [Out]-Attribut verwendet wird. Das Verhalten des [In]-Attributs ohne das [Out]-Attribut entspricht dem Standardverhalten.
es: El atributo '[In]' no es necesario a menos que también se use el atributo '[Out]'. El comportamiento del atributo '[In]' sin el atributo '[Out]' es el mismo que el comportamiento predeterminado.
fr: L’attribut '[In]' n’est pas nécessaire, sauf si l’attribut '[Out]' est également utilisé. Le comportement de l’attribut « [In] » sans l’attribut « [Out] » est le même que le comportement par défaut.
it: L'attributo '[In]' non è necessario a meno che non venga usato anche l'attributo '[Out]'. Il comportamento dell'attributo '[In]' senza l'attributo '[Out]' è uguale a quello predefinito.
ja: '[In]' 属性は、'[Out]' 属性も使用しない限り必要ではありません。'[Out]' 属性なしでの '[In]' 属性の動作は、既定の動作と同じです。
ko: '[In]' 특성은 '[Out]' 특성도 함께 사용되지 않는 한 필요하지 않습니다. '[Out]' 특성이 없는 '[In]' 특성의 동작은 기본 동작과 동일합니다.
pl: Atrybut „[In]” nie jest potrzebny, chyba że używany jest również atrybut „[Out]”. Zachowanie atrybutu „[In]” bez atrybutu „[Out]” jest takie samo jak zachowanie domyślne.
pt_br: O atributo '[In]' não é necessário, a menos que o atributo '[Out]' também seja usado. O comportamento do atributo '[In]' sem o atributo '[Out]' é igual ao comportamento padrão.
ru: Атрибут "[In]" необязателен, если только не используется атрибут "[Out]". Поведение атрибута "[In]" без "[Out]" совпадает с поведением по умолчанию.
tr: '[Out]' özniteliği de kullanılmadığı sürece '[In]' özniteliği gerekli değildir. '[Out]' özniteliği kullanılmadığında '[In]' özniteliğinin davranışı varsayılan davranışla aynı olacaktır.
zh_hans: 不需要 “[In]” 属性，除非同时使用 “[Out]” 属性。没有 “[Out]” 属性的情况下，“[In]” 属性的行为与默认行为相同。
zh_hant: 除非一併使用'[Out]'屬性，否則'[In]'屬性為非必要。沒有'[Out]'屬性的'[In]'屬性行為與默認行為相同。

# InOutAttributeByRefNotSupported
source: The '[In]' and '[Out]' attributes are unsupported on parameters passed by reference. Use the 'in', 'ref', or 'out' keywords instead.
cs: Atributy „[In]“ a „[Out]“ se nepodporují u parametrů předaných odkazem. Použijte místo nich klíčová slova „in“, „ref“ nebo „out“.
de: Die Attribute \"[In]\" und \"[Out]\" werden für Parameter, die als Verweis übergeben werden, nicht unterstützt. Verwenden Sie stattdessen die Schlüsselwörter \"in\", \"ref\" oder \"out\".
es: Los atributos “[In]” y “[Out]” no se admiten en los parámetros pasados por referencia. Use las palabras clave “in”, “ref” o “out” en su lugar.
fr: Les attributs « [In] » et « [Out] » ne sont pas pris en charge sur les paramètres passés par référence. Utilisez les mots clés « in », « ref » ou 'out' à la place.
it: Gli attributi '[In]' e '[Out]' non sono supportati nei parametri passati per riferimento. Usare le parole chiave 'in', 'ref' o 'out'.
ja: '[In]' 属性と '[Out]' 属性は、参照渡しされたパラメーターではサポートされていません。代わりに 'in'、'ref'、または 'out' キーワードを使用します。
ko: '[In]' 및 '[Out]' 특성은 참조로 전달된 매개 변수에서 지원되지 않습니다. 대신 'in', 'ref' 또는 'out' 키워드를 사용하세요.
pl: Atrybuty „[In]” i „[Out]” nie są obsługiwane w parametrach przekazywanych przez odwołanie. Zamiast tego użyj słów kluczowych „in”, „ref” lub „out”.
pt_br: Os atributos '[In]' e '[Out]' não têm suporte em parâmetros passados por referência. Use as palavras-chave 'in', 'ref' ou 'out'.
ru: Атрибуты \"[In]\" и \"[Out]\" не поддерживаются для параметров, передаваемых по ссылке. Используйте вместо них ключевые слова \"in\", \"ref\" или \"out\".
tr: '[In]' ve '[Out]' öznitelikleri başvuruya göre aktarılan parametrelerde desteklenmiyor. Bunun yerine 'in', 'ref' veya 'out' anahtar sözcüklerini kullanın.
zh_hans: 引用传递的参数不支持 “[In]” 和 “[Out]” 属性。请改用 “in”、“ref” 或 “out” 关键字。
zh_hant: 參考所傳遞的參數不支援'[In]'和'[Out]'屬性。請改用 'in'、'ref' 或 'out' 關鍵詞。

# InOutAttributeMarshalerNotSupported
source: The provided '[In]' and '[Out]' attributes on this parameter are unsupported on this parameter.
cs: Poskytnuté atributy „[In]“ a „[Out]“ u tohoto parametru se na tomto parametru nepodporují.
de: Die angegebenen Attribute \"[In]\" und \"[Out]\" für diesen Parameter werden für diesen Parameter nicht unterstützt.
es: En este parámetro, los atributos “[In]” y “[Out]” proporcionados no se admiten.
fr: Les attributs « [In] » et « [Out] » fournis sur ce paramètre ne sont pas pris en charge sur ce paramètre.
it: Gli attributi '[In]' e '[Out]' specificati per questo parametro non sono supportati in questo parametro.
ja: このパラメーターに指定された '[In]' 属性と '[Out]' 属性は、このパラメーターではサポートされていません。
ko: 이 매개 변수에 제공된 '[In]' 및 '[Out]' 특성은 이 매개 변수에서 지원되지 않습니다.
pl: Podane atrybuty „[In]” i „[Out]” w tym parametrze nie są obsługiwane w tym parametrze.
pt_br: Os atributos '[In]' e '[Out]' neste parâmetro não têm suporte neste parâmetro.
ru: Указанные атрибуты \"[In]\" и \"[Out]\" для этого параметра не поддерживаются.
tr: Bu parametrede sağlanan '[In]' ve '[Out]' öznitelikleri bu parametrede desteklenmiyor.
zh_hans: 此参数上提供的 “[In]” 和 “[Out]” 属性在此参数上不受支持。
zh_hant: 此參數不支援在此參數上提供的 '[In]' 和 '[Out]' 屬性。

# InOutAttributeNotSupportedOnByValueParameters
source: The '[In]' and '[Out]' attributes are only supported on array parameters. Consider using the 'ref' keyword to make the parameter mutable.
cs: Atributy „[In]“ a „[Out]“ jsou podporovány pouze u parametrů pole. Zvažte použití klíčového slova „ref“ k nastavení měnitelného parametru.
de: Die [In]- und [Out]-Attribute werden nur für Arrayparameter unterstützt. Erwägen Sie die Verwendung des Schlüsselworts "ref", damit der Parameter geändert werden kann.
es: Los atributos "[In]" y "[Out]" solo se admiten en parámetros de matriz. Considere la posibilidad de usar la palabra clave "ref" para hacer que el parámetro sea mutable.
fr: Les attributs '[In]' et '[Out]' ne sont pris en charge que sur les paramètres de tableau. Pensez à utiliser le mot-clé 'ref' pour rendre le paramètre mutable.
it: Gli attributi [In]' e '[Out]' sono supportati solo nei parametri di matrice. Provare a usare le parole chiave 'ref' per rendere modificabile il parametro.
ja: '[In]' および '[Out]' 属性は、配列パラメーターでのみサポートされます。パラメーターを変更可能にするには、'ref' キーワードを使用することを検討してください。
ko: '[In]' 및 '[Out]' 특성은 배열 매개 변수에서만 지원됩니다. 매개 변수를 변경 가능하게 만들려면 'ref' 키워드를 사용하는 것이 좋습니다.
pl: Atrybuty „[In]” i „[Out]” są obsługiwane tylko w przypadku parametrów tablicy. Rozważ użycie słowa kluczowego „ref”, aby umożliwić modyfikowanie parametru.
pt_br: Os atributos '[In]' e '[Out]' só têm suporte nos parâmetros de matriz. Considere usar a palavra-chave 'ref' para tornar o parâmetro mutável.
ru: Атрибуты "[In]" и "[Out]" поддерживаются только для параметров массива. Рассмотрите возможность использования ключевого слова "ref", чтобы сделать параметр изменяемым.
tr: '[In]' ve '[Out]' öznitelikleri yalnızca dizi parametrelerinde desteklenir. Parametreyi değiştirilebilir yapmak için 'ref' anahtar sözcüğünü kullanmayı düşünün.
zh_hans: “[In]”和“[Out]”属性仅在数组参数上受支持。请考虑使用“ref”关键字使参数可变。
zh_hant: 只有在陣列參數上才支援 '[In]' 和 '[Out]' 屬性。請考慮使用 'ref' 關鍵字，讓參數成為可變動。

# InOutAttributes
source: [In] and [Out] attributes
cs: atributy [In] a [Out]
de: [In]- und [Out]-Attribute
es: Atributos [In] y [Out]
fr: Attributs [In] et [Out]
it: Attributi [In] e [Out]
ja: 属性の[In]と[Out]
ko: [In] 및 [Out] 속성
pl: Atrybuty [In] i [Out]
pt_br: Atributos [In] e [Out]
ru: Атрибуты [In] и [Out]
tr: [In] ve [Out] öznitelikleri
zh_hans: [In] 和 [Out] 属性
zh_hant: [In] 與 [Out] 屬性

# InstanceEventDeclaredInInterfaceDescription
source: Events are not a concept in COM, so no interop code will be source generated for instance events on source-generated COM interfaces.
cs: Události nejsou konceptem COM, takže pro události instance na rozhraních COM generovaných zdrojem nebude vygenerován žádný kód spolupráce.
de: Ereignisse sind kein Konzept in COM, daher wird kein Interopcode für Instanzereignisse auf von der Quelle generierten COM-Schnittstellen generiert.
es: Los eventos no representan un concepto en COM, de modo que no se generará código de interoperabilidad para eventos de instancia en interfaces COM generadas en origen.
fr: Les événements ne sont pas un concept dans COM. Par conséquent, aucun code d’interopérabilité n’est généré à la source pour les événements d’instance sur les interfaces COM générées par la source.
it: Gli eventi non sono concetti in COM quindi non verrà generato codice di interoperabilità per gli eventi dell’istanza nelle interfacce COM generate dall'origine.
ja: イベントは COM の概念ではないため、ソース生成 COM インターフェイス上のインスタンス イベントに対して相互運用コードはソース生成されません。
ko: 이벤트는 COM의 개념이 아니므로 소스 생성 COM 인터페이스의 인스턴스 이벤트에 대해 interop 코드가 생성되지 않습니다.
pl: Zdarzenia nie są koncepcją w modelu COM, więc żaden kod międzyoperacyjny nie będzie generowany dla zdarzeń wystąpień w interfejsach COM generowanych źródłowo.
pt_br: Os eventos não são um conceito em COM, portanto, nenhum código de interoperabilidade será gerado para eventos de instância em interfaces COM geradas pela origem.
ru: События не являются концепцией в COM, поэтому источник не будет генерировать код взаимодействия для событий экземпляра в COM-интерфейсах, создаваемых источником.
tr: Olaylar COM'da kavram olarak değerlendirilmez, bu nedenle kaynak tarafından oluşturulan COM arabirimleri üzerinde örnek olaylar için birlikte çalışma kodu oluşturulmaz.
zh_hans: 事件不是 COM 的概念，因此不会为源生成的 COM 接口上的实例事件生成互操作代码。
zh_hant: 事件不是 COM 中的概念，因此不會為來源產生的 COM 介面上的執行個體事件來源產生 Interop 程式碼。

# InstanceEventDeclaredInInterfaceMessage
source: The instance event '{0}' is declared in the interface '{1}', which has the 'GeneratedComInterfaceAttribute' applied
cs: Událost instance {0} je deklarována v rozhraní {1}, ve kterém se používá GeneratedComInterfaceAttribute.
de: Das Instanzereignis "{0}" wird in der Schnittstelle "{1}" deklariert, auf die das "GeneratedComInterfaceAttribute" angewendet wurde.
es: El evento de instancia ''{0}'' se declara en la interfaz ''{1}'', que tiene aplicado ''GeneratedComInterfaceAttribute''
fr: L’événement d’instance « {0} » est déclaré dans l’interface « {1} », à laquelle « GeneratedComInterfaceAttribute » est appliqué
it: L'evento dell’istanza '{0}' è dichiarato nell'interfaccia '{1}' a cui è applicato 'GeneratedComInterfaceAttribute'
ja: インスタンス イベント '{0}' は、'GeneratedComInterfaceAttribute' が適用されているインターフェイス '{1}' で宣言されています
ko: 'GeneratedComInterfaceAttribute'가 적용된 '{1}' 인터페이스에서 '{0}' 인스턴스 이벤트가 선언되었습니다.
pl: Zdarzenie wystąpienia „{0}” jest zadeklarowane w interfejsie „{1}”, w którym zastosowano atrybut „GeneratedComInterfaceAttribute”
pt_br: O evento de instância "{0}" é declarado na interface "{1}", que tem "GeneratedComInterfaceAttribute" aplicado
ru: Событие экземпляра "{0}" объявлено в интерфейсе "{1}", к которому применен атрибут GeneratedComInterfaceAttribute
tr: '{0}' örnek olayı '{1}' arabiriminde bildirildi ve bu arabirimde 'GeneratedComInterfaceAttribute' uygulanmış
zh_hans: 实例事件“{0}”在接口“{1}”中声明，该接口应用了“GeneratedComInterfaceAttribute”
zh_hant: 執行個體事件 '{0}' 是在套用了 'GeneratedComInterfaceAttribute' 的介面 '{1}' 中宣告的

# InstanceEventDeclaredInInterfaceTitle
source: Declaring an instance event in a type with the 'GeneratedComInterfaceAttribute' is not supported
cs: Deklarace události instance v typu s GeneratedComInterfaceAttribute se nepodporuje.
de: Das Deklarieren eines Instanzereignisses in einem Typ mit dem "GeneratedComInterfaceAttribute" wird nicht unterstützt.
es: No se admite la declaración de un evento de instancia en un tipo con "GeneratedComInterfaceAttribute".
fr: La déclaration d’un événement d’instance dans un type avec « GeneratedComInterfaceAttribute » n’est pas prise en charge
it: La dichiarazione di un evento dell’istanza in un tipo con 'GeneratedComInterfaceAttribute' non è supportata
ja: 'GeneratedComInterfaceAttribute' を含む型のインスタンス イベントの宣言はサポートされていません
ko: 'GeneratedComInterfaceAttribute'를 사용하는 형식의 인스턴스 이벤트 선언은 지원되지 않습니다.
pl: Deklarowanie zdarzenia wystąpienia w typie z atrybutem „GeneratedComInterfaceAttribute” nie jest obsługiwane
pt_br: Não há suporte para declarar um evento de instância em um tipo com "GeneratedComInterfaceAttribute"
ru: Объявление события экземпляра в типе с атрибутом GeneratedComInterfaceAttribute не поддерживается
tr: 'GeneratedComInterfaceAttribute' içeren bir tür içinde bir örnek olay bildirilmesi desteklenmiyor
zh_hans: 不支持在具有“GeneratedComInterfaceAttribute”的类型中声明实例事件
zh_hant: 不支援在具有 'GeneratedComInterfaceAttribute' 的類型中宣告執行個體事件

# InstancePropertyDeclaredInInterfaceDescription
source: Properties are not a concept in COM, so no interop code will be source generated for instance properties on source-generated COM interfaces.
cs: Vlastnosti nejsou konceptem COM, takže pro vlastnosti instance na rozhraních COM generovaných zdrojem nebude vygenerován žádný kód spolupráce.
de: Eigenschaften sind kein Konzept in COM, daher wird kein Interopcode für Instanzeigenschaften auf von der Quelle generierten COM-Schnittstellen generiert.
es: Las propiedades no son un concepto en COM, por lo que no se generará código de interoperabilidad para las propiedades de instancia en interfaces COM generadas por el origen.
fr: Les propriétés ne sont pas un concept dans COM. Par conséquent, aucun code d’interopérabilité n’est généré à la source pour les propriétés d’instance sur les interfaces COM générées par la source.
it: Le proprietà non sono concetti in COM quindi non verrà generato codice di interoperabilità per le proprietà dell'istanza nelle interfacce COM generate dall'origine.
ja: プロパティは COM の概念ではないため、ソース生成 COM インターフェイス上のインスタンス プロパティに対して相互運用コードはソース生成されません。
ko: 속성은 COM의 개념이 아니므로 소스 생성 COM 인터페이스의 인스턴스 속성에 대해 interop 코드가 생성되지 않습니다.
pl: Te właściwości nie są koncepcją w modelu COM, dlatego nie zostanie wygenerowany kod międzyoperacyjny dla właściwości wystąpienia w interfejsach COM generowanych źródłowo.
pt_br: As propriedades não são um conceito em COM, portanto, nenhum código de interoperabilidade será gerado para propriedades de instância em interfaces COM geradas pela origem.
ru: Свойства не являются концепцией в COM, поэтому источник не будет генерировать код взаимодействия для свойств экземпляра в COM-интерфейсах, создаваемых источником.
tr: Özellikler COM'da kavram olarak değerlendirilmez, bu nedenle kaynak tarafından oluşturulan COM arabirimleri üzerinde örnek özellikler için birlikte çalışma kodu oluşturulmaz.
zh_hans: 属性在 COM 中不是概念，因此不会为源生成的 COM 接口上的实例属性生成互操作代码。
zh_hant: 屬性不是 COM 中的概念，因此不會為來源產生的 COM 介面上的執行個體屬性來源產生 Interop 程式碼。

# InstancePropertyDeclaredInInterfaceMessage
source: The instance property '{0}' is declared in the interface '{1}', which has the 'GeneratedComInterfaceAttribute' applied
cs: Vlastnost instance {0} je deklarována v rozhraní {1}, ve kterém je použit atribut GeneratedComInterfaceAttribute.
de: Die Instanzeigenschaft "{0}" wird in der Schnittstelle "{1}" deklariert, auf die das "GeneratedComInterfaceAttribute" angewendet wurde.
es: La propiedad de instancia ''{0}'' se declara en la interfaz ''{1}'', que tiene aplicado ''GeneratedComInterfaceAttribute''
fr: La propriété d’instance « {0} » est déclarée dans l’interface « {1} », à laquelle « GeneratedComInterfaceAttribute » est appliqué
it: La proprietà dell’istanza '{0}' è dichiarata nell'interfaccia '{1}' a cui è applicato 'GeneratedComInterfaceAttribute'
ja: インスタンス プロパティ '{0}' は、'GeneratedComInterfaceAttribute' が適用されているインターフェイス '{1}' で宣言されています
ko: 'GeneratedComInterfaceAttribute'가 적용된 '{1}' 인터페이스에서 '{0}' 인스턴스 속성이 선언되었습니다.
pl: Właściwość wystąpienia „{0}” jest zadeklarowana w interfejsie „{1}”, do którego zastosowano atrybut „GeneratedComInterfaceAttribute”
pt_br: A propriedade de instância "{0}" é declarada na interface "{1}", que tem "GeneratedComInterfaceAttribute" aplicado
ru: Свойство экземпляра "{0}" объявлено в интерфейсе "{1}", к которому применен атрибут GeneratedComInterfaceAttribute
tr: '{0}' örnek özelliği '{1}' arabiriminde bildirildi ve bu arabirimde 'GeneratedComInterfaceAttribute' uygulanmış
zh_hans: 实例属性“{0}”在接口“{1}”中声明，该接口应用了“GeneratedComInterfaceAttribute”
zh_hant: 執行個體屬性 '{0}' 是在套用了 'GeneratedComInterfaceAttribute' 的介面 '{1}' 中宣告的

# InstancePropertyDeclaredInInterfaceTitle
source: Declaring an instance property in a type with the 'GeneratedComInterfaceAttribute' is not supported
cs: Deklarace vlastnosti instance v typu s GeneratedComInterfaceAttribute se nepodporuje.
de: Das Deklarieren einer Instanzeigenschaft in einem Typ mit dem "GeneratedComInterfaceAttribute" wird nicht unterstützt.
es: No se admite la declaración de una propiedad de instancia en un tipo con "GeneratedComInterfaceAttribute".
fr: La déclaration d’une propriété d’instance dans un type avec « GeneratedComInterfaceAttribute » n’est pas prise en charge
it: La dichiarazione di una proprietà dell’istanza in un tipo con 'GeneratedComInterfaceAttribute' non è supportata
ja: 'GeneratedComInterfaceAttribute' を含む型のインスタンス プロパティの宣言はサポートされていません
ko: 'GeneratedComInterfaceAttribute'를 사용하는 형식의 인스턴스 속성 선언은 지원되지 않습니다.
pl: Deklarowanie właściwości wystąpienia w typie z atrybutem „GeneratedComInterfaceAttribute” nie jest obsługiwane
pt_br: Não há suporte para declarar uma propriedade de instância em um tipo com "GeneratedComInterfaceAttribute"
ru: Объявление свойства экземпляра в типе с атрибутом GeneratedComInterfaceAttribute не поддерживается
tr: 'GeneratedComInterfaceAttribute' içeren bir tür içinde bir örnek özellik bildirilmesi desteklenmiyor
zh_hans: 不支持在具有“GeneratedComInterfaceAttribute”的类型中声明实例属性
zh_hant: 不支援在具有 'GeneratedComInterfaceAttribute' 的類型中宣告執行個體屬性

# InterfaceTypeNotSupportedMessage
source: Using 'GeneratedComInterfaceAttribute' and 'InterfaceTypeAttribute' is not supported with 'ComInterfaceType' value '{0}'.
cs: Použití GeneratedComInterfaceAttribute a InterfaceTypeAttribute se nepodporuje s hodnotou ComInterfaceType {0}.
de: Die Verwendung von „GeneratedComInterfaceAttribute“ und „InterfaceTypeAttribute“ wird mit dem ComInterfaceType-Wert „{0}“ nicht unterstützt.
es: No se admite el uso de "GeneratedComInterfaceAttribute" e "InterfaceTypeAttribute" con el valor "ComInterfaceType" '{0}'.
fr: L’utilisation de 'GeneratedComInterfaceAttribute' et 'InterfaceTypeAttribute' n’est pas prise en charge avec la valeur 'ComInterfaceType' '{0}'.
it: L'uso di 'GeneratedComInterfaceAttribute' e 'InterfaceTypeAttribute' non è supportato con il valore '{0}' di 'ComInterfaceType'.
ja: 'GeneratedComInterfaceAttribute' および 'InterfaceTypeAttribute' は、'ComInterfaceType' の値 '{0}' ではサポートされていません。
ko: 'GeneratedComInterfaceAttribute' 및 'InterfaceTypeAttribute'는 'ComInterfaceType' 값 '{0}'에서 지원되지 않습니다.
pl: Użycie atrybutów „GeneratedComInterfaceAttribute” i „InterfaceTypeAttribute” nie jest obsługiwane w przypadku wartości „ComInterfaceType” „{0}”.
pt_br: Não há suporte para o uso de 'GeneratedComInterfaceAttribute' e 'InterfaceTypeAttribute' com o valor 'ComInterfaceType' '{0}'.
ru: Использование GeneratedComInterfaceAttribute и InterfaceTypeAttribute не поддерживается со значением ComInterfaceType "{0}".
tr: 'GeneratedComInterfaceAttribute' ve 'InterfaceTypeAttribute' kullanımı, 'ComInterfaceType' değeri '{0}' ile desteklenmiyor.
zh_hans: “ComInterfaceType”值“{0}”不支持使用“GeneratedComInterfaceAttribute”和“InterfaceTypeAttribute”。
zh_hant: 'ComInterfaceType' 值 '{0}' 不支援使用 'GeneratedComInterfaceAttribute' 和 'InterfaceTypeAttribute'。

# InterfaceTypeNotSupportedTitle
source: 'GeneratedComInterfaceType' does not support the 'ComInterfaceType' value supplied to 'InterfaceTypeAttribute' on the same type.
cs: GeneratedComInterfaceType nepodporuje hodnotu ComInterfaceType poskytnutou atributu InterfaceTypeAttribute ve stejném typu.
de: „GeneratedComInterfaceType“ unterstützt den für „InterfaceTypeAttribute“ angegebenen ComInterfaceType-Wert für denselben Typ nicht.
es: 'GeneratedComInterfaceType' no admite el valor 'ComInterfaceType' proporcionado a 'InterfaceTypeAttribute' en el mismo tipo.
fr: 'GeneratedComInterfaceType' ne prend pas en charge la valeur 'ComInterfaceType' fournie à 'InterfaceTypeAttribute' sur le même type.
it: 'GeneratedComInterfaceType' non supporta il valore 'ComInterfaceType' fornito a 'InterfaceTypeAttribute' nello stesso tipo.
ja: 'GeneratedComInterfaceType' は、同じ型の 'InterfaceTypeAttribute' への 'ComInterfaceType' 値の入力をサポートしていません。
ko: 'GeneratedComInterfaceType'은 동일한 유형의 'InterfaceTypeAttribute'에 제공된 'ComInterfaceType' 값을 지원하지 않습니다.
pl: Typ „GeneratedComInterfaceType” nie obsługuje wartości „ComInterfaceType” dostarczonej do atrybutu „InterfaceTypeAttribute” w tym samym typie.
pt_br: 'GeneratedComInterfaceType' não dá suporte ao valor 'ComInterfaceType' fornecido a 'InterfaceTypeAttribute' no mesmo tipo.
ru: GeneratedComInterfaceType не поддерживает значение ComInterfaceType, указанное для InterfaceTypeAttribute того же типа.
tr: "GeneratedComInterfaceType", aynı türde "InterfaceTypeAttribute" öğesine sağlanan "ComInterfaceType" değerini desteklemiyor.
zh_hans: “GeneratedComInterfaceType”不支持提供给同一类型的“InterfaceTypeAttribute”的“ComInterfaceType”值。
zh_hant: 'GeneratedComInterfaceType' 不支援提供給相同類型 'InterfaceTypeAttribute' 的 'ComInterfaceType' 值。

# InvalidAttributedMethodContainingTypeMissingModifiersMessageCom
source: Method '{0}' is contained in a type '{1}' that is not marked 'partial'. COM source generation will ignore method '{0}'.
cs: Metoda „{0}“ je obsažena v typu „{1}“, který není označen jako „částečně provedený kód“. Generování zdroje modelu COM bude metodu „{0}“ ignorovat.
de: Die Methode "{0}" ist in einem Typ "{1}" enthalten, der nicht als "partiell" gekennzeichnet ist. Die COM-Quellgenerierung ignoriert die Methode "{0}".
es: El método "{0}" está contenido en un tipo "{1}" que no está marcado como "parcial". La generación de código fuente COM omitirá el método "{0}".
fr: La méthode '{0}' est contenue dans un type '{1}' qui n’est pas marqué 'partial'. La génération de source COM ignore la méthode '{0}'.
it: Il metodo '{0}' è contenuto in un tipo '{1}' non contrassegnato come 'partial'. La generazione dell'origine COM ignorerà il metodo '{0}'.
ja: メソッド '{0}' は、'partial' とマークされていない型 '{1}' に含まれています。COM ソース生成はメソッド '{0}' を無視します。
ko: 메서드 '{0}'은(는) 'partial'로 표시되지 않은 '{1}' 형식에 포함되어 있습니다. COM 원본 생성은 '{0}' 메서드를 무시합니다.
pl: Metoda „{0}” jest zawarta w typie „{1}”, który nie jest oznaczony jako „częściowy”. Generowanie źródła COM zignoruje metodę „{0}”.
pt_br: O método '{0}' está contido em um tipo '{1}' que não está marcado como 'partial'. A geração de origem do COM ignorará o método '{0}'.
ru: Метод "{0}" содержится в типе "{1}", который не помечен как "partial". Генерация исходного кода модели COM будет игнорировать метод "{0}".
tr: '{0}' metodu, 'kısmi' olarak işaretlenmemiş bir '{1}' türünde yer alıyor. COM kaynak üretimi, '{0}' metodunu yok sayar.
zh_hans: 方法 "{0}" 包含在未标记为 "partial" 的类型 "{1}" 中。COM 源生成将忽略方法 "{0}"。
zh_hant: 方法 '{0}' 包含在未標示為 'partial' 的類型 '{1}' 中。COM 来源產生將略過方法 '{0}'。
