Repository: dotnet/runtime
Catalog: src/libraries/System.Runtime.InteropServices/gen/Common/Resources/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# MultipleComInterfaceBaseTypesDescription
source: A 'GeneratedComInterfaceAttribute'-attributed interface can only derive from at most one other 'GeneratedComInterfaceAttribute'-attributed interface.
cs: Rozhraní s atributem GeneratedComInterfaceAttribute může být odvozeno pouze z jednoho jiného rozhraní s atributem GeneratedComInterfaceAttribute.
de: Eine "GeneratedComInterfaceAttribute"-attributierte Schnittstelle kann nur von höchstens einer weiteren "GeneratedComInterfaceAttribute"-Attributschnittstelle abgeleitet werden.
es: Una interfaz con atributos 'GeneratedComInterfaceAttribute' solo puede derivar de otra interfaz con atributos 'GeneratedComInterfaceAttribute'.
fr: Une interface avec attribut 'GeneratedComInterfaceAttribute' ne peut dériver que d’une seule autre interface avec attribut 'GeneratedComInterfaceAttribute'.
it: Un'interfaccia con attributo 'GeneratedComInterfaceAttribute' può derivare solo da un'altra interfaccia con attributi 'GeneratedComInterfaceAttribute'.
ja: 'GeneratedComInterfaceAttribute' 属性インターフェイスは、最大 1 つのその他の 'GeneratedComInterfaceAttribute' 属性インターフェイスからのみ派生できます。
ko: 'GeneratedComInterfaceAttribute' 특성 인터페이스는 하나의 다른 'GeneratedComInterfaceAttribute' 특성 인터페이스에서만 파생될 수 있습니다.
pl: Interfejs z atrybutem „GeneratedComInterfaceAttribute” może pochodzić tylko z co najwyżej jednego interfejsu z atrybutem „GeneratedComInterfaceAttribute”.
pt_br: Uma interface atribuída a 'GeneratedComInterfaceAttribute' só pode derivar de no máximo uma outra interface atribuída a 'GeneratedComInterfaceAttribute'.
ru: Интерфейс с атрибутом GeneratedComInterfaceAttribute может быть производным не более чем от одного другого интерфейса с атрибутом "GeneratedComInterfaceAttribute".
tr: 'GeneratedComInterfaceAttribute' özniteliğine sahip arabirim yalnızca, 'GeneratedComInterfaceAttribute' özniteliğine sahip en fazla bir başka arabirimden türetilebilir.
zh_hans: “GeneratedComInterfaceAttribute”特性化接口最多只能从另一个“GeneratedComInterfaceAttribute”特性化接口派生。
zh_hant: 'GeneratedComInterfaceAttribute'-屬性介面最多只能衍生自另一個 'GeneratedComInterfaceAttribute'-屬性介面。

# MultipleComInterfaceBaseTypesMessage
source: Interface '{0}' is derived from two or more interfaces attributed with 'GeneratedComInterfaceAttribute'.
cs: Rozhraní „{0}“ je odvozeno ze dvou nebo více rozhraní s atributem GeneratedComInterfaceAttribute.
de: Die Schnittstelle '{0}' wird von mindestens zwei Schnittstellen abgeleitet, die mit "GeneratedComInterfaceAttribute" attributiert sind.
es: El '{0}' de interfaz se deriva de dos o más interfaces atribuidas a 'GeneratedComInterfaceAttribute'.
fr: L’interface '{0}' est dérivée de deux interfaces ou plus attribuées avec 'GeneratedComInterfaceAttribute'.
it: L’interfaccia '{0}' deriva da due o più interfacce con attributo 'GeneratedComInterfaceAttribute'.
ja: インターフェイス '{0}' は、'GeneratedComInterfaceAttribute' 属性が設定された 2 つ以上のインターフェイスから派生しています。
ko: 인터페이스 '{0}'은(는) 'GeneratedComInterfaceAttribute'가 있는 두 개 이상의 인터페이스에서 파생됩니다.
pl: Interfejs „{0}” pochodzi z co najmniej dwóch interfejsów z atrybutem „GeneratedComInterfaceAttribute”.
pt_br: A interface '{0}' é derivada de duas ou mais interfaces atribuídas com 'GeneratedComInterfaceAttribute'.
ru: Интерфейс "{0}" является производным от двух или более интерфейсов, атрибутированных с помощью "GeneratedComInterfaceAttribute".
tr: '{0}' arabirimi, 'GeneratedComInterfaceAttribute' özniteliğine sahip iki veya daha fazla arabirimden türetildi.
zh_hans: 接口“{0}”派生自使用 “GeneratedComInterfaceAttribute”特性化的两个或更多接口。
zh_hant: 介面 '{0}' 衍生自具有 'GeneratedComInterfaceAttribute' 的兩個或多個介面。

# MultipleComInterfaceBaseTypesTitle
source: Specified interface derives from two or more 'GeneratedComInterfaceAttribute'-attributed interfaces.
cs: Zadané rozhraní je odvozeno ze dvou nebo více rozhraní s atributem GeneratedComInterfaceAttribute.
de: Die angegebene Schnittstelle wird von mindestens zwei Schnittstellen abgeleitet, die "GeneratedComInterfaceAttribute" zugeordnet sind.
es: La interfaz especificada deriva de dos o más interfaces con atributos "GeneratedComInterfaceAttribute".
fr: L’interface spécifiée dérive de deux ou plusieurs interfaces avec attribut 'GeneratedComInterfaceAttribute'.
it: L'interfaccia specificata deriva da due o più interfacce con attributi 'GeneratedComInterfaceAttribute'.
ja: 指定されたインターフェイスは、2 つ以上の 'GeneratedComInterfaceAttribute' 属性インターフェイスから派生しています。
ko: 지정한 인터페이스는 두 개 이상의 'GeneratedComInterfaceAttribute' 특성 인터페이스에서 파생됩니다.
pl: Określony interfejs pochodzi z co najmniej dwóch interfejsów z atrybutem „GeneratedComInterfaceAttribute”.
pt_br: A interface especificada deriva de duas ou mais interfaces atribuídas a 'GeneratedComInterfaceAttribute'.
ru: Указанный интерфейс является производным от двух или более интерфейсов с атрибутом "GeneratedComInterfaceAttribute".
tr: Belirtilen arabirim 'GeneratedComInterfaceAttribute' özniteliğine sahip iki veya daha fazla arabirimden türetildi.
zh_hans: 指定的接口派生自两个或更多“GeneratedComInterfaceAttribute”特性化接口。
zh_hant: 指定的介面衍生自兩個或兩個以上的 'GeneratedComInterfaceAttribute'-屬性介面。

# OneWrapperMustBeGenerated
source: Either 'ComInterfaceOptions.ManagedObjectWrapper' or 'ComInterfaceOptions.ComObjectWrapper' must be specified.
cs: Musí se zadat ComInterfaceOptions.ManagedObjectWrapper nebo ComInterfaceOptions.ComObjectWrapper.
de: Es muss entweder "ComInterfaceOptions.ManagedObjectWrapper" oder "ComInterfaceOptions.ComObjectWrapper" angegeben werden.
es: Debe especificarse ''ComInterfaceOptions.ManagedObjectWrapper'' o ''ComInterfaceOptions.ComObjectWrapper''.
fr: 'ComInterfaceOptions.ManagedObjectWrapper' ou 'ComInterfaceOptions.ComObjectWrapper' doit être spécifié.
it: È necessario specificare 'ComInterfaceOptions.ManagedObjectWrapper' o 'ComInterfaceOptions.ComObjectWrapper'.
ja: 'ComInterfaceOptions.ManagedObjectWrapper' または 'ComInterfaceOptions.ComObjectWrapper' を指定する必要があります。
ko: 'ComInterfaceOptions.ManagedObjectWrapper' 또는 'ComInterfaceOptions.ComObjectWrapper'를 지정해야 합니다.
pl: Należy określić element „ComInterfaceOptions.ManagedObjectWrapper” lub „ComInterfaceOptions.ComObjectWrapper”.
pt_br: 'ComInterfaceOptions.ManagedObjectWrapper' ou 'ComInterfaceOptions.ComObjectWrapper' deve ser especificado.
ru: Необходимо указать "ComInterfaceOptions.ManagedObjectWrapper" или "ComInterfaceOptions.ComObjectWrapper".
tr: 'ComInterfaceOptions.ManagedObjectWrapper' veya 'ComInterfaceOptions.ComObjectWrapper' belirtilmelidir.
zh_hans: 必须指定 "ComInterfaceOptions.ManagedObjectWrapper" 或 "ComInterfaceOptions.ComObjectWrapper"。
zh_hant: 必須指定 'ComInterfaceOptions.ManagedObjectWrapper' 或 'ComInterfaceOptions.ComObjectWrapper'。

# OutAttributeNotSupportedOnByValueParameters
source: The '[Out]' attribute is only supported on array parameters. Consider using 'out' or 'ref' keywords to make the parameter mutable.
cs: Atribut „[Out]“ se podporuje jen u parametrů pole. Zvažte použití klíčových slov „out“ nebo „ref“, aby se parametr dalo měnit.
de: Das [Out]-Attribut wird nur für Arrayparameter unterstützt. Erwägen Sie die Verwendung der Schlüsselwörter "out" oder "ref", damit der Parameter geändert werden kann.
es: El atributo "[Out]" solo se admite en parámetros de matriz. Considere la posibilidad de usar palabras clave "out" o "ref" para hacer que el parámetro sea mutable.
fr: L'attribut '[Out]' n'est pris en charge que sur les paramètres de tableau. Pensez à utiliser les mots-clés « out » ou « ref » pour rendre le paramètre mutable.
it: L'attributo '[Out]' è supportato solo nei parametri di matrice. Provare a usare le parole chiave 'out' o 'ref' per rendere modificabile il parametro.
ja: '[Out]' 属性は、配列パラメーターでのみサポートされます。パラメーターを変更可能にするには、'out' または 'ref' キーワードを使用することを検討してください。
ko: '[Out]' 특성은 배열 매개 변수에서만 지원됩니다. 매개 변수를 변경할 수 있도록 'out' 또는 'ref' 키워드를 사용하는 것이 좋습니다.
pl: Atrybut „[Out]” jest obsługiwany tylko w przypadku parametrów tablicy. Rozważ użycie słów kluczowych „out” lub „ref”, aby umożliwić modyfikowanie parametru.
pt_br: O atributo "[Out]" só tem suporte nos parâmetros de matriz. Considere usar palavras-chave "out" ou "ref" para tornar o parâmetro mutável.
ru: Атрибут "[Out]" поддерживается только для параметров массива. Рассмотрите возможность использования ключевых слов "out" или "ref", чтобы сделать параметр изменяемым.
tr: '[Out]' özniteliği yalnızca dizi parametrelerinde desteklenir. Parametreyi değiştirilebilir yapmak için 'out' veya 'ref' anahtar sözcükleri kullanmayı düşünün.
zh_hans: "[Out]" 属性仅在数组参数上受支持。请考虑使用“out”或“ref”关键字使参数可变。
zh_hant: 只有在陣列參數上才支援 '[Out]' 屬性。請考慮使用 'out' 或 'ref' 關鍵字，讓參數成為可變動。

# OutRequiresToManagedDescription
source: A 'Value' or 'LinearCollection'-kind native type that supports marshalling in the 'Out' direction must provide a 'ToManaged' method that returns the managed type.
cs: Nativní typ „Value“ nebo druhu LinearCollection podporující zařazování ve směru „Out“ musí poskytovat metodu ToManaged, která vrací spravovaný typ.
de: Ein nativer Typ vom Typ \"Value\" oder \"LinearCollection\", der Marshalling in der Out-Richtung unterstützt, muss eine ToManaged-Methode bereitstellen, die den verwalteten Typ zurückgibt.
es: Un tipo nativo de variante “Value” o “LinearCollection” que admita serialización en la dirección “Out” debe proporcionar un método “ToManaged” que devuelva el tipo administrado.
fr: Un type natif de type « Value » ou « LinearCollection » qui prend en charge le marshaling dans la direction « Out » doit fournir une méthode « ToManaged » qui retourne le type managé.
it: Un tipo nativo di tipo 'Value' o 'LinearCollection' che supporta il marshalling nella direzione 'Out' deve fornire un metodo 'ToManaged' che restituisce il tipo gestito.
ja: 'Out' 方向のマーシャリングをサポートする 'Value' や 'LinearCollection' 型のネイティブ型では、マネージド型を返す 'ToManaged' メソッドを指定する必要があります。
ko: 'Out' 방향으로 마샬링을 지원하는 'Value' 또는 'LinearCollection' 종류의 네이티브 형식은 관리 형식을 반환하는 'ToManaged' 메서드를 제공해야 합니다.
pl: Typ natywny rodzaju „Value” lub „LinearCollection”, który obsługuje skierowanie w kierunku „Out”, musi zapewniać metodę „ToManaged”, która zwraca typ zarządzany.
pt_br: Um tipo nativo do tipo 'Value' ou 'LinearCollection' que dá suporte a marshalling na direção 'Out' deve fornecer um método 'ToManaged' que retorne o tipo gerenciado.
ru: Собственный тип вида \"Value\" или \"LinearCollection\", поддерживающий маршализацию в направлении \"наружу\", должен предоставлять метод \"ToManaged\", который возвращает управляемый тип.
tr: 'Out' yönünde sıralamayı destekleyen 'Value' veya 'LinearCollection' tipi yerel türde, yönetilen türü döndüren bir 'ToManaged' metodu sağlanmalıdır.
zh_hans: 支持在 “Out” 方向进行封送处理的 “Value” 或 “LinearCollection” 种类的本机类型必须提供返回托管类型的 “ToManaged” 方法。
zh_hant: 支援在 'Out' 方向排列的 'Value' 或 'LinearCollection'-kind 原生類型必須提供傳回 Managed 類型的 'ToManaged' 方法。

# OutRequiresToManagedMessage
source: The type '{0}' specifies it supports marshalling in the 'Out' direction, but it does not provide a 'ToManaged' method that returns the managed type
cs: Typ {0}určuje, že podporuje zařazování ve směru „Out“, ale neposkytuje metodu ToManaged, která vrací spravovaný typ
de: Der Typ \"{0}\" gibt an, dass das Marshalling in der Out-Richtung unterstützt wird. Er stellt jedoch keine ToManaged-Methode bereit, die den verwalteten Typ zurückgibt.
es: El tipo “{0}” especifica que admite la serialización en la dirección “Out”, pero no proporciona un método “ToManaged” que devuelva el tipo administrado
fr: Le type « {0} » spécifie qu’il prend en charge le marshaling dans la direction « Out », mais il ne fournit pas de méthode « ToManaged » qui retourne le type managé
it: Il tipo '{0}' specifica che supporta il marshalling nella direzione 'Out', ma non fornisce un metodo 'ToManaged' che restituisce il tipo gestito
ja: 型 '{0}' は、'Out' 方向のマーシャリングをサポートしますが、マネージド型を返す 'ToManaged' メソッドは指定されません
ko: 형식 '{0}'은(는) 'Out' 방향으로 마샬링을 지원하도록 지정하지만 관리 형식을 반환하는 'ToManaged' 메서드를 제공하지 않습니다.
pl: Typ „{0}” określa, że obsługuje skierowanie w kierunku „Out”, ale nie zapewnia metody „ToManaged”, która zwraca typ zarządzany
pt_br: O tipo '{0}' especifica que ele dá suporte a marshalling na direção 'Out', mas não fornece um método 'ToManaged' que retorna o tipo gerenciado
ru: Тип \"{0}\" указывает, что поддерживает маршализацию в направлении \"наружу\", но не предоставляет метод \"ToManaged\", который возвращает управляемый тип
tr: '{0}' türü, 'Out' yönünde sıralamayı desteklediğini belirtiyor, ancak yönetilen türü döndüren bir 'ToManaged' metodu sağlamıyor
zh_hans: 类型“{0}”指定它支持按 “Out” 方向进行封送，但不提供返回托管类型的 “ToManaged” 方法
zh_hant: 類型 '{0}' 指定它支援以 'Out' 方向排列，但未提供傳回受管理類型的 'ToManaged' 方法

# PreferExplicitInOutAttributesOnArrays
source: It is recommended to use explicit '[In]' and '[Out]' attributes on array parameters.
cs: U parametrů pole se doporučuje použít explicitní atributy „[In]“ a „[Out]“.
de: Es wird empfohlen, explizite [In]- und [Out]-Attribute für Arrayparameter zu verwenden.
es: Se recomienda usar los atributos explícitos "[In]" y "[Out]" en los parámetros de matriz.
fr: Il est recommandé d'utiliser les attributs explicites '[In]' et '[Out]' sur les paramètres du tableau.
it: È consigliabile usare attributi '[In]' e '[Out]' espliciti nei parametri di matrice.
ja: 配列パラメーターに明示的な '[In]' および '[Out]' 属性を使用することをお勧めします。
ko: 배열 매개 변수에는 명시적인 '[In]' 및 '[Out]' 특성을 사용하는 것이 좋습니다.
pl: Zaleca się używanie jawnych atrybutów „[In]” i „[Out]” w parametrach tablicy.
pt_br: É recomendável usar atributos '[In]' e '[Out]' explícitos nos parâmetros de matriz.
ru: Рекомендуется использовать явные атрибуты "[In]" и "[Out]" для параметров массива.
tr: Dizi parametrelerinde açık '[In]' ve '[Out]' özniteliklerinin kullanılması önerilir.
zh_hans: 建议对数组参数使用显式“[In]”和“[Out]”属性。
zh_hant: 建議在陣列參數上使用明確的 '[In]' 和 '[Out]' 屬性。

# RequiresAllowUnsafeBlocksDescriptionCom
source: 'GeneratedComInterfaceAttribute' and 'GeneratedComClassAttribute' require unsafe code. Project must be updated with '<AllowUnsafeBlocks>true</AllowUnsafeBlocks>'.
cs: GeneratedComInterfaceAttribute a GeneratedComClassAttribute vyžadují nebezpečný kód. Projekt se musí aktualizovat na <AllowUnsafeBlocks>true</AllowUnsafeBlocks>.
de: 'GeneratedComInterfaceAttribute' und 'GeneratedComClassAttribute' erfordern unsicheren Code. Das Projekt muss mit '<AllowUnsafeBlocks>wahr</AllowUnsafeBlocks>' aktualisiert werden.
es: "GeneratedComInterfaceAttribute" y "GeneratedComClassAttribute" requieren código no seguro. El proyecto debe actualizarse con "<AllowUnsafeBlocks>true</AllowUnsafeBlocks>".
fr: « GeneratedComInterfaceAttribute » et « GeneratedComClassAttribute » nécessitent du code non sécurisé. Le projet doit être mis à jour avec « <AllowUnsafeBlocks>true</AllowUnsafeBlocks> ».
it: GeneratedComInterfaceAttribute e 'GeneratedComClassAttribute' richiedono codice non gestito. Il progetto deve essere aggiornato con '<AllowUnsafeBlocks>true</AllowUnsafeBlocks>'.
ja: 'GeneratedComInterfaceAttribute' および 'GeneratedComClassAttribute' にはアンセーフ コードが必要です。プロジェクトは '<AllowUnsafeBlocks>true</AllowUnsafeBlocks>' で更新する必要があります。
ko: 'GeneratedComInterfaceAttribute' 및 'GeneratedComClassAttribute'에는 안전하지 않은 코드가 필요합니다. 프로젝트를 '<AllowUnsafeBlocks>true</AllowUnsafeBlocks>'로 업데이트해야 합니다.
pl: Atrybut „GeneratedComInterfaceAttribute” i „GeneratedComClassAttribute” wymagają niebezpiecznego kodu. Projekt musi zostać zaktualizowany za pomocą polecenia „<AllowUnsafeBlocks>true</AllowUnsafeBlocks>”.
pt_br: "GeneratedComInterfaceAttribute" e "GeneratedComClassAttribute" exigem código não seguro. O projeto deve ser atualizado com "<AllowUnsafeBlocks>true</AllowUnsafeBlocks>".
ru: Для "GeneratedComInterfaceAttribute" и "GeneratedComClassAttribute" требуется небезопасный код. Проект необходимо обновить с использованием значения "<AllowUnsafeBlocks>true</AllowUnsafeBlocks>".
tr: 'GeneratedComInterfaceAttribute' ve 'GeneratedComClassAttribute' güvenli olmayan kod gerektiriyor. Projenin '<AllowUnsafeBlocks>true</AllowUnsafeBlocks>' ile güncelleştirilmiş olması gerekiyor.
zh_hans: “GeneratedComInterfaceAttribute”和“GeneratedComClassAttribute”需要不安全代码。必须将项目更新为“<AllowUnsafeBlocks>true</AllowUnsafeBlocks>”。
zh_hant: 'GeneratedComInterfaceAttribute' 和 'GeneratedComClassAttribute' 需要不安全的程式碼。專案必須以 '<AllowUnsafeBlocks>true</AllowUnsafeBlocks>' 更新。

# RequiresAllowUnsafeBlocksDescriptionLibraryImport
source: LibraryImportAttribute requires unsafe code. Project must be updated with '<AllowUnsafeBlocks>true</AllowUnsafeBlocks>'.
cs: LibraryImportAttribute vyžaduje nebezpečný kód. Projekt se musí aktualizovat na hodnotu <AllowUnsafeBlocks>true</AllowUnsafeBlocks>.
de: LibraryImportAttribute erfordert unsicheren Code. Das Projekt muss mit "<AllowUnsafeBlocks>true</AllowUnsafeBlocks>" aktualisiert werden.
es: LibraryImportAttribute requiere código no seguro. El proyecto debe actualizarse con '<AllowUnsafeBlocks>true</AllowUnsafeBlocks>'.
fr: LibraryImportAttribute requiert du code non sécurisé. Le projet doit être mis à jour avec '<AllowUnsafeBlocks>true</AllowUnsafeBlocks>'.
it: LibraryImportAttribute richiede un codice non sicuro. Il progetto deve essere aggiornato con '<AllowUnsafeBlocks>true</AllowUnsafeBlocks>'.
ja: LibraryImportAttribute には安全でないコードが必要です。プロジェクトは '<AllowUnsafeBlocks>true</AllowUnsafeBlocks>' で更新する必要があります。
ko: LibraryImportAttribute에는 안전하지 않은 코드가 필요합니다. 프로젝트는 '<AllowUnsafeBlocks>true</AllowUnsafeBlocks>'로 업데이트해야 합니다.
pl: Element LibraryImportAttribute wymaga niebezpiecznego kodu. Projekt musi zostać zaktualizowany za pomocą „<AllowUnsafeBlocks>true</AllowUnsafeBlocks>”.
pt_br: LibraryImportAttribute requer código não seguro. O projeto deve ser atualizado com '<AllowUnsafeBlocks>true</AllowUnsafeBlocks>'.
ru: Для LibraryImportAttribute требуется небезопасный код. Проект необходимо обновить с использованием значения "<AllowUnsafeBlocks>true</AllowUnsafeBlocks>".
tr: LibraryImportAttribute, güvenli olmayan kod gerektiriyor. Projenin '<AllowUnsafeBlocks>true</AllowUnsafeBlocks>' ile güncelleştirilmesi gerekir.
zh_hans: LibraryImportAttribute 需要不安全的代码。必须使用 “<AllowUnsafeBlocks>true</AllowUnsafeBlocks>”更新项目。
zh_hant: LibraryImportAttribute 需要不安全的程式碼。專案必須以 '<AllowUnsafeBlocks>true</AllowUnsafeBlocks>' 更新。

# RequiresAllowUnsafeBlocksMessageCom
source: 'GeneratedComInterfaceAttribute' and 'GeneratedComClassAttribute' require unsafe code. Project must be updated with '<AllowUnsafeBlocks>true</AllowUnsafeBlocks>'.
cs: GeneratedComInterfaceAttribute a GeneratedComClassAttribute vyžadují nebezpečný kód. Projekt se musí aktualizovat na <AllowUnsafeBlocks>true</AllowUnsafeBlocks>.
de: 'GeneratedComInterfaceAttribute' und 'GeneratedComClassAttribute' erfordern unsicheren Code. Das Projekt muss mit '<AllowUnsafeBlocks>wahr</AllowUnsafeBlocks>' aktualisiert werden.
es: "GeneratedComInterfaceAttribute" y "GeneratedComClassAttribute" requieren código no seguro. El proyecto debe actualizarse con "<AllowUnsafeBlocks>true</AllowUnsafeBlocks>".
fr: « GeneratedComInterfaceAttribute » et « GeneratedComClassAttribute » nécessitent du code non sécurisé. Le projet doit être mis à jour avec « <AllowUnsafeBlocks>true</AllowUnsafeBlocks> ».
it: GeneratedComInterfaceAttribute e 'GeneratedComClassAttribute' richiedono codice non gestito. Il progetto deve essere aggiornato con '<AllowUnsafeBlocks>true</AllowUnsafeBlocks>'.
ja: 'GeneratedComInterfaceAttribute' および 'GeneratedComClassAttribute' にはアンセーフ コードが必要です。プロジェクトは '<AllowUnsafeBlocks>true</AllowUnsafeBlocks>' で更新する必要があります。
ko: 'GeneratedComInterfaceAttribute' 및 'GeneratedComClassAttribute'에는 안전하지 않은 코드가 필요합니다. 프로젝트를 '<AllowUnsafeBlocks>true</AllowUnsafeBlocks>'로 업데이트해야 합니다.
pl: Atrybut „GeneratedComInterfaceAttribute” i „GeneratedComClassAttribute” wymagają niebezpiecznego kodu. Projekt musi zostać zaktualizowany za pomocą polecenia „<AllowUnsafeBlocks>true</AllowUnsafeBlocks>”.
pt_br: "GeneratedComInterfaceAttribute" e "GeneratedComClassAttribute" exigem código não seguro. O projeto deve ser atualizado com "<AllowUnsafeBlocks>true</AllowUnsafeBlocks>".
ru: Для "GeneratedComInterfaceAttribute" и "GeneratedComClassAttribute" требуется небезопасный код. Проект необходимо обновить с использованием значения "<AllowUnsafeBlocks>true</AllowUnsafeBlocks>".
tr: 'GeneratedComInterfaceAttribute' ve 'GeneratedComClassAttribute' güvenli olmayan kod gerektiriyor. Projenin '<AllowUnsafeBlocks>true</AllowUnsafeBlocks>' ile güncelleştirilmiş olması gerekiyor.
zh_hans: “GeneratedComInterfaceAttribute”和“GeneratedComClassAttribute”需要不安全代码。必须将项目更新为“<AllowUnsafeBlocks>true</AllowUnsafeBlocks>”。
zh_hant: 'GeneratedComInterfaceAttribute' 和 'GeneratedComClassAttribute' 需要不安全的程式碼。專案必須以 '<AllowUnsafeBlocks>true</AllowUnsafeBlocks>' 更新。

# RequiresAllowUnsafeBlocksMessageLibraryImport
source: LibraryImportAttribute requires unsafe code. Project must be updated with '<AllowUnsafeBlocks>true</AllowUnsafeBlocks>'.
cs: LibraryImportAttribute vyžaduje nebezpečný kód. Projekt se musí aktualizovat na hodnotu <AllowUnsafeBlocks>true</AllowUnsafeBlocks>.
de: LibraryImportAttribute erfordert unsicheren Code. Das Projekt muss mit "<AllowUnsafeBlocks>true</AllowUnsafeBlocks>" aktualisiert werden.
es: LibraryImportAttribute requiere código no seguro. El proyecto debe actualizarse con '<AllowUnsafeBlocks>true</AllowUnsafeBlocks>'.
fr: LibraryImportAttribute requiert du code non sécurisé. Le projet doit être mis à jour avec '<AllowUnsafeBlocks>true</AllowUnsafeBlocks>'.
it: LibraryImportAttribute richiede un codice non sicuro. Il progetto deve essere aggiornato con '<AllowUnsafeBlocks>true</AllowUnsafeBlocks>'.
ja: LibraryImportAttribute には安全でないコードが必要です。プロジェクトは '<AllowUnsafeBlocks>true</AllowUnsafeBlocks>' で更新する必要があります。
ko: LibraryImportAttribute에는 안전하지 않은 코드가 필요합니다. 프로젝트는 '<AllowUnsafeBlocks>true</AllowUnsafeBlocks>'로 업데이트해야 합니다.
pl: Element LibraryImportAttribute wymaga niebezpiecznego kodu. Projekt musi zostać zaktualizowany za pomocą „<AllowUnsafeBlocks>true</AllowUnsafeBlocks>”.
pt_br: LibraryImportAttribute requer código não seguro. O projeto deve ser atualizado com '<AllowUnsafeBlocks>true</AllowUnsafeBlocks>'.
ru: Для LibraryImportAttribute требуется небезопасный код. Проект необходимо обновить с использованием значения "<AllowUnsafeBlocks>true</AllowUnsafeBlocks>".
tr: LibraryImportAttribute, güvenli olmayan kod gerektiriyor. Projenin '<AllowUnsafeBlocks>true</AllowUnsafeBlocks>' ile güncelleştirilmesi gerekir.
zh_hans: LibraryImportAttribute 需要不安全的代码。必须使用 “<AllowUnsafeBlocks>true</AllowUnsafeBlocks>”更新项目。
zh_hant: LibraryImportAttribute 需要不安全的程式碼。專案必須以 '<AllowUnsafeBlocks>true</AllowUnsafeBlocks>' 更新。

# RequiresAllowUnsafeBlocksTitleCom
source: 'GeneratedComInterfaceAttribute' and 'GeneratedComClassAttribute' require unsafe code.
cs: GeneratedComInterfaceAttribute a GeneratedComClassAttribute vyžadují nebezpečný kód.
de: GeneratedComInterfaceAttribute und GeneratedComClassAttribute erfordern unsicheren Code.
es: "GeneratedComInterfaceAttribute" y "GeneratedComClassAttribute" requieren código no seguro.
fr: « GeneratedComInterfaceAttribute » et « GeneratedComClassAttribute » nécessitent du code non sécurisé.
it: 'GeneratedComInterfaceAttribute' e 'GeneratedComClassAttribute' richiedono codice non sicuro.
ja: 'GeneratedComInterfaceAttribute' および 'GeneratedComClassAttribute' にはアンセーフ コードが必要です。
ko: 'GeneratedComInterfaceAttribute' 및 'GeneratedComClassAttribute'에는 안전하지 않은 코드가 필요합니다.
pl: Atrybuty „GeneratedComInterfaceAttribute” i „GeneratedComClassAttribute” wymagają niebezpiecznego kodu.
pt_br: "GeneratedComInterfaceAttribute" e "GeneratedComClassAttribute" exigem código não seguro.
ru: Для "GeneratedComInterfaceAttribute" и "GeneratedComClassAttribute" требуется небезопасный код.
tr: 'GeneratedComInterfaceAttribute' ve 'GeneratedComClassAttribute' güvenli olmayan kod gerektiriyor.
zh_hans: “GeneratedComInterfaceAttribute”和“GeneratedComClassAttribute”需要不安全代码。
zh_hant: 'GeneratedComInterfaceAttribute' 和 'GeneratedComClassAttribute' 需要不安全的程式碼。
