Repository: dotnet/runtime
Catalog: src/libraries/Microsoft.CSharp/src/MultilingualResources/Microsoft.CSharp.*.xlf
Languages: cs, tr

# NamedArgumentUsedInPositional
source: Named argument '{0}' specifies a parameter for which a positional argument has already been given
cs: Pojmenovaný argument {0} určuje parametr, pro který již byl poskytnut poziční argument.
tr: '{0}' adlandırılmış bağımsız değişkeni konumsal bir bağımsız değişkenin zaten verildiği bir parametreyi belirtiyor
