Repository: dotnet/runtime
Catalog: src/libraries/Microsoft.CSharp/src/MultilingualResources/Microsoft.CSharp.*.xlf
Languages: cs, tr

# InternalCompilerError
source: An unexpected exception occurred while binding a dynamic operation
cs: Při vytváření vazby dynamické operace došlo k neočekávané výjimce.
tr: Dinamik bir işlem bağlanırken beklenmeyen bir özel durum oluştu

# BindRequireArguments
source: Cannot bind call with no calling object
cs: Nelze vytvořit volání vazby s objektem neúčastnícím se volání.
tr: Çağırma nesnesi olmayan çağrı bağlanamaz

# BindCallFailedOverloadResolution
source: Overload resolution failed
cs: Rozlišení přetěžování neproběhlo úspěšně.
tr: Aşırı yükleme çözümlemesi başarısız oldu

# BindBinaryOperatorRequireTwoArguments
source: Binary operators must be invoked with two arguments
cs: Binární operátory je nutné volat se dvěma argumenty.
tr: İkili işleçler iki bağımsız değişkenle çağrılabilir

# BindUnaryOperatorRequireOneArgument
source: Unary operators must be invoked with one argument
cs: Unární operátory je nutné volat s jedním argumentem.
tr: Birli işleçler tek bağımsız değişkenle çağrılmalıdır

# BindPropertyFailedMethodGroup
source: The name '{0}' is bound to a method and cannot be used like a property
cs: Název {0} je vázán na metodu a nemůže být použit jako vlastnost.
tr: '{0}' adı bir metoda bağlıdır ve bir özellik gibi kullanılamaz

# BindInvokeFailedNonDelegate
source: Cannot invoke a non-delegate type
cs: Nelze volat nedelegující typ.
tr: Temsilci olmayan bir tür çağrılamaz

# BindBinaryAssignmentRequireTwoArguments
source: Binary operators cannot be invoked with one argument
cs: Binární operátory nelze volat s jedním argumentem.
tr: İkili işleçler tek bağımsız değişkenle çağrılamaz

# BindBinaryAssignmentFailedNullReference
source: Cannot perform member assignment on a null reference
cs: U nulového odkazu nelze provést přiřazení členů.
tr: Null başvuruya üye ataması yapılamaz

# NullReferenceOnMemberException
source: Cannot perform runtime binding on a null reference
cs: U nulového odkazu nelze provést vazbu za běhu.
tr: Null bir başvuruya bağlanma çalışma zamanında gerçekleştirilemez

# BindCallToConditionalMethod
source: Cannot dynamically invoke method '{0}' because it has a Conditional attribute
cs: Nelze dynamicky volat metodu {0}, protože má atribut Conditional.
tr: Conditional özniteliği olduğundan '{0}' metodu dinamik olarak çağrılamıyor

# BindToVoidMethodButExpectResult
source: Cannot implicitly convert type 'void' to 'object'
cs: Nelze implicitně převést typ void na object.
tr: 'void' türü örtülü olarak 'object' türüne dönüştürülemiyor

# BadBinaryOps
source: Operator '{0}' cannot be applied to operands of type '{1}' and '{2}'
cs: Operátor {0} nelze použít na operandy typu {1} a {2}.
tr: '{0}' işleci '{1}' ve '{2}' türündeki işlenenlere uygulanamaz

# BadIndexLHS
source: Cannot apply indexing with [] to an expression of type '{0}'
cs: Ve výrazu typu {0} nelze použít indexování pomocí hranatých závorek ([]).
tr: '{0}' türündeki bir ifadeye [] ile indis erişimi uygulanamaz

# BadIndexCount
source: Wrong number of indices inside []; expected '{0}'
cs: Uvnitř hranatých závorek ([]) byl nalezen nesprávný počet indexů. Očekávaný počet indexů: {0}
tr: [] içinde yanlış sayıda dizin var; '{0}' olması bekleniyor

# BadUnaryOp
source: Operator '{0}' cannot be applied to operand of type '{1}'
cs: Operátor {0} nelze použít na operand typu {1}.
tr: '{0}' işleci '{1}' türündeki işlenene uygulanamaz

# NoImplicitConv
source: Cannot implicitly convert type '{0}' to '{1}'
cs: Typ {0} nelze implicitně převést na typ {1}.
tr: '{0}' türü örtülü olarak '{1}' türüne dönüştürülemez

# NoExplicitConv
source: Cannot convert type '{0}' to '{1}'
cs: Typ {0} nelze převést na typ {1}.
tr: '{0}' türü '{1}' olarak dönüştürülemiyor.

# ConstOutOfRange
source: Constant value '{0}' cannot be converted to a '{1}'
cs: Konstantní hodnotu {0} nelze převést na typ {1}.
tr: '{0}' sabit değeri bir '{1}' değerine dönüştürülemez.

# AmbigBinaryOps
source: Operator '{0}' is ambiguous on operands of type '{1}' and '{2}'
cs: Operátor {0} je nejednoznačný na operandech typu {1} a {2}.
tr: '{0}' işleci, '{1}' ve '{2}' türündeki işlenenler üzerinde belirsizdir

# AmbigUnaryOp
source: Operator '{0}' is ambiguous on an operand of type '{1}'
cs: Operátor {0} je nejednoznačný na operandu typu {1}.
tr: '{0}' işleci, '{1}' türündeki bir işlenen üzerinde belirsizdir

# ValueCantBeNull
source: Cannot convert null to '{0}' because it is a non-nullable value type
cs: Hodnotu null nelze převést na typ {0}, protože se jedná o typ, který nepovoluje hodnotu null.
tr: Bu null atanamaz bir değer türü olduğundan, null değeri '{0}' değerine dönüştürülemiyor

# WrongNestedThis
source: Cannot access a non-static member of outer type '{0}' via nested type '{1}'
cs: Pomocí vnořeného typu {1} nelze přistupovat k nestatickému členu vnějšího typu {0}.
tr: '{0}' dış türündeki statik olmayan bir öğeye '{1}' iç içe türü yoluyla erişilemez

# NoSuchMember
source: '{0}' does not contain a definition for '{1}'
cs: {0} neobsahuje definici pro {1}.
tr: '{0}' bir '{1}' tanımı içermiyor

# ObjectRequired
source: An object reference is required for the non-static field, method, or property '{0}'
cs: Pro nestatické pole, metodu nebo vlastnost {0} je vyžadován odkaz na objekt.
tr: '{0}' statik olmayan alanı, yöntemi veya özelliği için nesne başvurusu gerekiyor

# AmbigCall
source: The call is ambiguous between the following methods or properties: '{0}' and '{1}'
cs: Volání je nejednoznačné mezi následujícími metodami nebo vlastnostmi: {0} a {1}
tr: Çağrı şu metot veya özellikler arasında belirsiz: '{0}' ve '{1}'

# BadAccess
source: '{0}' is inaccessible due to its protection level
cs: Typ {0} je vzhledem k úrovni ochrany nepřístupný.
tr: '{0}' koruma düzeyi nedeniyle erişilemez

# MethDelegateMismatch
source: No overload for '{0}' matches delegate '{1}'
cs: Žádná přetížená metoda {0} neodpovídá delegátovi {1}.
tr: '{0}' için hiçbir tekrar yükleme '{1}' temsilcisiyle eşleşmiyor

# AssgLvalueExpected
source: The left-hand side of an assignment must be a variable, property or indexer
cs: Levou stranou přiřazení musí být proměnná, vlastnost nebo indexer.
tr: Atamanın sol tarafı değişken, özellik veya dizin oluşturucu olmalıdır

# NoConstructors
source: The type '{0}' has no constructors defined
cs: Pro typ {0} nebyly definovány žádné konstruktory.
tr: '{0}' türünün tanımlı bir oluşturucusu yok

# PropertyLacksGet
source: The property or indexer '{0}' cannot be used in this context because it lacks the get accessor
cs: Vlastnost nebo indexer {0} nelze v tomto kontextu použít, protože neobsahuje přistupující objekt get.
tr: '{0}' özelliği veya dizin erişimcisi, alma erişimcisi olmadığından bu bağlamda kullanılamaz

# ObjectProhibited
source: Member '{0}' cannot be accessed with an instance reference; qualify it with a type name instead
cs: K členovi {0} nelze přistupovat pomocí odkazu na instanci. Namísto toho použijte kvalifikaci pomocí názvu typu.
tr: Örnek başvurusuyla '{0}' üyesine erişilemez; bunun yerine bir tür adıyla niteleyin

# AssgReadonly
source: A readonly field cannot be assigned to (except in a constructor or a variable initializer)
cs: Do pole readonly nejde přiřazovat (kromě případu, kdy se nachází uvnitř konstruktoru nebo inicializátoru proměnné).
tr: Salt okunur bir alana atama yapılamaz (oluşturucu veya değişken başlatıcı içinde olması dışında)

# RefReadonly
source: A readonly field cannot be passed ref or out (except in a constructor)
cs: Pole určené jen pro čtení nejde předat jako parametr Ref nebo Out (kromě případu, kdy se nachází uvnitř konstruktoru).
tr: Salt okunur bir alan ref veya out olarak geçirilemez (oluşturucu içinde olması dışında)

# AssgReadonlyStatic
source: A static readonly field cannot be assigned to (except in a static constructor or a variable initializer)
cs: Do statického pole určeného jen pro čtení nejde přiřazovat (kromě případu, kdy se nachází uvnitř statického konstruktoru nebo inicializátoru proměnné).
tr: Statik salt okunur bir alana atama yapılamaz (statik oluşturucu veya değişken başlatıcı içinde olması dışında)

# RefReadonlyStatic
source: A static readonly field cannot be passed ref or out (except in a static constructor)
cs: Statické pole určené jen pro čtení nejde předat jako parametr Ref nebo Out (kromě případu, kdy se nachází uvnitř statického konstruktoru).
tr: Statik salt okunur bir alan ref veya out olarak geçirilemez (statik oluşturucu içinde olması dışında)

# AssgReadonlyProp
source: Property or indexer '{0}' cannot be assigned to -- it is read only
cs: Vlastnost nebo indexer {0} nelze přiřadit – je jen pro čtení.
tr: '{0}' özelliğine veya dizin oluşturucusuna, salt okunur olduğu için atama yapılamaz

# RefProperty
source: A property or indexer may not be passed as an out or ref parameter
cs: Vlastnost nebo indexer nelze předat jako parametr ref nebo out.
tr: Bir özellik veya dizin oluşturucu out veya ref parametresi olarak geçirilemez

# UnsafeNeeded
source: Dynamic calls cannot be used in conjunction with pointers
cs: Dynamická volání nelze použít v kombinaci s ukazateli.
tr: Dinamik çağrılar işaretçilerle birlikte kullanılamaz.

# BadBoolOp
source: In order to be applicable as a short circuit operator a user-defined logical operator ('{0}') must have the same return type as the type of its 2 parameters
cs: Má-li být uživatelem definovaný logický operátor ({0}) použitelný jako operátor zkráceného vyhodnocení, musí vracet hodnotu stejného typu jako jeho dva parametry.
tr: Kısa devre işleci olarak uygulanabilmesi için, kullanıcı tanımlı bir mantıksal işleç ('{0}') 2 parametresiyle aynı dönüş türüne sahip olmalıdır

# MustHaveOpTF
source: The type ('{0}') must contain declarations of operator true and operator false
cs: Typ ({0}) musí obsahovat deklarace operátorů true a false.
tr: Tür ('{0}') true işleci ve false işleci ile ilgili bildirimler içermelidir

# ConstOutOfRangeChecked
source: Constant value '{0}' cannot be converted to a '{1}' (use 'unchecked' syntax to override)
cs: Konstantní hodnotu {0} nelze převést na typ {1} (k přepsání lze použít syntaxi unchecked).
tr: '{0}' sabit değeri bir '{1}' değerine dönüştürülemez (geçersiz kılmak için 'unchecked' sözdizimini kullanın)

# AmbigMember
source: Ambiguity between '{0}' and '{1}'
cs: Došlo k nejednoznačnosti mezi metodami nebo vlastnostmi {0} a {1}.
tr: '{0}' ve '{1}' arasında belirsizlik var

# NoImplicitConvCast
source: Cannot implicitly convert type '{0}' to '{1}'. An explicit conversion exists (are you missing a cast?)
cs: Typ {0} nelze implicitně převést na typ {1}. Existuje explicitní převod. (Nechybí výraz přetypování?)
tr: '{0}' türü örtülü olarak '{1}' türüne dönüştürülemez. Açık bir dönüştürme var (eksik atamanız mı var?)

# InaccessibleGetter
source: The property or indexer '{0}' cannot be used in this context because the get accessor is inaccessible
cs: Vlastnost nebo indexer {0} nelze v tomto kontextu použít, protože přistupující objekt get není dostupný.
tr: Alma erişimcisine erişilemediğinden '{0}' özelliği veya dizin oluşturucusu bu bağlamda kullanılamaz

# InaccessibleSetter
source: The property or indexer '{0}' cannot be used in this context because the set accessor is inaccessible
cs: Vlastnost nebo indexer {0} nelze v tomto kontextu použít, protože přistupující objekt jet není dostupný.
tr: Ayarlama erişimcisine erişilemediğinden '{0}' özelliği veya dizin oluşturucusu bu bağlamda kullanılamaz

# BadArity
source: Using the generic {1} '{0}' requires '{2}' type arguments
cs: Použití obecné možnosti {1} {0} vyžaduje argumenty typu {2}.
tr: Genel {1} '{0}' kullanımı '{2}' tür bağımsız değişkenlerini gerektirir

# TypeArgsNotAllowed
source: The {1} '{0}' cannot be used with type arguments
cs: {1} {0} nelze použít s argumenty typů.
tr: {1} '{0}' öğesi tür bağımsız değişkenleri ile kullanılamaz

# HasNoTypeVars
source: The non-generic {1} '{0}' cannot be used with type arguments
cs: Neobecnou možnost {1} {0} nelze použít s argumenty typů.
tr: Genel olmayan {1} '{0}' öğesi ´tür bağımsız değişkenleriyle kullanılamaz

# NewConstraintNotSatisfied
source: '{2}' must be a non-abstract type with a public parameterless constructor in order to use it as parameter '{1}' in the generic type or method '{0}'
cs: Objekt {2} musí být neabstraktního typu s veřejným konstruktorem bez parametrů, jinak jej nelze použít jako parametr {1} v obecném typu nebo metodě {0}.
tr: '{2}' türünün, '{0}' genel türünde veya yönteminde '{1}' parametresi olarak kullanabilmesi için ortak bir parametresiz oluşturucu içeren soyut olmayan bir tür olması gerekir

# GenericConstraintNotSatisfiedRefType
source: The type '{3}' cannot be used as type parameter '{2}' in the generic type or method '{0}'. There is no implicit reference conversion from '{3}' to '{1}'.
cs: Typ {3} nelze použít jako parametr typu {2} v obecném typu nebo metodě {0}. Neexistuje žádný implicitní převod odkazu z {3} na {1}.
tr: '{3}' türü, '{0}' genel türü veya yöntemi için '{2}' tür parametresi olarak kullanılamaz. '{3}' türünden '{1}' türüne örtük bir başvuru dönüştürmesi yoktur.

# GenericConstraintNotSatisfiedNullableEnum
source: The type '{3}' cannot be used as type parameter '{2}' in the generic type or method '{0}'. The nullable type '{3}' does not satisfy the constraint of '{1}'.
cs: Typ {3} nelze použít jako parametr typu {2} v obecném typu nebo metodě {0}. Typ {3} s možnou hodnotou null nevyhovuje omezení {1}.
tr: '{3}' türü '{0}' genel türü veya yöntemi için '{2}' tür parametresi olarak kullanılamaz. '{3}' null yapılabilir türü, '{1}' kısıtlamasını karşılamıyor.

# GenericConstraintNotSatisfiedNullableInterface
source: The type '{3}' cannot be used as type parameter '{2}' in the generic type or method '{0}'. The nullable type '{3}' does not satisfy the constraint of '{1}'. Nullable types can not satisfy any interface constraints.
cs: Typ {3} nelze použít jako parametr typu {2} v obecném typu nebo metodě {0}. Typ {3} s možnou hodnotou null nevyhovuje omezení {1}. Typy s možnou hodnotou null nemohou vyhovět žádným omezením rozhraní.
tr: '{3}' türü, '{0}' genel türü veya yöntemi için '{2}' tür parametresi olarak kullanılamaz. '{3}' null yapılabilir türü '{1}' kısıtlamasını karşılamıyor. Null olabilen türler hiçbir arabirim kısıtlamasını karşılamaz.

# GenericConstraintNotSatisfiedValType
source: The type '{3}' cannot be used as type parameter '{2}' in the generic type or method '{0}'. There is no boxing conversion from '{3}' to '{1}'.
cs: Typ {3} nelze použít jako parametr typu {2} v obecném typu nebo metodě {0}. Neexistuje žádný převod na uzavřené určení z {3} na {1}.
tr: '{3}' türü, '{0}' genel türü veya yöntemi için '{2}' tür parametresi olarak kullanılamaz. '{3}' türünden '{1}' türüne paketleme dönüşümü yoktur.

# CantInferMethTypeArgs
source: The type arguments for method '{0}' cannot be inferred from the usage. Try specifying the type arguments explicitly.
cs: Argumenty typu pro metodu {0} nelze stanovit z použití. Zadejte argumenty typu explicitně.
tr: '{0}' yönteminin tür bağımsız değişkenleri kullanımdan çıkarsanamıyor. Tür bağımsız değişkenlerini açık olarak belirtmeyi deneyin.

# RefConstraintNotSatisfied
source: The type '{2}' must be a reference type in order to use it as parameter '{1}' in the generic type or method '{0}'
cs: Typ {2} musí být typ odkazu, aby ho bylo možné používat jako parametr {1} v obecném typu nebo metodě {0}.
tr: '{2}' türünün '{0}' genel türünde veya yönteminde '{1}' parametresi olarak kullanabilmesi için bir başvuru türü olması gerekir

# ValConstraintNotSatisfied
source: The type '{2}' must be a non-nullable value type in order to use it as parameter '{1}' in the generic type or method '{0}'
cs: Typ {2} musí být typ, který nepovoluje hodnotu null, aby ho bylo možné používat jako parametr {1} v obecném typu nebo metodě {0}.
tr: '{2}' türünün '{0}' genel türünde veya yönteminde '{1}' parametresi olarak kullanabilmesi için null yapılamayan bir değer türü olması gerekir

# AmbigUDConv
source: Ambiguous user defined conversions '{0}' and '{1}' when converting from '{2}' to '{3}'
cs: Při převodu typu {2} na typ {3} došlo k uživatelem definovaným nejednoznačným převodům typu {0} na typ {1}.
tr: '{2}' iken '{3}' olarak dönüştürülürken belirsiz kullanıcı tanımlı '{0}' ve '{1}' dönüşümleri yapıldı.

# BindToBogus
source: '{0}' is not supported by the language
cs: {0} není tímto jazykem podporovaný.
tr: '{0}' dil tarafından desteklenmiyor

# CantCallSpecialMethod
source: '{0}': cannot explicitly call operator or accessor
cs: {0}: Nejde explicitně volat operátor nebo přistupující objekt.
tr: '{0}': açıkça işleç veya erişimci çağıramaz

# ConvertToStaticClass
source: Cannot convert to static type '{0}'
cs: Nelze převést na statický typ {0}.
tr: '{0}' statik türüne dönüştürülemiyor

# IncrementLvalueExpected
source: The operand of an increment or decrement operator must be a variable, property or indexer
cs: Operandem operátoru přičtení nebo odečtení musí být proměnná, vlastnost nebo indexer.
tr: Artırma veya azaltma işlecinin işleneni bir değişken, özellik veya dizin oluşturucu olmalıdır

# BadArgCount
source: No overload for method '{0}' takes '{1}' arguments
cs: Žádná přetížená metoda {0} nepoužívá tento počet argumentů ({1}).
tr: '{0}' metodu için hiçbir tekrar yükleme '{1}' bağımsız değişken almaz

# BadArgTypes
source: The best overloaded method match for '{0}' has some invalid arguments
cs: Některé argumenty přetěžované metody, která je nejlepší shodou pro deklaraci {0}, jsou neplatné.
tr: '{0}' ile en iyi eşleşen tekrar yüklenen metot bazı geçersiz bağımsız değişkenlere sahip

# RefLvalueExpected
source: A ref or out argument must be an assignable variable
cs: Argumentem ref nebo out musí být proměnná s možností přiřazení hodnoty
tr: Bir ref veya out bağımsız değişkeni atanabilir değişken olmalıdır

# BadProtectedAccess
source: Cannot access protected member '{0}' via a qualifier of type '{1}'; the qualifier must be of type '{2}' (or derived from it)
cs: K chráněnému členu {0} nelze přistupovat prostřednictvím kvalifikátoru typu {1}. Kvalifikátor musí být typu {2} (nebo musí být od tohoto typu odvozen).
tr: '{0}' korunan üyesine '{1}' türündeki niteleyici kullanılarak erişilemez; niteleyici '{2}' türünde (veya bundan türetilmiş) olmalıdır

# BindToBogusProp2
source: Property, indexer, or event '{0}' is not supported by the language; try directly calling accessor methods '{1}' or '{2}'
cs: Vlastnost, indexer nebo událost {0} nejsou tímto jazykem podporovány. Zkuste přímo volat metody přistupujícího objektu {1} nebo {2}.
tr: '{0}' özelliği, dizin erişimcisi veya olayı dil tarafından desteklenmiyor; '{1}' veya '{2}' erişimci yöntemlerini doğrudan çağırmayı deneyin

# BindToBogusProp1
source: Property, indexer, or event '{0}' is not supported by the language; try directly calling accessor method '{1}'
cs: Vlastnost, indexer nebo událost {0} nejsou tímto jazykem podporovány. Zkuste přímo volat metodu přistupujícího objektu {1}.
tr: '{0}' özelliği, dizin erişimcisi veya olayı dil tarafından desteklenmiyor; '{1}' erişimci yöntemini doğrudan çağırmayı deneyin

# BadDelArgCount
source: Delegate '{0}' does not take '{1}' arguments
cs: Počet argumentů delegáta {0} neodpovídá (počet: {1}).
tr: '{0}' temsilcisi '{1}' bağımsız değişken almıyor

# BadDelArgTypes
source: Delegate '{0}' has some invalid arguments
cs: Některé argumenty delegáta {0} jsou neplatné.
tr: '{0}' temsilcisinde bazı geçersiz bağımsız değişkenler var

# AssgReadonlyLocal
source: Cannot assign to '{0}' because it is read-only
cs: K položce nelze přiřadit {0} protože je jen pro čtení.
tr: Salt okunur olduğu için '{0}' öğesine atama yapılamaz

# RefReadonlyLocal
source: Cannot pass '{0}' as a ref or out argument because it is read-only
cs: Element {0} nelze předat jako argument Ref nebo Out, protože je jen pro čtení.
tr: Salt okunur olduğundan '{0}' öğesinin alanları bir ref veya out bağımsız değişkeni olarak geçirilemez

# ReturnNotLValue
source: Cannot modify the return value of '{0}' because it is not a variable
cs: Vrácenou hodnotu {0} nelze změnit, protože se nejedná o proměnnou.
tr: Bir değişken olmadığından '{0}' öğesinin dönüş değeri değiştirilemez

# AssgReadonly2
source: Members of readonly field '{0}' cannot be modified (except in a constructor or a variable initializer)
cs: Členy pole jen pro čtení {0} nelze měnit (kromě případu, kdy se nacházejí uvnitř konstruktoru nebo inicializátoru proměnné).
tr: '{0}' salt okunur alanın üyeleri (oluşturucu veya değişken başlatıcı dışında) değiştirilemez

# RefReadonly2
source: Members of readonly field '{0}' cannot be passed ref or out (except in a constructor)
cs: Členy pole jen pro čtení {0} nelze předat jako parametr Ref nebo Out (kromě případu, kdy se nacházejí uvnitř konstruktoru).
tr: '{0}' salt okunur alanının üyeleri ref veya out olarak geçirilemez (oluşturucu içinde olması dışında)

# AssgReadonlyStatic2
source: Fields of static readonly field '{0}' cannot be assigned to (except in a static constructor or a variable initializer)
cs: Pole statických polí jen pro čtení {0} nelze přiřadit (kromě případu, kdy se nacházejí uvnitř statického konstruktoru nebo inicializátoru proměnné).
tr: '{0}' statik salt okunur alanının alanlarına (statik oluşturucu veya değişken başlatıcı dışında) atama yapılamaz

# RefReadonlyStatic2
source: Fields of static readonly field '{0}' cannot be passed ref or out (except in a static constructor)
cs: Pole statického pole jen pro čtení {0} nelze předat jako parametr Ref nebo Out (kromě případu, kdy se nacházejí uvnitř statického konstruktoru).
tr: '{0}' statik salt okunur alanının alanları ref veya out olarak geçirilemez (statik oluşturucu içinde olması dışında)

# AssgReadonlyLocalCause
source: Cannot assign to '{0}' because it is a '{1}'
cs: K položce nelze přiřadit {0} protože je typu {1}.
tr: '{1}' olduğu için '{0}' öğesine atama yapılamaz

# RefReadonlyLocalCause
source: Cannot pass '{0}' as a ref or out argument because it is a '{1}'
cs: Element {0} nelze předat jako argument Ref nebo Out, protože je {1}.
tr: '{1}' olduğundan '{0}' öğesinin alanları bir ref veya out bağımsız değişkeni olarak geçirilemez

# BadCtorArgCount
source: '{0}' does not contain a constructor that takes '{1}' arguments
cs: {0} neobsahuje konstruktor daným počtem vstupních argumentů ({1}).
tr: '{0}', '{1}' bağımsız değişkenlerini alan bir oluşturucu içermiyor

# NonInvocableMemberCalled
source: Non-invocable member '{0}' cannot be used like a method.
cs: Nevyvolatelného člena {0} nelze použít jako metodu.
tr: Çağrılamayan '{0}' üyesi metot gibi kullanılamaz.

# NamedArgumentSpecificationBeforeFixedArgument
source: Named argument specifications must appear after all fixed arguments have been specified
cs: Specifikace pojmenovaných argumentů musí následovat po specifikaci všech pevných argumentů
tr: Adlandırılan bağımsız değişken belirtimleri, tüm sabit bağımsız değişkenler belirtildikten sonra görünmelidir

# BadNamedArgument
source: The best overload for '{0}' does not have a parameter named '{1}'
cs: Nejlepší přetížení pro {0} neobsahuje parametr s názvem {1}.
tr: '{0}' için en iyi yeniden yükleme, '{1}' adlı bir parametre içermiyor

# BadNamedArgumentForDelegateInvoke
source: The delegate '{0}' does not have a parameter named '{1}'
cs: Delegát {0} neobsahuje parametr s názvem {1}.
tr: '{0}' temsilcisi '{1}' adlı bir parametre içermiyor

# DuplicateNamedArgument
source: Named argument '{0}' cannot be specified multiple times
cs: Pojmenovaný argument {0} nelze zadat vícekrát.
tr: '{0}' adlandırılmış bağımsız değişkeni bir kereden fazla belirtilemez
