Repository: dotnet/runtime
Catalog: src/libraries/Microsoft.Extensions.Options/gen/Resources/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# NullValidatorTypeMessage
source: Null validator type specified in [ValidateObjectMembers] or [ValidateEnumeratedItems] attributes.
cs: Typ validátoru s hodnotou null zadaný v atributech [ValidateObjectMembers] nebo [ValidateEnumeratedItems].
de: Der in den Attributen [ValidateObjectMembers] oder [ValidateEnumeratedItems] angegebene NULL-Validierungssteuerelementtyp.
es: Se especificó un tipo de validador nulo en los atributos [ValidateObjectMembers] o [ValidateEnumeratedItems].
fr: Type de validateur Null spécifié dans les attributs [ValidateObjectMembers] ou [ValidateEnumeratedItems].
it: Tipo di validator Null specificato negli attributi [ValidateObjectMembers] o [ValidateEnumeratedItems].
ja: [ValidateObjectMembers] 属性または [ValidateEnumeratedItems] 属性で null のバリデーター型が指定されています。
ko: [ValidateObjectMembers] 또는 [ValidateEnumeratedItems] 특성에 Null 유효성 검사기 형식이 지정되었습니다.
pl: W atrybutach [ValidateObjectMembers] lub [ValidateEnumeratedItems] określono typ modułu sprawdzania poprawności o wartości null.
pt_br: Tipo de validador nulo especificado nos atributos [ValidateObjectMembers] ou [ValidateEnumeratedItems].
ru: Тип проверяющего элемента управления, указанный в [ValidateObjectMembers] или [ValidateEnumeratedItems] атрибутах, имеет значение NULL.
tr: [ValidateObjectMembers] veya [ValidateEnumeratedItems] özniteliklerinde null doğrulayıcı türü belirtildi.
zh_hans: [ValidateObjectMembers] 或 [ValidateEnumeratedItems] 属性中指定的 Null 验证程序类型。
zh_hant: [ValidateObjectMembers] 或 [ValidateEnumeratedItems] 屬性中指定的 Null 驗證程式類型。

# NullValidatorTypeTitle
source: Null validator type specified for the 'ValidateObjectMembersAttribute' or 'ValidateEnumeratedItemsAttribute' attributes.
cs: Pro atributy ValidateObjectMembersAttribute nebo ValidateEnumeratedItemsAttribute byl specifikovaný typ validátoru s hodnotou null.
de: Für die Attribute "ValidateObjectMembersAttribute" oder "ValidateEnumeratedItemsAttribute" wurde ein NULL-Validierungssteuerelementtyp angegeben.
es: Se especificó un tipo de validador nulo para los atributos “ValidateObjectMembersAttribute” o “ValidateEnumeratedItemsAttribute”.
fr: Type de validateur Null spécifié pour les attributs 'ValidateObjectMembersAttribute' ou 'ValidateEnumeratedItemsAttribute'.
it: Tipo di validator Null specificato per gli attributi 'ValidateObjectMembersAttribute' o 'ValidateEnumeratedItemsAttribute'.
ja: 'ValidateObjectMembersAttribute' 属性または 'ValidateEnumeratedItemsAttribute' 属性に対して NULL のバリデーター型が指定されています。
ko: 'ValidateObjectMembersAttribute' 또는 'ValidateEnumeratedItemsAttribute' 특성에 Null 유효성 검사기 형식이 지정되었습니다.
pl: Określono typ modułu sprawdzania poprawności o wartości null dla atrybutu „ValidateObjectMembersAttribute” lub „ValidateEnumeratedItemsAttribute”.
pt_br: Tipo de validador nulo especificado para os atributos "ValidateObjectMembersAttribute" ou "ValidateEnumeratedItemsAttribute".
ru: Для атрибутов ValidateObjectMembersAttribute или ValidateEnumeratedItemsAttribute указан тип проверяющего элемента управления NULL.
tr: 'ValidateObjectMembersAttribute' veya 'ValidateEnumeratedItemsAttribute' öznitelikleri için null doğrulayıcı türü belirtildi.
zh_hans: 为“ValidateObjectMembersAttribute”或“ValidateEnumeratedItemsAttribute”属性指定的验证程序类型为 Null。
zh_hant: 為 'ValidateObjectMembersAttribute' 或 'ValidateEnumeratedItemsAttribute' 屬性指定的 Null 驗證程式類型。

# OptionsUnsupportedLanguageVersionMessage
source: The options validation source generator is not available in C# {0}. Please use language version {1} or greater.
cs: Zdrojový generátor ověřování možností není k dispozici v jazyce C#{0}. Použijte prosím jazykovou verzi {1} nebo vyšší.
de: Der Optionsvalidierungsquellgenerator ist in C# {0} nicht verfügbar. Verwenden Sie die Sprachversion {1} oder höher.
es: El generador de origen de validación de opciones no está disponible en C# {0}. Use la versión de idioma {1} o superior.
fr: Le générateur de source de validation d’options n'est pas disponible en C# « {0} ». Veuillez utiliser la version linguistique {1} ou supérieure.
it: Il generatore di origine di convalida delle opzioni non è disponibile in C# {0}. Usare la versione del linguaggio {1} o successiva.
ja: オプション検証ソース ジェネレーターは、C# {0} では使用できません。言語バージョン {1} 以降を使用してください。
ko: 옵션 유효성 검사 원본 생성기는 C# '{0}'에서 사용할 수 없습니다. {1} 이상의 언어 버전을 사용하세요.
pl: Generator źródła sprawdzania poprawności opcji nie jest dostępny w języku C# {0}. Użyj wersji językowej {1} lub nowszej.
pt_br: O gerador de fonte de validação de opções não está disponível em C# {0}. Use a versão do idioma {1} ou superior.
ru: Генератор исходного кода проверки параметров недоступен в C# {0}. Используйте языковую версию {1} или более позднюю.
tr: Seçenek doğrulaması kaynak oluşturucusu C# {0} sürümünde kullanılamıyor. Lütfen dil sürümü {1} veya üstü bir sürümü kullanın.
zh_hans: 选项验证源生成器在 C#“{0}”中不可用。请使用{1}或更高版本的语言版本。
zh_hant: 選項驗證來源產生器在 C# {0} 中不可用。請使用語言版本 {1} 或更新版本。

# OptionsUnsupportedLanguageVersionTitle
source: C# language version not supported by the source generator.
cs: Zdrojový generátor nepodporuje jazykovou verzi jazyka C#.
de: Die C#-Sprachversion wird vom Quellgenerator nicht unterstützt.
es: La versión del idioma C# no es compatible con el generador de origen.
fr: Version du langage C# non prise en charge par le générateur de source.
it: Versione del linguaggio C# non supportata dal generatore di origine.
ja: ソース ジェネレーターでサポートされていない C# 言語バージョン。
ko: 원본 생성기에서 지원되지 않는 C# 언어 버전입니다.
pl: Wersja języka C# nie jest obsługiwana przez generator źródła.
pt_br: Versão da linguagem C# não suportada pelo gerador de origem.
ru: Версия языка C# не поддерживается генератором исходного кода.
tr: C# dil sürümü kaynak oluşturucu tarafından desteklenmiyor.
zh_hans: 源生成器不支持 C# 语言版本。
zh_hant: 來源產生器不支援 C# 語言版本。

# PotentiallyMissingEnumerableValidationMessage
source: Type {0} has validation annotations, but member {1} doesn't specify [ValidateEnumeratedItems] which could be an oversight.
cs: Typ {0} obsahuje validační anotace, ale člen {1} neurčuje [ValidateEnumeratedItems], což může být přehlédnutí.
de: Der Typ "{0}" weist Validierungsanmerkungen auf, der Member "{1}" gibt jedoch keine [ValidateEnumeratedItems] an, die eine Vorhersage darstellen könnten.
es: El tipo {0} tiene anotaciones de validación, pero el miembro {1} no especifica [ValidateEnumeratedItems], lo que podría ser un error.
fr: Le type {0} a des annotations de validation, mais le membre {1} ne spécifie pas [ValidateEnumeratedItems] qui peut être une supervision.
it: Il tipo {0} include annotazioni di convalida, ma il membro {1} non specifica [ValidateEnumeratedItems] che potrebbe essere una supervisione.
ja: 型 {0} には検証の注釈がありますが、メンバー {1} では [ValidateEnumeratedItem] が指定されていません。これは誤りである可能性があります。
ko: 형식 {0}은(는) 유효성 검사 주석이 있지만 멤버 {1}은(는) 참조할 수 있는 [ValidateEnumeratedItems]을(를) 지정하지 않습니다.
pl: Typ {0} ma adnotacje walidacji, ale element członkowski {1} nie określa atrybutu [ValidateEnumeratedItems], co może być przeoczeniem.
pt_br: O tipo {0} tem anotações de validação, mas o membro {1} não especifica [ValidateEnumeratedItems], o que pode ser uma desatenção.
ru: Тип {0} содержит примечания проверки, но элемент {1} не указывает [ValidateEnumeratedItems], который может быть задан.
tr: {0} türünde doğrulama ek açıklamaları var, ancak {1} üyesi gözden kaçmış olabilecek [ValidateEnumeratedItems] belirtmiyor.
zh_hans: 类型 {0} 具有验证注释，但成员 {1} 未指定 [ValidateEnumeratedItems]，这可能是一种监督。
zh_hant: 成員 {0} 具備驗證註釋，但成員 {1} 未指定 [ValidateObjectMembers] (可能為監督)。

# PotentiallyMissingEnumerableValidationTitle
source: Member potentially missing enumerable validation.
cs: U člena potenciálně chybí ověření výčtu.
de: Dem Mitglied fehlt möglicherweise eine aufzählbare Validierung.
es: Posiblemente falta la validación enumerable en el miembro.
fr: Le membre n’a peut-être pas de validation énumérable.
it: Convalida enumerabile potenzialmente mancante nel membro.
ja: 列挙型の検証がメンバーに存在しない可能性があります。
ko: 멤버에 열거 가능한 유효성 검사가 누락되었을 수 있습니다.
pl: W elemencie członkowskim może brakować walidacji możliwej do wyliczenia.
pt_br: Membro potencialmente ausente na validação enumerável.
ru: Элемент потенциально пропускает перечисляемую проверку.
tr: Üyede numaralandırılabilir doğrulama eksik olabilir.
zh_hans: 成员可能缺少可枚举验证。
zh_hant: 成員可能遺漏可列舉的驗證。

# PotentiallyMissingTransitiveValidationMessage
source: Type {0} has validation annotations, but member {1} doesn't specify [ValidateObjectMembers] which could be an oversight.
cs: Typ {0} obsahuje validační anotace, ale člen {1} neurčuje [ValidateObjectMembers], což může být přehlédnutí.
de: Der Typ "{0}" weist Validierungsanmerkungen auf, aber Member "{1}" gibt [ValidateObjectMembers] nicht an, was ein Versehen sein könnte.
es: El tipo {0} tiene anotaciones de validación, pero el miembro {1} no especifica [ValidateObjectMembers], lo que podría ser un error.
fr: Le type {0} a des annotations de validation, mais le membre {1} ne spécifie pas [ValidateObjectMembers] qui pourrait être une méthode de récupération.
it: Il tipo {0} include annotazioni di convalida, ma il membro {1} non specifica [ValidateObjectMembers] che potrebbe essere una supervisione.
ja: 型 {0} には検証の注釈がありますが、メンバー {1} では [ValidateObjectMembers] が指定されていません。これは誤りである可能性があります。
ko: 형식 {0}은(는) 유효성 검사 주석이 있지만 멤버 {1}은(는) 참조할 수 있는 [ValidateObjectMembers]을(를) 지정하지 않습니다.
pl: Typ {0} ma adnotacje walidacji, ale element członkowski {1} nie określa atrybutu [ValidateObjectMembers], co może być przeoczeniem.
pt_br: O tipo {0} tem anotações de validação, mas o membro {1} não especifica [ValidateObjectMembers], o que pode ser uma desatenção.
ru: Тип {0} содержит примечания проверки, но элемент {1} не указывает [ValidateObjectMembers], который может быть задан.
tr: {0} türünde doğrulama ek açıklamaları var, ancak {1} üyesi gözden kaçmış olabilecek [ValidateObjectMembers] belirtmiyor.
zh_hans: 类型 {0} 具有验证注释，但成员 {1} 未指定 [ValidateObjectMembers]，这可能是一种监督。
zh_hant: 類型 {0} 具備驗證註釋，但成員 {1} 未指定 [ValidateObjectMembers] (可能為監督)。

# PotentiallyMissingTransitiveValidationTitle
source: Member potentially missing transitive validation.
cs: U člena potenciálně chybí přenositelné ověření.
de: Dem Member fehlt möglicherweise die transitive Validierung.
es: Posiblemente falta la validación transitiva en el miembro.
fr: Le membre n’a peut-être pas de validation transitive.
it: Il membro potrebbe non avere una convalida transitiva.
ja: メンバーに推移性の検証がない可能性があります。
ko: 멤버에 전이적 유효성 검사가 누락되었을 수 있습니다.
pl: W przypadku elementu członkowskiego może potencjalnie brakować weryfikacji przechodniej.
pt_br: Membro potencialmente ausente na validação transitiva.
ru: Возможно, в элементе отсутствует транзитивная проверка.
tr: Üyede geçişli doğrulama eksik olabilir.
zh_hans: 成员可能缺少可传递验证。
zh_hant: 成員可能遺漏轉移的驗證。

# TypeCannotBeUsedWithTheValidationAttributeMessage
source: The validation attribute {0} should only be applied to properties of type string, array, or ICollection. Using it with the type {1} could lead to runtime failures.
cs: Ověřovací atribut {0} by měl být použit pouze na vlastnosti typu string, array nebo ICollection. Použití s typem {1} může vést k selháním modulu runtime.
de: Das Validierungsattribut {0} sollte nur auf Eigenschaften vom Typ "string", "array" oder "ICollection" angewendet werden. Die Verwendung mit dem Typ {1} kann zu Laufzeitfehlern führen.
es: El atributo de validación {0} solo se debe aplicar a propiedades de tipo cadena, matriz o ICollection. Si la usa con el tipo {1}, podrían producirse errores en tiempo de ejecución.
fr: L’attribut de validation {0} doit uniquement être appliqué aux propriétés de type chaîne, tableau ou ICollection. Son utilisation avec le type {1} peut entraîner des échecs d’exécution.
it: L'attributo {0} di convalida deve essere applicato solo alle proprietà di tipo stringa, matrice o ICollection. L'uso con il tipo {1} potrebbe causare errori di runtime.
ja: 検証属性 {0} は、型文字列、配列、または ICollection のプロパティにしか適用できません。型 {1} と共に使用すると、ランタイム エラーが発生する可能性があります。
ko: 유효성 검사 특성 {0}은(는) 문자열, 배열 또는 ICollection 형식의 속성에만 적용해야 합니다. {1} 형식과 함께 사용하면 런타임 오류가 발생할 수 있습니다.
pl: Atrybut sprawdzania poprawności {0} powinien być stosowany tylko do właściwości typu ciąg, tablica lub ICollection. Użycie go z typem {1} może prowadzić do błędów środowiska uruchomieniowego.
pt_br: O atributo de validação {0} deve ser aplicado somente às propriedades do tipo cadeia de caracteres, matriz ou ICollection. Usá-lo com o tipo {1} pode levar a falhas de runtime.
ru: Атрибут проверки {0} следует применять только к свойствам строки типа, массива или ICollection. Использование его с типом {1} может привести к сбоям во время выполнения.
tr: Doğrulama özniteliği {0} yalnızca string, dizi veya ICollection türündeki özelliklere uygulanmalıdır. {1} türüyle kullanılması çalışma zamanı hatalarına neden olabilir.
zh_hans: 验证特性 {0} 只能应用于字符串、数组或 ICollection 类型的属性。将它与 {1} 类型一起使用可能会导致运行时故障。
zh_hant: 驗證屬性 {0} 只能套用至類型字串、陣列或 ICollection 的屬性。搭配 {1} 類型使用可能會導致執行階段失敗。

# TypeCannotBeUsedWithTheValidationAttributeTitle
source: The validation attribute is only applicable to properties of type string, array, or ICollection; it cannot be used with other types.
cs: Ověřovací atribut se vztahuje pouze na vlastnosti typu string, array nebo ICollection; nelze použít s jinými typy.
de: Das Validierungsattribut gilt nur für Eigenschaften vom Typ "string", "array" oder "ICollection"; es kann nicht mit anderen Typen verwendet werden.
es: El atributo de validación solo es aplicable a propiedades de tipo cadena, matriz o ICollection; no se puede usar con otros tipos.
fr: L’attribut de validation s’applique uniquement aux propriétés de type chaîne, tableau ou ICollection ; il ne peut pas être utilisé avec d’autres types.
it: L'attributo di convalida è applicabile solo alle proprietà di tipo stringa, matrice o ICollection; non può essere usato con altri tipi.
ja: 検証属性は、型文字列、配列、または ICollection のプロパティにのみ適用でき、他の型では使用できません。
ko: 유효성 검사 특성은 문자열, 배열 또는 ICollection 형식의 속성에만 적용할 수 있습니다. 다른 형식과 함께 사용할 수 없습니다.
pl: Atrybut sprawdzania poprawności ma zastosowanie tylko do właściwości typu ciąg, tablica lub ICollection; nie można go używać z innymi typami.
pt_br: O atributo de validação só é aplicável às propriedades do tipo cadeia de caracteres, matriz ou ICollection; não pode ser usado com outros tipos.
ru: Атрибут проверки применим только к свойствам строки типа, массива или ICollection; его нельзя использовать с другими типами.
tr: Doğrulama özniteliği yalnızca string, dizi veya ICollection türündeki özelliklere uygulanabilir; diğer türlerle kullanılamaz.
zh_hans: 验证特性仅适用于字符串、数组或 ICollection 类型的属性；它不能与其他类型一起使用。
zh_hant: 驗證屬性只適用於類型字串、陣列或 ICollection 的屬性;無法與其他類型搭配使用。

# ValidatorsNeedSimpleConstructorMessage
source: Validator type {0} doesn't have a parameterless constructor.
cs: Typ validátoru {0} nemá konstruktor bez parametrů.
de: Der Validierungssteuerelementtyp "{0}" hat keinen parameterlosen Konstruktor.
es: El tipo de validador {0} no tiene un constructor sin parámetros.
fr: Le type de validateur {0} n’a pas de constructeur sans paramètre.
it: Il tipo di convalida {0} non dispone di un costruttore senza parametri.
ja: バリデーター型 {0} にパラメーターなしのコンストラクターがありません。
ko: 유효성 검사기 형식 {0}은(는) 매개 변수가 없는 생성자가 없습니다.
pl: Typ modułu sprawdzania poprawności {0} nie ma konstruktora bez parametrów.
pt_br: O tipo de validador {0} não tem um construtor sem parâmetros.
ru: Тип проверяющего элемента управления {0} не имеет конструктора без параметров.
tr: {0} doğrulayıcı türü parametresiz bir oluşturucuya sahip değil.
zh_hans: 验证程序类型 {0} 没有无参数构造函数。
zh_hant: 驗證程式類型 {0} 沒有無參數建構函式。

# ValidatorsNeedSimpleConstructorTitle
source: Validators used for transitive or enumerable validation must have a constructor with no parameters.
cs: Validátory používané pro přenositelné nebo výčtové ověřování musí mít konstruktor bez parametrů.
de: Validierungssteuerelemente, die für die transitive oder enumerierbare Validierung verwendet werden, müssen über einen Konstruktor ohne Parameter verfügen.
es: Los validadores usados para la validación transitiva o enumerable deben tener un constructor sin parámetros.
fr: Les validateurs utilisés pour la validation transitive ou énumérable doivent avoir un constructeur sans paramètres.
it: I convalidatori usati per la convalida transitiva o enumerabile devono avere un costruttore senza parametri.
ja: 推移性または列挙型の検証に使用されるバリデーターには、パラメーターのないコンストラクターが必要です。
ko: 전이적 또는 열거형 유효성 검사에 사용되는 유효성 검사기에는 매개 변수가 없는 생성자가 있어야 합니다.
pl: Moduły sprawdzania poprawności używane do weryfikacji przechodniej lub weryfikacji możliwej do wyliczenia muszą mieć konstruktora bez żadnych parametrów.
pt_br: Os validadores usados para validação transitiva ou enumerável devem ter um construtor sem parâmetros.
ru: У проверяющих элементов управления, используемых для транзитивной или перечисляемой проверки, должен быть конструктор без параметров.
tr: Geçişli veya numaralandırılabilir doğrulama için kullanılan doğrulayıcıların parametresi olmayan bir oluşturucusu olmalıdır.
zh_hans: 用于可传递验证或可枚举验证的验证程序必须具有没有参数的构造函数。
zh_hant: 用於轉移或可列舉驗證的驗證程式必須具備沒有參數的建構函式。
