Repository: dotnet/runtime
Catalog: src/libraries/Microsoft.Extensions.Options/gen/Resources/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# AlreadyImplementsValidateMethodMessage
source: Type {0} already implements the Validate method.
cs: Typ {0} již implementuje metodu Validate.
de: Der Typ "{0}" implementiert bereits die Validate-Methode.
es: El tipo {0} ya implementa el método Validate.
fr: Le type {0} implémente déjà la méthode Validate.
it: Il tipo {0} implementa già il metodo Validate.
ja: 型 {0} に Validate メソッドが既に実装されています。
ko: 형식 {0}은(는) Validate 메서드를 이미 구현하고 있습니다.
pl: Typ {0} już implementuje metodę Validate.
pt_br: O tipo {0} já implementa o método Validar.
ru: Тип {0} уже реализует метод Validate.
tr: {0} türü Doğrulama yöntemini zaten uyguluyor.
zh_hans: 类型 {0} 已实现 Validate 方法。
zh_hant: 類型 {0} 已實作 [驗證] 方法。

# AlreadyImplementsValidateMethodTitle
source: A type already includes an implementation of the 'Validate' method.
cs: Typ už obsahuje implementaci metody Validate.
de: Ein Typ enthält bereits eine Implementierung der Validate-Methode.
es: Un tipo ya incluye una implementación del método “Validate”.
fr: Un type inclut déjà une implémentation de la méthode 'Validate'.
it: Un tipo include già un'implementazione del metodo 'Validate'.
ja: 型には 'Validate' メソッドの実装が既に含まれています。
ko: 형식에 'Validate' 메서드 구현이 이미 포함되어 있습니다.
pl: Typ zawiera już implementację metody „Validate”.
pt_br: Um tipo já inclui uma implementação do método "Validar".
ru: Тип уже содержит реализацию метода Validate.
tr: Bir tür zaten 'Validate' yönteminin bir uygulamasını içeriyor.
zh_hans: 类型已包含“Validate”方法的实现。
zh_hant: 類型已經包含 [驗證] 方法的實作。

# CantBeStaticClassMessage
source: [OptionsValidator] cannot be applied to static class {0}.
cs: [OptionsValidator] nelze použít pro statickou třídu {0}.
de: [OptionsValidator] kann nicht auf die statische Klasse "{0}" angewendet werden.
es: No se puede aplicar [OptionsValidator] a la clase estática {0}.
fr: [OptionsValidator] ne peut pas être appliqué à la classe statique {0}.
it: impossibile applicare [OptionsValidator] alla classe statica {0}.
ja: 静的クラス {0} には [OptionsValidator] を適用できません。
ko: [OptionsValidator]은(는) 정적 클래스 {0}에 적용할 수 없습니다.
pl: Nie można zastosować elementu [OptionsValidator] do klasy statycznej {0}.
pt_br: [OptionsValidator] não pode ser aplicado à classe estática {0}.
ru: [OptionsValidator] невозможно применить к статическому классу {0}.
tr: [OptionsValidator], {0} statik sınıfına uygulanamıyor.
zh_hans: [OptionsValidator] 无法应用于静态类 {0}。
zh_hant: [OptionsValidator] 無法套用至靜態類別 {0}。

# CantBeStaticClassTitle
source: 'OptionsValidatorAttribute' can't be applied to a static class.
cs: OptionsValidatorAttribute nelze použít pro statickou třídu.
de: "OptionsValidatorAttribute" kann nicht auf eine statische Klasse angewendet werden.
es: “OptionsValidatorAttribute” no se puede aplicar a una clase estática.
fr: 'OptionsValidatorAttribute' ne peut pas être appliqué à une classe statique.
it: 'OptionsValidatorAttribute' non può essere applicato a una classe statica.
ja: 'OptionsValidatorAttribute' は静的クラスに適用できません。
ko: 'OptionsValidatorAttribute'는 정적 클래스에 적용할 수 없습니다.
pl: Nie można zastosować elementu „OptionsValidatorAttribute” do klasy statycznej.
pt_br: "OptionsValidatorAttribute" não pode ser aplicado a uma classe estática.
ru: Параметр OptionsValidatorAttribute не может быть применен к статическому классу.
tr: 'OptionsValidatorAttribute' statik sınıfa uygulanamaz.
zh_hans: “OptionsValidatorAttribute”不能应用于静态类。
zh_hant: 無法將 'OptionsValidatorAttribute' 套用至靜態類別。

# CantUseWithGenericTypesMessage
source: Can't use [ValidateObjectMembers] or [ValidateEnumeratedItems] on fields or properties with open generic type {0}.
cs: U polí nebo vlastností s otevřeným obecným typem {0} nelze použít [ValidateObjectMembers] nebo [ValidateEnumeratedItems].
de: "ValidateObjectMembers" oder "ValidateEnumeratedItems" kann nicht für Felder oder Eigenschaften mit offenem generischen Typ {0} verwendet werden.
es: No se puede usar [ValidateObjectMembers] ni [ValidateEnumeratedItems] en campos o propiedades con tipos genéricos abiertos {0}.
fr: Impossible d’utiliser [ValidateObjectMembers] ou [ValidateEnumeratedItems] sur des champs ou des propriétés avec un type générique ouvert {0}.
it: Non è possibile usare [ValidateObjectMembers] o [ValidateEnumeratedItems] in campi o proprietà con tipo generico aperto {0}.
ja: [ValidateObjectMembers] または [ValidateEnumeratedItems] は、オープンジェネリック型 {0} を持つフィールドまたはプロパティでは使用できません。
ko: 열린 제네릭 형식 {0}의 필드 또는 속성에는 [ValidateObjectMembers] 또는 [ValidateEnumeratedItems]을(를) 사용할 수 없습니다.
pl: Nie można użyć atrybutu [ValidateObjectMembers] lub [ValidateEnumeratedItems] w polach lub właściwościach z otwartymi typami ogólnymi {0}.
pt_br: Não é possível usar [ValidateObjectMembers] ou [ValidateEnumeratedItems] em campos ou propriedades com o tipo genérico aberto {0}.
ru: Нельзя использовать [ValidateObjectMembers] или [ValidateEnumeratedItems] для полей или свойств с открытыми универсальными типами {0}.
tr: {0} açık genel türündeki alanlarda veya özelliklerde [ValidateObjectMembers] veya [ValidateEnumeratedItems] kullanılamaz.
zh_hans: 不能对具有开放泛型类型 {0} 的字段或属性使用 [ValidateObjectMembers] 或 [ValidateEnumeratedItems]。
zh_hant: 無法在有開放式泛型型別 {0} 的欄位或屬性上使用 [ValidateObjectMembers] 或 [ValidateEnumeratedItems]。

# CantUseWithGenericTypesTitle
source: Can't use 'ValidateObjectMembersAttribute' or 'ValidateEnumeratedItemsAttribute' on fields or properties with open generic types.
cs: U polí nebo vlastností s otevřenými obecnými typy nelze použít ValidateObjectMembersAttribute nebo ValidateEnumeratedItemsAttribute.
de: "ValidateObjectMembersAttribute" oder "ValidateEnumeratedItemsAttribute" kann nicht für Felder oder Eigenschaften mit offenen generischen Typen verwendet werden.
es: No se puede usar “ValidateObjectMembersAttribute” o “ValidateEnumeratedItemsAttribute” en campos o propiedades con tipos genéricos abiertos.
fr: Impossible d’utiliser 'ValidateObjectMembersAttribute' ou 'ValidateEnumeratedItemsAttribute' sur des champs ou des propriétés avec des types génériques ouverts.
it: Non è possibile usare 'ValidateObjectMembersAttribute' o 'ValidateEnumeratedItemsAttribute' nei campi o nelle proprietà con tipi generici aperti.
ja: 'ValidateObjectMembersAttribute' または 'ValidateEnumeratedItemsAttribute' は、オープンジェネリック型を持つフィールドまたはプロパティでは使用できません。
ko: 열린 제네릭 형식의 필드 또는 속성에는 'ValidateObjectMembersAttribute' 또는 'ValidateEnumeratedItemsAttribute'를 사용할 수 없습니다.
pl: Nie można użyć atrybutu „ValidateObjectMembersAttribute” lub „ValidateEnumeratedItemsAttribute” w polach lub właściwościach z otwartymi typami ogólnymi.
pt_br: Não é possível usar "ValidateObjectMembersAttribute" ou "ValidateEnumeratedItemsAttribute" em campos ou propriedades com tipos genéricos abertos.
ru: Нельзя использовать "ValidateObjectMembersAttribute" или "ValidateEnumeratedItemsAttribute" для полей или свойств с открытыми универсальными типами.
tr: Açık genel türleri olan alanlarda veya özelliklerde 'ValidateObjectMembersAttribute' veya 'ValidateEnumeratedItemsAttribute' kullanılamaz.
zh_hans: 不能对具有开放泛型类型的字段或属性使用 "ValidateObjectMembersAttribute" 或 "ValidateEnumeratedItemsAttribute"。
zh_hant: 無法在有開放式泛型型別的欄位或屬性上使用 'ValidateObjectMembersAttribute' 或 'ValidateEnumeratedItemsAttribute'。

# CantValidateStaticOrConstMemberMessage
source: Can't apply validation attributes to constant or static member {0}.
cs: Atributy ověřování nelze použít u konstantního ani statického člena {0}.
de: Validierungsattribute können nicht auf konstanten oder statischen Member {0} angewendet werden.
es: No se pueden aplicar atributos de validación a un miembro {0}constante o estático.
fr: Impossible d’appliquer les attributs de validation au membre constant ou statique {0}.
it: Non è possibile applicare attributi di convalida a un membro costante o statico {0}.
ja: 定数または静的メンバー {0} に検証属性を適用できません。
ko: 상수 또는 정적 멤버 {0}에 유효성 검사 특성을 적용할 수 없습니다.
pl: Nie można zastosować atrybutów walidacji do stałych lub statycznych elementów członkowskich {0}.
pt_br: Não é possível aplicar atributos de validação a um membro constante ou estático {0}.
ru: Не удалось применить атрибуты проверки к константе или статическому элементу {0}.
tr: Doğrulama öznitelikleri sabit veya statik üye {0} için geçerli değildir.
zh_hans: 无法将验证属性应用于常量或静态成员 {0}。
zh_hant: 無法將驗證屬性套用至常數或靜態成員 {0}。

# CantValidateStaticOrConstMemberTitle
source: Can't validate constants, static fields or properties.
cs: Nelze ověřit konstanty, statická pole ani vlastnosti.
de: Konstanten, statische Felder oder Eigenschaften können nicht überprüft werden.
es: No se pueden validar constantes, campos estáticos ni propiedades.
fr: Impossible de valider les constantes, les champs statiques ou les propriétés.
it: Non è possibile convalidare costanti, campi statici o proprietà.
ja: 定数、静的フィールド、またはプロパティを検証できません。
ko: 상수, 정적 필드 또는 속성을 확인할 수 없습니다.
pl: Nie można zweryfikować stałych, pól statycznych lub właściwości.
pt_br: Não é possível validar constantes, campos estáticos ou propriedades.
ru: Не удалось проверить константы, статические поля или свойства.
tr: Sabitler, statik alanlar veya özellikler doğrulanamıyor.
zh_hans: 无法验证常量、静态字段或属性。
zh_hant: 無法驗證常數、靜態欄位或屬性。

# CircularTypeReferencesMessage
source: There is a circular type reference involving type {0} preventing it from being used for static validation.
cs: Existuje cyklický odkaz obsahující typ {0}, který brání jeho použití pro statické ověření.
de: Es gibt einen Zirkelverweis, der den Typ "{0}" verhindert, dass er für die statische Validierung verwendet wird.
es: Hay una referencia de tipo circular que implica al tipo {0} que impide que se use para la validación estática.
fr: Une référence de type circulaire implique un type {0} l’empêche d’être utilisé pour la validation statique.
it: Esiste un riferimento di tipo circolare che interessa il tipo {0} e ne impedisce l'utilizzo per la convalida statica.
ja: 型{0}を含む循環型参照があるため、静的検証に使用できません。
ko: 정적 유효성 검사에 사용할 수 없으므로 형식 {0} 관련된 순환 형식 참조가 있습니다.
pl: Istnieje cykliczne odwołanie do typu dotyczące typu {0} uniemożliwiające użycie go do weryfikacji statycznej.
pt_br: Há uma referência de tipo circular que envolve o tipo {0} que a impede de ser usada para validação estática.
ru: Существует циклическая ссылка на тип, включающая тип {0}, предотвращающий его использование для статической проверки.
tr: Statik doğrulama için kullanılmasını engelleyen {0} türü içeren döngüsel bir tür başvurusu var.
zh_hans: 存在一个循环类型引用，其中涉及的类型 {0} 阻止将其用于静态验证。
zh_hant: 有涉及類型 {0} 的循環類型參考讓它無法用於靜態驗證。

# CircularTypeReferencesTitle
source: Unsupported circular references in model types.
cs: Nepodporované cyklické odkazy v typech modelů.
de: Nicht unterstützte Zirkelverweise in Modelltypen.
es: Referencias circulares no admitidas en los tipos de modelo.
fr: Références circulaires non prises en charge dans les types de modèle.
it: Riferimenti circolari non supportati nei tipi di modello.
ja: モデル型でサポートされていない循環参照です。
ko: 모델 형식에 지원되지 않는 순환 참조가 있습니다.
pl: Nieobsługiwane odwołania cykliczne w typach modeli.
pt_br: Referências circulares sem suporte em tipos de modelo.
ru: Неподдерживаемые циклические ссылки в типах моделей.
tr: Model türlerde döngüsel başvurular desteklenmiyor.
zh_hans: 模型类型中不支持的循环引用。
zh_hant: 模型類型中不支援的循環參考。

# DoesntImplementIValidateOptionsMessage
source: Type {0} does not implement the required IValidateOptions<{1}> interface.
cs: Typ {0} neimplementuje požadované rozhraní IValidateOptions<{1}> .
de: Der Typ "{0}" implementiert nicht die erforderliche IValidateOptions<{1}>-Schnittstelle.
es: El tipo {0} no implementa la interfaz IValidateOptions<{1}> necesaria.
fr: Le type {0} n’implémente pas l’interface<{1}> IValidateOptions requise.
it: Il tipo {0} non implementa l'interfaccia IValidateOptions<{1}> richiesta.
ja: 必要な IValidateOptions<{1}> インターフェイスが型 {0} に実装されていません。
ko: 형식 {0}은(는) 필요한 IValidateOptions<{1}> 인터페이스를 구현하지 않습니다.
pl: Typ {0} nie implementuje wymaganego interfejsu IValidateOptions<{1}>.
pt_br: O tipo {0} não implementa a interface IValidateOptions<{1}> necessária.
ru: Тип {0} не реализует требуемый интерфейс IValidateOptions<{1}>.
tr: {0} türü gerekli IValidateOptions<{1}> arabirimini uygulamıyor.
zh_hans: 类型 {0} 未实现所需的 IValidateOptions<{1}> 接口。
zh_hant: 類型 {0} 未實作必要的 IValidateOptions<{1}> 介面。

# DoesntImplementIValidateOptionsTitle
source: A type annotated with 'OptionsValidatorAttribute' doesn't implement the necessary interface.
cs: Typ anotovaný třídou OptionsValidatorAttribute neimplementuje nezbytné rozhraní.
de: Ein mit "OptionsValidatorAttribute" versehener Typ implementiert nicht die erforderliche Schnittstelle.
es: Un tipo anotado con “OptionsValidatorAttribute” no implementa la interfaz necesaria.
fr: Un type annoté avec 'OptionsValidatorAttribute' n’implémente pas l’interface nécessaire.
it: Un tipo annotato con 'OptionsValidatorAttribute' non implementa l'interfaccia necessaria.
ja: 'OptionsValidatorAttribute' の注釈が付けられた型が、必要とされるインターフェイスを実装していません。
ko: 'OptionsValidatorAttribute'로 주석이 추가된 형식은 필요한 인터페이스를 구현하지 않습니다.
pl: Typ z adnotacją „OptionsValidatorAttribute” nie implementuje wymaganego interfejsu.
pt_br: Um tipo anotado com "OptionsValidatorAttribute" não implementa a interface necessária.
ru: Тип с аннотацией OptionsValidatorAttribute не реализует необходимый интерфейс.
tr: 'OptionsValidatorAttribute' ile açıklama eklenmiş bir tür gerekli arabirimi uygulamıyor.
zh_hans: 用 "OptionsValidatorAttribute" 批注的类型未实现必要的接口。
zh_hant: 以 'OptionsValidatorAttribute' 附註的類型未實作必要的介面。

# InaccessibleValidationAttributeMessage
source: Validation attribute '{0}' on the member '{1}' is inaccessible from the validator type '{2}'.
cs: Ověřovací atribut „{0}“ u člena „{1}“ není přístupný z typu validátoru „{2}“.
de: Auf das Validierungsattribut "{0}" für den Member "{1}" kann vom Validierungssteuerelementtyp "{2}" nicht zugegriffen werden.
es: No se puede obtener acceso al atributo de validación '{0}' en el miembro '{1}' desde el tipo de validador '{2}'.
fr: L’attribut de validation '{0}' sur le membre '{1}' n’est pas accessible à partir du type de validateur '{2}'.
it: L'attributo di convalida '{0}' nel membro '{1}' non è accessibile dal tipo di validator '{2}'.
ja: メンバー '{0}' の検証属性 '{1}' は、検証コントロールの種類 '{2}'からアクセスできません。
ko: 유효성 검사기 유형 '{2}'에서 '{1}' 멤버의 '{0}' 유효성 검사 특성에 액세스할 수 없습니다.
pl: Atrybut walidacji „{0}” elementu członkowskiego „{1}” jest niedostępny z typu modułu sprawdzania poprawności „{2}”.
pt_br: O atributo de validação '{0}' no membro '{1}' está inacessível do tipo de validador '{2}'.
ru: Атрибут проверки "{0}" элемента "{1}" недоступен из типа средства проверки "{2}".
tr: '{1}' adlı üye üzerindeki '{0}' doğrulama özniteliğine '{2}' doğrulayıcı türünden erişilemiyor.
zh_hans: 无法从验证程序类型“{2}”访问成员“{1}”上的验证属性“{0}”。
zh_hant: 無法從驗證程式類型 '{2}' 存取成員 '{1}' 上的驗證屬性 '{0}'。

# InaccessibleValidationAttributeTitle
source: Validation attribute on the member is inaccessible from the validator type..
cs: Ověřovací atribut u člena není přístupný z typu validátoru.
de: Auf das Validierungsattribut für den Member kann vom Validierungssteuerelementtyp nicht zugegriffen werden.
es: No se puede obtener acceso al atributo de validación en el miembro desde el tipo de validador.
fr: L’attribut de validation sur le membre n’est pas accessible à partir du type de validateur.
it: L'attributo di convalida nel membro non è accessibile dal tipo di validator.
ja: メンバーの検証属性は、検証コントロールの種類からアクセスできません...
ko: 유효성 검사기 유형에서 멤버의 유효성 검사 특성에 액세스할 수 없습니다.
pl: Atrybut walidacji elementu członkowskiego jest niedostępny z typu modułu sprawdzania poprawności.
pt_br: O atributo de validação no membro está inacessível do tipo de validador.
ru: Атрибут проверки элемента недоступен из типа средства проверки.
tr: Üye üzerindeki doğrulama özniteliğine doğrulayıcı türünden erişilemiyor.
zh_hans: 无法从验证程序类型访问成员上的验证属性。
zh_hant: 無法從驗證程式類型存取成員上的驗證屬性。

# MemberIsInaccessibleMessage
source: Can't apply validation attributes to private field or property {0}.
cs: Ověřovací atributy nelze použít u privátního pole nebo vlastnosti {0}.
de: Validierungsattribute können nicht auf private Felder oder Eigenschaften {0} angewendet werden.
es: No se pueden aplicar atributos de validación a la propiedad o campo privado {0}.
fr: Impossible d’appliquer les attributs de validation au champ privé ou à la propriété {0}.
it: Non è possibile applicare gli attributi di convalida al campo privato o alla proprietà {0}.
ja: プライベート フィールドまたはプロパティ {0} には検証属性を適用できません。
ko: 프라이빗 필드 또는 속성 {0}에 유효성 검사 특성을 적용할 수 없습니다.
pl: Nie można zastosować atrybutów weryfikacji do pola prywatnego lub właściwości {0}.
pt_br: Não é possível aplicar atributos de validação a um campo privado ou propriedade {0}.
ru: Не удается применить атрибуты проверки к закрытому полю или свойству {0}.
tr: Doğrulama öznitelikleri, {0} özel alanına veya özelliğine uygulanamıyor.
zh_hans: 无法将验证属性应用于专用字段或属性 {0}。
zh_hant: 無法將驗證屬性套用至私用欄位或屬性 {0}。

# MemberIsInaccessibleTitle
source: Can't validate private fields or properties.
cs: Nelze ověřit privátní pole nebo vlastnosti.
de: Private Felder oder Eigenschaften können nicht überprüft werden.
es: No se pueden validar los campos o propiedades privadas.
fr: Impossible de valider les champs ou propriétés privés.
it: Non è possibile convalidare proprietà o campi privati.
ja: プライベート フィールドまたはプロパティを検証できません。
ko: 프라이빗 필드 또는 속성의 유효성을 검사할 수 없습니다.
pl: Nie można zweryfikować prywatnych pól lub właściwości.
pt_br: Não é possível validar propriedades ou campos privados.
ru: Не удается проверить частные поля или свойства.
tr: Özel alanlar veya özellikler doğrulanamıyor.
zh_hans: 无法验证专用字段或属性。
zh_hant: 無法驗證私人欄位或屬性。

# NoEligibleMemberMessage
source: Type {0} has no fields or properties to validate, referenced from member {1}.
cs: Typ {0} nemá žádná pole ani vlastnosti k ověření, na které odkazuje člen {1}.
de: Der Typ "{0}" weist keine zu überprüfenden Felder oder Eigenschaften auf, auf die von Member "{1}" verwiesen wird.
es: El tipo {0} no tiene campos ni propiedades para validar, al que hace referencia el tipo {1}.
fr: Le type {0} n’a aucun champ ou propriété à valider, référencé à partir du membre {1}.
it: Il tipo {0} non contiene campi o proprietà da convalidare, riferiti dal membro {1}.
ja: 型 {0} にメンバー {1} から参照されている検証対象のフィールドまたはプロパティがありません。
ko: 형식 {0}은(는) 유효성을 검사할 필드 또는 속성이 없으므로 멤버 {1}을(를) 참조합니다.
pl: Typ {0} nie ma pól ani właściwości do zweryfikowania, do których odwołuje się element członkowski {1}.
pt_br: O tipo {0} não tem campos ou propriedades para validar, referenciados do membro {1}.
ru: Тип {0} не содержит полей или свойств для проверки, на которые ссылается из элемента {1}.
tr: {0} türünde doğrulanacak alan veya özellik yok, {1} üyesinden başvurulur.
zh_hans: 类型 {0} 没有要验证的字段或属性，从成员 {1} 中引用。
zh_hant: 參照會員 {1}，類型 {0} 沒有欄位或屬性可供驗證。

# NoEligibleMemberTitle
source: A member type has no fields or properties to validate.
cs: Typ člena nemá žádná pole ani vlastnosti k ověření.
de: Ein Membertyp weist keine zu überprüfenden Felder oder Eigenschaften auf.
es: Un tipo de miembro no tiene campos ni propiedades para validar.
fr: Un type de membre n’a aucun champ ou propriété à valider.
it: Un tipo di membro non contiene campi o proprietà da convalidare.
ja: メンバー型に検証対象のフィールドまたはプロパティがありません。
ko: 멤버 형식에 유효성을 검사할 필드 또는 속성이 없습니다.
pl: Typ elementu członkowskiego nie ma pól ani właściwości do zweryfikowania.
pt_br: Um tipo de membro não tem campos ou propriedades a serem validados.
ru: Тип элемента не имеет полей или свойств для проверки.
tr: Üye türünde doğrulanacak alan veya özellik yok.
zh_hans: 成员类型没有要验证的字段或属性。
zh_hant: 成員類型沒有欄位或屬性可供驗證。

# NoEligibleMembersFromValidatorMessage
source: Type {0} has no fields or properties to validate, referenced by type {1}.
cs: Typ {0} nemá žádná pole ani vlastnosti k ověření, na které odkazuje typ {1}.
de: Der Typ "{0}" weist keine zu überprüfenden Felder oder Eigenschaften auf, auf die vom Typ "{1}" verwiesen wird.
es: El tipo {0} no tiene campos ni propiedades para validar, al que hace referencia el tipo {1}.
fr: Le type {0} n’a pas de champs ou de propriétés à valider, référencé par type {1}.
it: Il tipo {0} non contiene campi o proprietà da convalidare, riferiti per tipo {1}.
ja: 型 {0} に型 {1} で参照されている検証対象のフィールドまたはプロパティがありません。
ko: 형식 {0}은(는) 유효성을 검사할 필드 또는 속성이 없으므로 형식 {1}을(를) 참조합니다.
pl: Typ {0} nie ma pól ani właściwości do zweryfikowania, do których odwołuje się typ {1}.
pt_br: O tipo {0} não tem campos ou propriedades para validar, referenciados por tipo {1}.
ru: Тип {0} не содержит полей или свойств для проверки, на которые ссылается тип {1}.
tr: {0} türünde doğrulanacak alan veya özellik yok, {1} türü tarafından başvurulur.
zh_hans: 类型 {0} 没有要验证的字段或属性，由类型 {1} 引用。
zh_hant: 參照類型 {1}，類型 {0} 沒有欄位或屬性可供驗證。

# NoEligibleMembersFromValidatorTitle
source: A type has no fields or properties to validate.
cs: Typ nemá žádná pole ani vlastnosti k ověření.
de: Ein Typ weist keine zu überprüfenden Felder oder Eigenschaften auf.
es: Un tipo no tiene campos ni propiedades para validar.
fr: Un type n’a pas de champs ou de propriétés à valider.
it: Un tipo non contiene campi o proprietà da convalidare.
ja: 型に検証対象のフィールドまたはプロパティがありません。
ko: 형식에 유효성을 검사할 필드 또는 속성이 없습니다.
pl: Typ nie ma pól ani właściwości do zweryfikowania.
pt_br: Um tipo não tem campos ou propriedades a serem validados.
ru: Тип не имеет полей или свойств для проверки.
tr: Türde doğrulanacak alan veya özellik yok.
zh_hans: 类型没有要验证的字段或属性。
zh_hant: 類型沒有欄位或屬性可供驗證。

# NotEnumerableTypeMessage
source: [ValidateEnumeratedItems] cannot be used on members of type {0} as it doesn't implement IEnumerable<T>.
cs: [ValidateEnumeratedItems] nelze použít u členů typu {0}, protože neimplementuje rozhraní IEnumerable<T>.
de: [ValidateEnumeratedItems] kann nicht für Member vom Typ "{0}" verwendet werden, da es IEnumerable<T> nicht implementiert.
es: [ValidateEnumeratedItems] no se puede usar en miembros de tipo {0} porque no implementa IEnumerable<T>.
fr: [ValidateEnumeratedItems] ne peut pas être utilisé sur des membres de type {0}, car il n’implémente pas IEnumerable<T>.
it: [ValidateEnumeratedItems] non può essere usato nei membri di tipo {0} perché non implementa IEnumerable<T>.
ja: [ValidateEnumeratedItems] は IEnumerable<T> を実装していないため、型 {0} のメンバーでは使用できません。
ko: [ValidateEnumeratedItems]은(는) IEnumerable<T>을(를) 구현하지 않으므로 형식 {0}의 멤버에 사용할 수 없습니다.
pl: Atrybutu [ValidateEnumeratedItems] nie można używać w przypadku elementów członkowskich typu {0}, ponieważ nie implementuje interfejsu IEnumerable<T>.
pt_br: [ValidateEnumeratedItems] não pode ser usado em membros do tipo {0}, pois ele não implementa IEnumerable<T>.
ru: [ValidateEnumeratedItems] не может использоваться для элементов типа {0}, так как он не реализует IEnumerable<T>.
tr: [ValidateEnumeratedItems], IEnumerable<T> uygulamadığından {0} türündeki üyeler üzerinde kullanılamıyor.
zh_hans: 无法对类型 {0} 的成员使用 [ValidateEnumeratedItems]，因为它未实现 IEnumerable<T>。
zh_hant: [ValidateEnumeratedItems] 無法用於類型 {0} 的成員，因為其未實作 IEnumerable<T>。

# NotEnumerableTypeTitle
source: Member type is not enumerable.
cs: Typ členu není výčtový.
de: Der Membertyp ist nicht aufzählbar.
es: El tipo de miembro no es enumerable.
fr: Le type de membre n’est pas énumérable.
it: Il tipo di membro non è enumerabile.
ja: メンバー型は列挙型ではありません。
ko: 멤버 형식을 열거할 수 없습니다.
pl: Nie można wyliczyć typu elementu członkowskiego.
pt_br: O tipo de membro não é enumerável.
ru: Тип элемента не является перечисляемым.
tr: Üye türü numaralandırılabilir değil.
zh_hans: 成员类型不可枚举。
zh_hant: 成員類型無法列舉。
