Repository: dotnet/runtime
Catalog: src/libraries/Microsoft.Extensions.Logging.Abstractions/gen/Resources/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# RedundantQualifierInMessageMessage
source: Remove redundant qualifier (Info:, Warning:, Error:, etc) from the logging message since it is implicit in the specified log level.
cs: Odeberte redundantní kvalifikátor (Informace:, Upozornění:, Chyba: atd.) ze zprávy o protokolování, protože je na zadané úrovni protokolu implicitní.
de: Entfernen Sie den redundanten Qualifizierer (z. B. "Info:", "Warnung:" oder "Fehler:") aus der Protokollierungsmeldung, weil er auf der angegebenen Protokollebene implizit enthalten ist.
es: Quitar calificadores redundantes (Información:, Advertencia:, Error:, etc.) del mensaje de registro, ya que está implícito en el nivel de registro especificado.
fr: Supprimez le qualificateur redondant (Info:, Warning:, Error:, etc.) du message de journalisation, car il est implicite dans le niveau de journalisation spécifié.
it: Rimuovere il qualificatore ridondante (Informazioni:, Avviso:, Errore: e così via) dal messaggio di registrazione perché è implicito nel livello di log specificato.
ja: 指定されたログ レベルでは暗黙的であるため、冗長な修飾子 (Info:、Warning:、Error: など) をログ メッセージから削除します。
ko: 중복 한정자(정보:, 경고:, 오류: 등)가 지정된 로그 수준에서 암시적이기 때문에 로깅 메시지에서 제거합니다.
pl: Usuń nadmiarowy kwalifikator (Info:, Warning:, Error: itp.) z komunikatu rejestrowania, ponieważ jest on domyślny na określonym poziomie dziennika.
pt_br: Remova o qualificador redundante (Info:, Aviso:, Erro:, etc) da mensagem de log, pois está implícito no nível de log especificado.
ru: Удалите избыточный квалификатор (Info:, Warning:, Error:, и т. п.) из сообщения журнала, поскольку квалификатор подразумевается на указанном уровне ведения журнала.
tr: Belirtilen günlük düzeyinde örtük olduğundan gereksiz niteleyiciyi (Bilgi:, Uyarı:, Hata: vb.) günlüğe kaydetme iletisinden kaldırın.
zh_hans: 从日志记录消息中删除冗余限定符(信息:、警告:、错误: 等)，因为其在指定的日志级别中为隐式内容。
zh_hant: 從記錄訊息中移除備援限定詞 (資訊:、警告:、錯誤: 等等)，因為它在指定的記錄層級中為隱含。

# RedundantQualifierInMessageTitle
source: Redundant qualifier in logging message
cs: Redundantní kvalifikátor ve zprávě o protokolování
de: Redundanter Qualifizierer in Protokollierungsmeldung
es: Calificador redundante en el mensaje de registro
fr: Qualificateur redondant dans le message de journalisation
it: Qualificatore ridondante nel messaggio di registrazione
ja: ログ メッセージ内の冗長な修飾子
ko: 로깅 메시지에 중복 한정자가 있음
pl: Nadmiarowy kwalifikator w komunikacie rejestrowania
pt_br: Qualificador redundante na mensagem de registro de log
ru: Избыточный квалификатор в сообщении журнала
tr: Günlüğe kaydetme iletisindeki gereksiz niteleyici
zh_hans: 日志消息消息中的冗余限定符
zh_hant: 記錄訊息中的備援限定詞

# ShouldntMentionExceptionInMessageTitle
source: Don't include exception parameters as templates in the logging message
cs: Nezahrnovat parametry výjimek jako šablony do zprávy o protokolování
de: Ausnahmeparameter nicht als Vorlagen in die Protokollierungsmeldung einbeziehen
es: No incluya parámetros de excepción como plantillas en el mensaje de registro
fr: Ne pas ajouter de paramètres d’exception comme modèles dans le message de journalisation
it: Non includere i parametri di eccezione come modelli nel messaggio di registrazione
ja: ログ メッセージに例外パラメーターをテンプレートとして含めません
ko: 로깅 메시지에 템플릿으로 예외 매개 변수를 포함하지 않음
pl: Nie dołączać parametrów wyjątków jako szablonów w komunikatach rejestrowania
pt_br: Não inclua parâmetros de exceção como modelos na mensagem de registro em log
ru: Не включайте параметры исключений в качестве шаблонов в сообщение ведения журнала
tr: Özel durum parametrelerini günlüğe kaydetme iletisine şablon olarak eklemeyin
zh_hans: 不要将异常参数作为模板包含在日志记录消息中
zh_hant: 請勿在記錄訊息中包含做為範本的例外狀況參數

# ShouldntMentionInTemplateMessage
source: Don't include a template for {0} in the logging message since it is implicitly taken care of
cs: Nezahrnovat do zprávy o protokolování šablonu pro {0}, protože se zpracovává implicitně.
de: Fügen Sie in der Protokollierungsmeldung keine Vorlage für "{0}" ein, weil dies implizit berücksichtigt wird.
es: No incluya ninguna plantilla para {0} en el mensaje de registro, ya que está resuelto implícitamente
fr: Ne pas ajouter de modèle pour {0} dans le message de journalisation, car il est implicitement pris en charge
it: Non includere un modello per {0} nel messaggio di registrazione perché è gestito in modo implicito
ja: 暗黙的に処理が行 われているため、ログ メッセージに {0} のテンプレートを含めません
ko: {0}에 대한 템플릿은 암시적으로 처리되므로 로깅 메시지에 포함하지 않음
pl: Nie dołączać szablonu dla {0} do komunikatu o rejestracji, ponieważ jest to wykonywane domyślnie
pt_br: Não inclua um modelo para {0} na mensagem de registro em log, pois isso é implicitamente atendido
ru: Не включайте шаблон для {0} в сообщение ведения журнала, поскольку он используется неявным образом
tr: Örtük olarak dikkate alındığından günlüğe kaydetme iletisine {0} şablonu eklemeyin
zh_hans: 不要将 {0} 的模板包含在日志记录消息中，因为其被隐式处理
zh_hant: 請勿在記錄訊息中包含 {0} 的範本，因為系統是將它隱含處理

# ShouldntMentionLogLevelInMessageTitle
source: Don't include log level parameters as templates in the logging message
cs: Nezahrnovat parametry úrovně protokolu jako šablony do zprávy o protokolování
de: Protokolliergradparameter nicht als Vorlagen in die Protokollierungsmeldung einbeziehen
es: No incluya parámetros de nivel de registro como plantillas en el mensaje de registro
fr: Ne pas ajouter de paramètres de niveau de journalisation comme modèles dans le message de journalisation
it: Non includere i parametri del livello di log come modelli nel messaggio di registrazione
ja: ログ メッセージには、ログ レベル パラメーターをテンプレートとして含めることはできません
ko: 로깅 메시지에 템플릿으로 로그 수준 매개 변수를 포함하지 않음
pl: Nie dołączać parametrów poziomu dziennika jako szablonów w komunikatach rejestrowania
pt_br: Não inclua parâmetros de nível de registro como modelos na mensagem de registro de log
ru: Не включайте параметры уровня журнала в качестве шаблонов в сообщение ведения журнала
tr: Günlük düzeyi parametrelerini günlüğe kaydetme iletisine şablon olarak eklemeyin
zh_hans: 不要将日志级别参数作为模板包含在日志记录消息中
zh_hant: 請勿在記錄訊息中包含做為範本的記錄層級參數

# ShouldntMentionLoggerInMessageTitle
source: Don't include logger parameters as templates in the logging message
cs: Nezahrnovat parametry protokolovacího nástroje jako šablony do zprávy o protokolování
de: Protokollierungsparameter nicht als Vorlagen in die Protokollierungsmeldung einbeziehen
es: No incluya parámetros del registrador como plantillas en el mensaje de registro
fr: Ne pas ajouter de paramètres d’enregistreur de journalisation comme modèles dans le message de journalisation
it: Non includere i parametri del logger come modelli nel messaggio di registrazione
ja: ログ メッセージにロガー パラメーターをテンプレートとして含めません
ko: 로깅 메시지에 템플릿으로 로거 매개 변수를 포함하지 않음
pl: Nie dołączać parametrów rejestratora jako szablonów do komunikatu rejestrowania
pt_br: Não inclua parâmetros de agente como modelos na mensagem de registro em log
ru: Не включайте параметры средства ведения журнала в качестве шаблонов в сообщение ведения журнала
tr: Günlükçü parametrelerini günlüğe kaydetme iletisine şablon olarak eklemeyin
zh_hans: 不要将记录器参数作为模板包含在日志记录消息中
zh_hant: 請勿在記錄訊息中包含做為範本的記錄器參數

# ShouldntReuseEventIdsMessage
source: Multiple logging methods are using event id {0} in class {1}
cs: Více než jedna metoda protokolování používá ve třídě {1} ID události {0}.
de: Die Ereignis-ID "{0}" wird von mehreren Protokollierungsmethoden in der Klasse "{1}" verwendet.
es: Varios métodos de registro usan el id. de evento {0} en la clase {1}
fr: Plusieurs méthodes de journalisation utilisent l’ID d’événement {0} dans la classe {1}
it: Più metodi di registrazione stanno utilizzando l'ID evento {0} nella classe {1}
ja: 複数のログ記録方法でクラス {1}内のイベント ID {0} を使用しています
ko: {1} 클래스에서 여러 로깅 메서드가 이벤트 ID {0}을(를) 사용함
pl: Wiele metod rejestrowania używa identyfikatora zdarzenia {0} w klasie {1}
pt_br: Múltiplos métodos de registro em log estão usando a id de evento {0} na classe {1}
ru: Несколько методов ведения журнала используют идентификатор события {0} в классе {1}
tr: Birden çok günlüğe kaydetme yöntemi {1} sınıfında {0} olay kimliğini kullanıyor
zh_hans: 多个日志记录方法正在类 {1} 中使用事件 ID {0}
zh_hant: 多個記錄方法是使用類別 {1} 中的事件識別碼 {0}

# ShouldntReuseEventIdsTitle
source: Multiple logging methods cannot use the same event id within a class
cs: Více než jedna metoda protokolování nemůže v rámci třídy používat stejné ID události.
de: Dieselbe Ereignis-ID kann nicht von mehreren Protokollierungsmethoden innerhalb einer Klasse verwendet werden
es: Varios métodos de registro no pueden usar un mismo id. de evento en una clase
fr: Le même ID d’événement dans une classe ne peut pas être utilisé par plusieurs méthodes de journalisation
it: Più metodi di registrazione non possono utilizzare lo stesso ID evento all'interno di una classe
ja: 複数のログ記録方法では、クラス内で同じイベント ID を使用できません
ko: 여러 로깅 메서드가 한 클래스 내에서 동일한 이벤트 ID를 사용할 수는 없음
pl: Wiele metod rejestrowania nie może używać tego samego identyfikatora zdarzenia w obrębie klasy
pt_br: Múltiplos métodos de registro em log não podem usar o mesmo id de evento dentro de uma classe
ru: Несколько методов ведения журнала не могут использовать одинаковый ИД события в пределах класса
tr: Birden çok günlüğe kaydetme yöntemi bir sınıf içinde aynı olay kimliğini kullanamaz
zh_hans: 多个日志记录方法不能在类中使用相同的事件 ID
zh_hant: 多個記錄方法不能在類別內使用相同的事件識別碼

# ShouldntReuseEventNamesMessage
source: Multiple logging methods are using event name {0} in class {1}
cs: Více než jedna metoda protokolování používá název události {0} ve třídě {1}
fr: Plusieurs méthodes de journalisation utilisent le nom d’événement {0} dans la classe {1}
it: Più metodi di registrazione stanno utilizzando il nome evento {0} nella classe {1}
ja: 複数のログ記録方法でクラス {1} 内のイベント名 {0} を使用しています
ko: {0} 클래스에서 여러 로깅 메서드가 이벤트 이름 {1}을(를) 사용함
pl: Wiele metod rejestrowania używa nazwy zdarzenia {0} w klasie {1}
tr: Birden çok günlüğe kaydetme yöntemi {1} sınıfında {0} olay adını kullanıyor
zh_hans: 多个日志记录方法正在类 {1} 中使用事件名称 {0}

# ShouldntReuseEventNamesTitle
source: Multiple logging methods should not use the same event name within a class
cs: Více než jedna metoda protokolování by nemělo používat stejný název události v rámci třídy
fr: Il ne faut pas que plusieurs méthodes de journalisation utilisent le même nom d’événement au sein d’une classe
it: Più metodi di registrazione non devono usare lo stesso nome di evento all'interno di una classe
ja: 複数のログ記録方法では、クラス内で同じイベント名を使用しないようにする必要があります
ko: 여러 로깅 메서드가 한 클래스 내에서 동일한 이벤트 이름을 사용하지 않아야 합니다
pl: Wiele metod rejestrowania nie powinno używać tej samej nazwy zdarzenia w klasie
tr: Birden çok günlüğe kaydetme yöntemi bir sınıf içinde aynı olay adını kullanmamalıdır
zh_hans: 多个日志记录方法不应在类中使用相同的事件名称

# TemplateHasNoCorrespondingArgumentMessage
source: Template '{0}' is not provided as argument to the logging method
cs: Šablona {0} se neposkytuje jako argument pro metodu protokolování.
de: Die Vorlage „{0}“ wird nicht als Argument für die Protokollierungsmethode bereitgestellt
es: La plantilla "{0}" no se proporciona como argumento para el método de registro
fr: Le modèle « {0} » n’est pas fourni comme argument de la méthode de journalisation
it: Il modello ‘{0}’ non è specificato come argomento per il metodo di registrazione
ja: テンプレート '{0}' は、ログ メソッドの引数として提供されません
ko: 템플릿 {0}이(가) 로깅 메서드에 인수로 제공되지 않음
pl: Nie podano szablonu „{0}” jako argumentu dla metody rejestrowania
pt_br: O modelo '{0}' não é fornecido como argumento para o método de registro
ru: Шаблон "{0}" не указан в качестве аргумента для метода ведения журнала
tr: ‘{0}’ şablonu günlüğe kaydetme yönteminin bağımsız değişkeni olarak sağlanmadı
zh_hans: 未将模板“{0}”作为参数提供给日志记录方法
zh_hant: 未將範本 '{0}' 提供做為記錄方法的引數

# TemplateHasNoCorrespondingArgumentTitle
source: Logging template has no corresponding method argument
cs: Šablona protokolování nemá žádný odpovídající argument metody
de: Protokollierungsvorlage weist kein entsprechendes Methodenargument auf
es: La plantilla de registro no tiene ningún argumento de método correspondiente
fr: Le modèle de journalisation n’a pas d’argument de méthode correspondant
it: Il modello di registrazione non ha alcun argomento del metodo corrispondente
ja: ログ テンプレートに対応するメソッド引数がありません
ko: 로깅 템플릿에 해당 하는 메서드 인수가 없음
pl: Szablon rejestrowania nie ma odpowiadającego mu argumentu metody
pt_br: O modelo de registro em log não tem nenhum argumento de método correspondente
ru: У шаблона журнала нет соответствующего аргумента метода
tr: Günlüğe kaydetme şablonunda karşılık gelen yöntem bağımsız değişkeni yok
zh_hans: 日志记录模板无相应的方法参数
zh_hant: 記錄範本沒有對應的方法引數

# MalformedFormatStringsMessage
source: Can't have malformed format strings (like dangling {, etc)
de: Nicht wohlgeformte Formatzeichenfolgen (beispielsweise mit überzähligen geschweiften Klammern) sind unzulässig.
es: No puede tener cadenas con formato incorrecto (como { final, etc.)
pt_br: Não pode ter cadeia de caracteres de formato malformadas (como final {, etc)
ru: Для строк формата не допускается неправильный формат (висячие символы "{" и т. п.)
zh_hant: 不能有格式錯誤的格式字串 (例如懸空 {, 等等)
