Repository: dotnet/runtime
Catalog: src/libraries/Microsoft.Extensions.Logging.Abstractions/gen/Resources/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ArgumentHasNoCorrespondingTemplateMessage
source: Argument '{0}' is not referenced from the logging message
cs: Na argument {0} se ve zprávě o protokolování neodkazuje.
de: Auf das Argument „{0}“ wird in der Protokollierungsnachricht nicht verwiesen.
es: No se hace referencia al argumento "{0}" en el mensaje de registro
fr: L’argument « {0} » n’est pas référencé à partir du message de journalisation
it: Il messaggio di registrazione non fa riferimento all'argomento '{0}'
ja: 引数 '{0}' はログ メッセージから参照されていません
ko: 로깅 메시지에서 ‘{0}’ 인수를 참조하지 않습니다.
pl: Do argumentu „{0}” nie odwołuje się komunikat rejestrowania
pt_br: O argumento '{0}' não é referenciado na mensagem de registro em log
ru: В сообщении ведения журнала нет ссылки на аргумент "{0}"
tr: '{0}' bağımsız değişkenine günlük iletisinden başvurulmuyor
zh_hans: 未从日志记录消息中引用参数“{0}”
zh_hant: 引數 '{0}' 未參照記錄訊息

# ArgumentHasNoCorrespondingTemplateTitle
source: Argument is not referenced from the logging message
cs: Na argument se zpráva o protokolování neodkazuje
de: Auf das Argument wird in der Protokollierungsmeldung nicht verwiesen
es: No se hace referencia al argumento en el mensaje de registro
fr: L’argument n’est pas référencé à partir du message de journalisation
it: Il messaggio di registrazione non fa riferimento all'argomento
ja: 引数はログ メッセージから参照されていません
ko: 로깅 메시지에서 인수를 참조하지 않음
pl: Do argumentu nie odwołuje się komunikat rejestrowania
pt_br: O argumento não é referenciado na mensagem de registro em log
ru: В сообщении ведения журнала нет ссылки на аргумент
tr: Bağımsız değişkene günlüğe kaydetme iletisinden başvurulmuyor
zh_hans: 未从日志记录消息中引用参数
zh_hant: 未從記錄訊息參照引數

# GeneratingForMax6ArgumentsMessage
source: Generating more than 6 arguments is not supported
cs: Generování více než 6 argumentů se nepodporuje.
de: Das Generieren von mehr als 6 Argumenten wird nicht unterstützt.
es: No se admite la generación de más de 6 argumentos
fr: La génération de plus de 6 arguments n’est pas prise en charge
it: La creazione di più di 6 argomenti non è supportata
ja: 6 つ以上の引数の生成はサポートされません
ko: 6개가 넘는 인수 생성은 지원되지 않음
pl: Generowanie więcej niż 6 argumentów nie jest obsługiwane
pt_br: A geração de mais de 6 argumentos não é suportada
ru: Формирование более 6 аргументов не поддерживается
tr: 6’dan fazla bağımsız değişken oluşturma özelliği desteklenmiyor
zh_hans: 不支持生成 6 个以上的参数
zh_hant: 不支援產生 6 個以上的引數

# InconsistentTemplateCasingMessage
source: Can't have the same template with different casing
cs: Nemůže mít stejnou šablonu s různým zápisem velkých a malých písmen.
de: Die gleiche Vorlage darf nicht mit einer anderen Groß-/Kleinschreibung vorliegen.
es: No se puede tener la misma plantilla con mayúsculas distintas
fr: Impossible d’avoir le même modèle avec une casse différente
it: Impossibile avere lo stesso modello con un utilizzo di maiuscole e minuscole diverso
ja: 大文字と小文字に対して同じテンプレートを使用できません
ko: 동일한 템플릿을 대/소문자를 다르게 하여 사용할 수는 없음
pl: Nie można mieć tego samego szablonu z różną wielkością liter
pt_br: Não é possível ter o mesmo modelo com diferenças entre maiúsculas e minúsculas.
ru: Невозможно использовать шаблон с таким же именем в другом регистре
tr: Aynı şablon farklı büyük/küçük harfler içeremez
zh_hans: 不能有大小写不同的相同模板
zh_hant: 不能有不同大小寫的相同範本

# InvalidLoggingMethodNameMessage
source: Logging method names cannot start with _
cs: Názvy metod protokolování nemůžou začínat podtržítkem (_).
de: Namen für die Protokollierungsmethode dürfen nicht mit "_" beginnen.
es: Los nombres del método de registro no pueden empezar con _
fr: Les noms de méthode de journalisation ne peuvent pas commencer par _
it: I nomi dei metodi di registrazione non possono iniziare con _
ja: ログ メソッド名は「 _ 」で始まることはできません
ko: 로깅 메서드 이름은 _로 시작할 수 없음
pl: Nazwy metody rejestrowania nie mogą rozpoczynać się od znaku „_”
pt_br: Os nomes dos métodos de registro em log não podem começar com _
ru: Имена методов ведения журнала не могут начинаться с символа "_"
tr: Günlüğe kaydetme yöntemi adları _ ile başlayamaz
zh_hans: 日志记录方法名称不能以 _ 开头
zh_hant: 記錄方法名稱的開頭不能為 _

# InvalidLoggingMethodParameterNameMessage
source: Logging method parameter names cannot start with _
cs: Názvy parametrů metody protokolování nemůžou začínat podtržítkem (_).
de: Parameternamen für die Protokollierungsmethode dürfen nicht mit "_" beginnen.
es: Los nombres de parámetro del método de registro no pueden empezar por _
fr: Les noms de paramètres de méthode de journalisation ne peuvent pas commencer par _
it: I nomi dei parametri del metodo di registrazione non possono iniziare con _
ja: Logging method パラメーター名は「 _ 」で始まることはできません
ko: 로깅 메서드 매개 변수 이름은 _로 시작할 수 없음
pl: Nazwy parametrów metody rejestrowania nie mogą rozpoczynać się od znaku „_”
pt_br: Os nomes dos parâmetros do método de registro em log não podem começar com _
ru: Имена параметров метода ведения журнала не могут начинаться с символа "_"
tr: Günlüğe kaydetme yöntemi parametre adları _ ile başlayamaz
zh_hans: 日志记录方法参数名称不能以 _ 开头
zh_hant: 記錄方法參數名稱的開頭不能為 _

# InvalidLoggingMethodParameterOutMessage
source: Argument '{0}' is using the unsupported out parameter modifier
cs: Argument {0} používá nepodporovaný modifikátor výstupních parametrů.
fr: L'argument '{0}' utilise le modificateur de paramètre out non pris en charge
it: L'argomento "{0}" usa il modificatore di parametro out non supportato
ja: 引数 '{0}' はサポートされていない out パラメーター修飾子を使用しています
ko: 인수 '{0}'이(가) 지원되지 않는 out 매개 변수 한정자를 사용하고 있습니다.
pl: Argument „{0}” używa nieobsługiwanego modyfikatora parametrów danych wyjściowych
tr: '{0}' bağımsız değişkeni, desteklenmeyen dış parametre değiştiriciyi kullanıyor
zh_hans: 参数 "{0}" 正在使用不受支持的 out 参数修饰符

# InvalidLoggingMethodParameterOutTitle
source: Argument is using the unsupported out parameter modifier
cs: Argument používá nepodporovaný modifikátor výstupních parametrů
fr: L'argument utilise le modificateur de paramètre out non pris en charge
it: L'argomento utilizza il modificatore di parametro out non supportato
ja: 引数はサポートされていない out パラメーター修飾子を使用しています
ko: 인수가 지원되지 않는 out 매개 변수 한정자를 사용하고 있습니다.
pl: Argument używa nieobsługiwanego modyfikatora parametrów danych wyjściowych
tr: Bağımsız değişken, desteklenmeyen dış parametre değiştiriciyi kullanıyor
zh_hans: 参数正在使用不受支持的 out 参数修饰符

# LoggingMethodHasBodyMessage
source: Logging methods cannot have a body
cs: Metody protokolování nemůžou obsahovat tělo.
de: Protokollierungsmethoden dürfen keinen Text enthalten.
es: Los métodos de registro no pueden tener cuerpo
fr: Les méthodes de journalisation ne peuvent pas avoir de corps
it: I metodi di registrazione non possono avere un corpo
ja: ログ メソッドは本文を含めることができません
ko: 로깅 메서드에는 본문을 사용할 수 없음
pl: Metody rejestrowania nie mogą mieć treści
pt_br: Os métodos de registro em log não podem ter um corpo
ru: У методов ведения журнала не может быть текста
tr: Günlüğe kaydetme yöntemleri gövde içeremez
zh_hans: 日志记录方法不能有正文
zh_hant: 記錄方法不能有主體

# LoggingMethodIsGenericMessage
source: Logging methods cannot be generic
cs: Metody protokolování nemůžou být obecné.
de: Protokollierungsmethoden können nicht generisch sein.
es: Los métodos de registro no pueden ser genéricos
fr: Les méthodes de journalisation ne peuvent pas être génériques
it: I metodi di registrazione non possono essere generici
ja: ログ メソッドを汎用にすることはできません
ko: 로깅 메서드는 제네릭일 수 없음
pl: Metody rejestrowania nie mogą być ogólne
pt_br: Os métodos de registro em log não podem ser genéricos
ru: Методы ведения журнала не могут быть универсальными
tr: Günlüğe kaydetme yöntemleri genel olamaz
zh_hans: 日志记录方法不能为泛型方法
zh_hant: 記錄方法不可為泛型

# LoggingMethodMustBePartialMessage
source: Logging methods must be partial
cs: Metody protokolování musí být částečné.
de: Protokollierungsmethoden müssen partiell sein.
es: Los métodos de registro deben ser parciales
fr: Les méthodes de journalisation doivent être partielles
it: I metodi di registrazione devono essere parziali
ja: ログ記録方法の一部が必要です
ko: 로깅 메서드는 부분이어야 함
pl: Metody rejestrowania muszą być częściowe
pt_br: Os métodos de registro em log devem ser parciais
ru: Методы ведения журнала должны быть частичными
tr: Günlüğe kaydetme yöntemleri kısmi olmalıdır
zh_hans: 日志记录方法必须为分部方法
zh_hant: 記錄方法必須是部分

# LoggingMethodMustReturnVoidMessage
source: Logging methods must return void
cs: Metody protokolování musí vracet void.
de: Protokollierungsmethoden müssen leer zurückgegeben werden.
es: Los métodos de registro deben devolver un valor vacío
fr: Les méthodes de journalisation doivent retourner void
it: I metodi di registrazione devono restituire void
ja: ログ メソッドは無効を返す必要があります
ko: 로깅 메서드는 void를 반환해야 함
pl: Metody rejestrowania muszą zwracać wartość typu void
pt_br: Os métodos de registro em log devem retornar nulos
ru: Методы ведения журнала должны возвращать значение void
tr: Günlüğe kaydetme yöntemleri boş değer döndürmelidir
zh_hans: 日志记录方法必须返回 void
zh_hant: 記錄方法必須傳回 void

# LoggingMethodShouldBeStaticMessage
source: Logging methods must be static
cs: Metody protokolování musí být statické.
de: Protokollierungsmethoden müssen statisch sein.
es: Los métodos de registro deben ser estáticos
fr: Les méthodes de journalisation doivent être statiques
it: I metodi di registrazione devono essere statici
ja: ログ メソッドは静的である必要があります
ko: 로깅 메서드는 정적이어야 함
pl: Metody rejestrowania muszą być statyczne
pt_br: Os métodos de registro em log devem ser estáticos
ru: Методы ведения журнала должны быть статическими
tr: Günlüğe kaydetme yöntemleri statik olmalıdır
zh_hans: 日志记录方法必须为静态方法
zh_hant: 記錄方法必須是靜態

# LoggingUnsupportedLanguageVersionMessageFormat
source: The Logging source generator is not available in C# {0}. Please use language version {1} or greater.
cs: Zdrojový generátor protokolování není k dispozici v jazyce C# {0}. Použijte prosím jazykovou verzi {1} nebo vyšší.
fr: Le générateur de source de connexion n'est pas disponible en C# « {0} ». Veuillez utiliser la version linguistique {1} ou supérieure.
it: Il generatore dell'origine di registrazione non è disponibile in C# {0}. Usare la versione del linguaggio {1} o successiva.
ja: ログ ソース ジェネレーターは、C# {0} では使用できません。言語バージョン {1} 以降を使用してください。
ko: 로깅 원본 생성기는 C# {0}에서 사용할 수 없습니다. {1} 이상의 언어 버전을 사용하세요.
pl: Generator źródła rejestrowania nie jest dostępny w języku C# {0}. Użyj wersji językowej {1} lub nowszej.
tr: Günlüğe kaydetme kaynak oluşturucusu C# {0} sürümünde kullanılamıyor. Lütfen dil sürümü {1} veya üstü bir sürümü kullanın.
zh_hans: 记录源生成器在 C#“{0}”中不可用。请使用{1}或更高版本的语言版本。

# LoggingUnsupportedLanguageVersionTitle
source: C# language version not supported by the source generator.
cs: Zdrojový generátor nepodporuje jazykovou verzi jazyka C#.
fr: Version du langage C# non prise en charge par le générateur de source.
it: Versione del linguaggio C# non supportata dal generatore di origine.
ja: ソース ジェネレーターでサポートされていない C# 言語バージョン。
ko: 원본 생성기에서 지원되지 않는 C# 언어 버전입니다.
pl: Wersja języka C# nie jest obsługiwana przez generator źródła.
tr: C# dil sürümü kaynak oluşturucu tarafından desteklenmiyor.
zh_hans: 源生成器不支持 C# 语言版本。

# MalformedFormatStringsMessage
source: Logging method '{0}' contains malformed format strings
cs: Metoda protokolování {0} obsahuje řetězce s poškozeným formátem.
fr: La méthode de journalisation « {0} »contient des chaînes de format incorrectes
it: Il metodo di registrazione '{0}' contiene stringhe in formato non valido
ja: ログ メソッド '{0}' に、形式の正しくない文字列が含まれています
ko: 로깅 메서드 '{0}'에 잘못된 형식의 문자열이 포함되어 있습니다.
pl: Metoda rejestrowania „{0}” zawiera źle sformułowane ciągi formatu
tr: '{0}' günlüğe kaydetme yöntemi hatalı biçimlendirilmiş biçim dizeleri içeriyor
zh_hans: 日志记录方法“{0}”包含格式错误的字符串

# MalformedFormatStringsTitle
source: Logging method contains malformed format strings
cs: Metoda protokolování obsahuje řetězce s poškozeným formátem
fr: La méthode de journalisation contient des chaînes de format incorrectes
it: Il metodo di registrazione contiene stringhe in formato non valido
ja: ログ メソッドに形式の正しくない文字列が含まれています
ko: 로깅 메서드에 잘못된 형식의 문자열이 포함되어 있습니다.
pl: Metoda rejestrowania zawiera źle sformułowane ciągi formatu
tr: Günlüğe kaydetme yöntemi hatalı biçimlendirilmiş biçim dizeleri içeriyor
zh_hans: 日志记录方法包含格式错误的字符串

# MissingLogLevelMessage
source: A LogLevel value must be supplied in the LoggerMessage attribute or as a parameter to the logging method
cs: Hodnota LogLevel musí být zadaná v atributu LoggerMessage, nebo jako parametr metody protokolování.
de: Ein LogLevel-Wert muss im LoggerMessage-Attribut oder als Parameter für die Protokollierungsmethode angegeben werden.
es: Debe proporcionarse un valor LogLevel en el atributo LoggerMessage o como parámetro en el método de registro
fr: Une valeur LogLevel doit être fournie dans l’attribut LoggerMessage ou en tant que paramètre de la méthode de journalisation
it: È necessario specificare un valore LogLevel nell'attributo LoggerMessage o come parametro per il metodo di registrazione
ja: LogLevel 値は、LoggingMessage 属性または logging メソッドのパラメーターとして指定する必要があります
ko: LogLevel 값은 LoggerMessage 특성에 지정하거나 로깅 메서드에 대한 매개 변수로 제공해야 함
pl: Wartość LogLevel musi być podana w atrybucie LoggerMessage lub jako parametr metody rejestrowania
pt_br: Um valor LogLevel deve ser fornecido no atributo LoggerMessage ou como um parâmetro para o método de registro em log
ru: Значение LogLevel должно быть указано в атрибуте LoggerMessage или в качестве параметра метода ведения журнала
tr: LoggerMessage özniteliğinde veya günlüğe kaydetme yönteminin parametresi olarak bir LogLevel değerinin belirtilmesi gerekiyor
zh_hans: 必须在 LoggerMessage 属性中提供 LogLevel 值或将其用作日志记录方法的参数
zh_hant: 必須在 LoggerMessage 屬性中提供 LogLevel 值，或將其做為記錄方法的參數。

# MissingLoggerArgumentMessage
source: One of the arguments to the static logging method '{0}' must implement the Microsoft.Extensions.Logging.ILogger interface
cs: Jeden z argumentů metody statického protokolování {0} musí implementovat rozhraní Microsoft.Extensions.Logging.ILogger.
de: Eines der Argumente für die statische Protokollierungsmethode „{0}“ muss die Microsoft.Extensions.Logging.ILogger-Schnittstelle implementieren.
es: Uno de los argumentos para el método de registro estático "{0}" debe implementar la interfaz Microsoft.Extensions.Logging.ILogger
fr: L’un des arguments d’une méthode de journalisation statique « {0} » doit implémenter l’interface Microsoft.Extensions.Logging.ILogger
it: Uno degli argomenti del metodo di registrazione statico '{0}' deve implementare l'interfaccia Microsoft.Extensions.Logging.ILogger
ja: 静的ログ メソッド '{0}' への引数の 1 つには、Microsoft.Extensions.Logging.ILogger インターフェイスを実装する必要があります。
ko: 정적 로깅 메서드 ‘{0}’의 인수 중 하나가 Microsoft.Extensions.Logging.ILogger 인터페이스를 구현해야 함
pl: Jeden z argumentów statycznej metody rejestrowania „{0}” musi implementować interfejs Microsoft.Extensions.Logging.ILogger
pt_br: Um dos argumentos para um método de log estático '{0}' deve implementar a interface Microsoft.Extensions.Logging.ILogger
ru: Один из аргументов статического метода ведения журнала "{0}" должен реализовывать интерфейс Microsoft.Extensions.Logging.ILogger
tr: '{0}' statik günlük metoduna yönelik bağımsız değişkenlerden biri Microsoft.Extensions.Logging.ILogger arabirimini uygulamalıdır
zh_hans: 静态日志记录方法“{0}”的参数之一必须实施 Microsoft.Extensions.Logging.ILogger 接口
zh_hant: 靜態記錄方法 '{0}' 的其中一個引數必須實作 Microsoft.Extensions.Logging.ILogger 介面

# MissingLoggerArgumentTitle
source: One of the arguments to a static logging method must implement the Microsoft.Extensions.Logging.ILogger interface
cs: Jeden z argumentů metody statického protokolování musí implementovat rozhraní Microsoft.Extensions.Logging.ILogger.
de: Eines der Argumente für eine statische Protokollierungsmethode muss die Microsoft.Extensions.Logging.ILogger-Schnittstelle implementieren.
es: Uno de los argumentos para un método de registro estático debe implementar la interfaz Microsoft.Extensions.Logging.ILogger
fr: L’un des arguments d’une méthode de journalisation statique doit implémenter l’interface Microsoft.Extensions.Logging.ILogger
it: Uno degli argomenti del metodo di registrazione statico deve implementare l'interfaccia Microsoft.Extensions.Logging.ILogger
ja: 静的ログ メソッドへの引数の 1 つには、Microsoft.Extensions.Logging.ILogger インターフェイスを実装する必要があります。
ko: 정적 로깅 메서드 인수 중 하나가 Microsoft.Extensions.Logging.ILogger 인터페이스를 구현해야 함
pl: Jeden z argumentów statycznej metody rejestrowania musi implementować interfejs Microsoft.Extensions.Logging.ILogger
pt_br: Um dos argumentos para um método de log estático deve implementar a interface Microsoft.Extensions.Logging.ILogger
ru: Один из аргументов статического метода ведения журнала должен реализовывать интерфейс Microsoft.Extensions.Logging.ILogger
tr: Statik günlük metoduna yönelik bağımsız değişkenlerden biri Microsoft.Extensions.Logging.ILogger arabirimini uygulamalıdır
zh_hans: 静态日志记录方法的参数之一必须实现 Microsoft.Extensions.Logging.ILogger 接口
zh_hant: 靜態記錄方法的其中一個引數必須實作 Microsoft.Extensions.Logging.ILogger 介面

# MissingLoggerFieldMessage
source: Couldn't find a field of type Microsoft.Extensions.Logging.ILogger in class {0}
cs: Ve třídě {0} se nepovedlo najít pole typu Microsoft.Extensions.Logging.ILogger.
de: In der Klasse "{0}" wurde kein Feld vom Typ "Microsoft.Extensions.Logging.ILogger" gefunden.
es: No se encontró ningún campo de tipo Microsoft.Extensions.Logging.ILogger en la clase {0}
fr: Impossible de trouver un champ de type Microsoft.Extensions.Logging.ILogger dans la classe {0}
it: Non è stato possibile trovare un campo di tipo Microsoft.Extensions.Logging.ILogger nella classe {0}
ja: クラスで Microsoft.Extensions.Logging.ILogger 型のフィールドが見つかりませんでした {0}
ko: {0} 클래스에서 Microsoft.Extensions.Logging.ILogger 형식의 필드를 찾을 수 없음
pl: Nie można znaleźć pola typu Microsoft.Extensions.Logging.ILogger w klasie {0}
pt_br: Não foi possível encontrar um campo do tipo Microsoft.Extensions.Logging.ILogger na classe {0}
ru: В классе {0} не найдены поля типа Microsoft.Extensions.Logging.ILogger
tr: {0} sınıfında Microsoft.Extensions.Logging.ILogger türündeki alan bulunamadı
zh_hans: 在类 {0} 中找不到 Microsoft.Extensions.Logging.ILogger 类型的字段
zh_hant: 找不到類別 {0} 中 Microsoft.Extensions.Logging.ILogger 類型的欄位

# MissingLoggerFieldTitle
source: Couldn't find a field of type Microsoft.Extensions.Logging.ILogger
cs: Nepovedlo se najít pole typu Microsoft.Extensions.Logging.ILogger
de: Feld vom Typ "Microsoft.Extensions.Logging.ILogger" nicht gefunden
es: No se encontró ningún campo de tipo Microsoft.Extensions.Logging.ILogger
fr: Impossible de trouver un champ de type Microsoft.Extensions.Logging.ILogger
it: Non è stato possibile trovare un campo di tipo Microsoft.Extensions.Logging.ILogger
ja: Microsoft.Extensions.Logging.ILogger 型のフィールドが見つかりませんでした
ko: Microsoft.Extensions.Logging.ILogger 형식의 필드를 찾을 수 없음
pl: Nie można znaleźć pola typu Microsoft.Extensions.Logging.ILogger
pt_br: Não foi possível encontrar um campo do tipo Microsoft.Extensions.Logging.ILogger
ru: Не удалось найти поле типа Microsoft.Extensions.Logging.ILogger
tr: Microsoft.Extensions.Logging.ILogger türündeki alan bulunamadı
zh_hans: 找不到 Microsoft.Extensions.Logging.ILogger 类型的字段。
zh_hant: 找不到 Microsoft.Extensions.Logging.ILogger 類型的欄位

# MissingRequiredTypeMessage
source: Could not find definition for type {0}
cs: Nepovedlo se najít definici pro typ {0}.
de: Die Definition für den Typ "{0}" wurde nicht gefunden.
es: No se pudo encontrar la definición para el tipo {0}
fr: La définition du type {0} n’a pas été trouvée
it: Non è stato possibile trovare una definizione per il tipo {0}
ja: {0} 型の定義が見つかりません
ko: 형식 {0}에 대한 정의를 찾을 수 없음
pl: Nie można znaleźć definicji dla typu {0}
pt_br: Não foi possível encontrar a definição para o tipo {0}
ru: Не найдено определение для типа {0}
tr: {0} türü için tanım bulunamadı
zh_hans: 找不到类型 {0} 的定义
zh_hant: 找不到類型 {0} 的定義

# MissingRequiredTypeTitle
source: Could not find a required type definition
cs: Nepovedlo se najít požadovanou definici typu
de: Erforderliche Typdefinition nicht gefunden
es: No se encontró ninguna definición de tipo necesaria
fr: Impossible de trouver la définition d’un type requis
it: Non è stato possibile trovare una definizione del tipo richiesto
ja: 必要な型の定義が見つかりませんでした
ko: 필요한 형식 정의를 찾을 수 없음
pl: Nie można znaleźć wymaganej definicji typu
pt_br: Não foi possível encontrar uma definição de tipo necessária
ru: Не найдено требуемое определение типа
tr: Gerekli bir tür tanımı bulunamadı
zh_hans: 找不到所需的类型定义
zh_hant: 找不到所需的類型定義

# MultipleLoggerFieldsMessage
source: Found multiple fields of type Microsoft.Extensions.Logging.ILogger in class {0}
cs: Ve třídě {0} se našlo několik polí typu Microsoft.Extensions.Logging.ILogger.
de: In der Klasse "{0}" wurden mehrere Felder vom Typ "Microsoft.Extensions.Logging.ILogger" gefunden.
es: Se encontraron varios campos del tipo Microsoft.Extensions.Logging.ILogger en la clase {0}
fr: Plusieurs champs de type Microsoft.Extensions.Logging.ILogger ont été trouvés dans la classe {0}
it: Sono stati trovati più campi di tipo Microsoft.Extensions.Logging.ILogger nella classe {0}
ja: クラスに Microsoft.Extensions.Logging.ILogger という種類の複数のフィールドがあります {0}
ko: {0} 클래스에 Microsoft.Extensions.Logging.ILogger 형식의 필드가 여러 개 있음
pl: Znaleziono wiele pól typu Microsoft.Extensions.Logging.ILogger w klasie {0}
pt_br: Múltiplos campos do tipo Microsoft.Extensions.Logging.ILogger encontrados na classe {0}
ru: В классе {0} обнаружено несколько полей типа Microsoft.Extensions.Logging.ILogger
tr: {0} sınıfında Microsoft.Extensions.Logging.ILogger türünde birden çok alan bulundu
zh_hans: 在类 {0} 中找到多个 Microsoft.Extensions.Logging.ILogger 类型的字段
zh_hant: 在類別 {0} 中找到多個 Microsoft.Extensions.Logging.ILogger 類型的欄位

# MultipleLoggerFieldsTitle
source: Found multiple fields of type Microsoft.Extensions.Logging.ILogger
cs: Našlo se několik polí typu Microsoft.Extensions.Logging.ILogger
de: Mehrere Felder vom Typ "Microsoft.Extensions.Logging.ILogger" gefunden
es: Se encontraron varios campos de tipo Microsoft.Extensions.Logging.ILogger
fr: Plusieurs champs de type Microsoft.Extensions.Logging.ILogger ont été trouvés
it: Sono stati trovati più campi di tipo Microsoft.Extensions.Logging.ILogger
ja: Microsoft.Extensions.Logging.ILogger という種類の複数のフィールドが見つかりました
ko: Microsoft.Extensions.Logging.ILogger 형식의 필드가 여러 개 있음
pl: Znaleziono wiele pól typu Microsoft.Extensions.Logging.ILogger
pt_br: Múltiplos campos encontrados do tipo Microsoft.Extensions.Logging.ILogger
ru: Обнаружено несколько полей типа Microsoft.Extensions.Logging.ILogger
tr: Microsoft.Extensions.Logging.ILogger türünde birden çok alan bulundu
zh_hans: 找到 Microsoft.Extensions.Logging.ILogger 类型的多个字段
zh_hant: 找到多個 Microsoft.Extensions.Logging.ILogger 類型的欄位
