Repository: dotnet/runtime
Catalog: src/libraries/Microsoft.Extensions.Configuration.Binder/gen/Resources/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# CollectionNotSupported
source: The collection type is not supported: '{0}'.
cs: Typ kolekce se nepodporuje: „{0}“.
de: Der Sammlungstyp wird nicht unterstützt: "{0}".
es: No se admite el tipo de colección: "{0}".
fr: Le type de collection n‘est pas pris en charge : ‘{0}‘.
it: Il tipo di raccolta non è supportato: '{0}'.
ja: コレクション型はサポートされていません: '{0}'。
ko: 컬렉션 유형이 지원되지 않습니다: '{0}'.
pl: Typ kolekcji nie jest obsługiwany: „{0}”.
pt_br: O tipo de coleção não é compatível: '{0}'.
ru: Тип коллекции не поддерживается: "{0}".
tr: Koleksiyon türü desteklenmiyor: '{0}'.
zh_hans: 不支持此集合类型 '{0}'。
zh_hant: 不支援集合類型: '{0}'。

# CouldNotDetermineTypeInfoMessageFormat
source: Binding logic was not generated for a binder call. Unsupported input patterns include generic calls, passing boxed objects, and passing types that are not 'public' or 'internal'.
cs: Pro volání vazby se nevygenerovala logika vazby. Mezi nepodporované vstupní vzory patří obecná volání, předávání zabalených objektů a předávání typů, které nejsou public ani internal.
de: Für einen Binderaufruf wurde keine Bindungslogik generiert. Nicht unterstützte Eingabemuster umfassen generische Aufrufe, vorübergehende geschachtelte Objekte und das Übergeben von Typen, die nicht "public" oder "internal" sind.
es: No se ha generado la lógica de enlace para una llamada de enlace. Entre los patrones de entrada no admitidos se incluyen las llamadas genéricas, el paso de objetos en caja y el paso de tipos que no son "públicos" o "internos".
fr: La logique de liaison n’a pas été générée pour un appel de classeur. Les modèles d’entrée non pris en charge incluent les appels génériques, le passage d’objets box et les types de passage qui ne sont pas 'public' ou 'internal'.
it: La logica di associazione non è stata generata per una chiamata del gestore di associazione. I modelli di input non supportati includono chiamate generici, il passaggio di oggetti boxed e il passaggio di tipi non 'public' o 'internal'.
ja: バインダー呼び出しのバインド ロジックが生成されませんでした。サポートされていない入力パターンには、ジェネリック呼び出し、ボックス化されたオブジェクトの受け渡し、および 'public' または 'internal' ではない型の受け渡しが含まれます。
ko: 바인더 호출에 대한 바인딩 논리가 생성되지 않았습니다. 지원되지 않는 입력 패턴에는 제네릭 호출, boxed 개체 전달 및 'public' 또는 'internal'이 아닌 전달 형식이 포함됩니다.
pl: Logika powiązania nie została wygenerowana dla wywołania integratora. Nieobsługiwane wzorce wejściowe obejmują ogólne wywołania, przekazywanie obiektów w pudełkach i przekazywanie typów, które nie są „publiczne” lub „wewnętrzne”.
pt_br: A lógica de associação não foi gerada para uma chamada de fichário. Padrões de entrada sem suporte incluem chamadas genéricas, passagem de objetos em caixa e passagem de tipos que não são 'públicos' ou 'internos'.
ru: Логика привязки не создана для вызова привязки. Неподдерживаемые шаблоны ввода включают общие вызовы, передачу упакованных объектов и передачу типов, не являющихся "общедоступными" или "внутренними".
tr: Bağlama mantığı bir bağlayıcı çağrısı için oluşturulmadı. Desteklenmeyen giriş düzenleri şunları içerir: genel çağrılar, geçirilen kutulu nesneler ve ‘genel’ veya ‘iç’ olmayan geçirme türleri.
zh_hans: 没有为绑定器调用生成绑定逻辑。不支持的输入模式包括泛型调用、传递装箱对象和传递不是“public”或“internal”的类型。
zh_hant: 未產生文件夾呼叫的繫結邏輯。不支援的輸入模式包括一般呼叫、傳遞方塊物件，以及非 'public' 或 'internal' 的傳遞類型。。

# CouldNotDetermineTypeInfoTitle
source: The target type for a binder call could not be determined
cs: Cílový typ volání vazače nelze určit
de: Der Zieltyp für einen Binderaufruf konnte nicht bestimmt werden.
es: No se pudo determinar el tipo de destino para una llamada de enlazador
fr: Impossible de déterminer le type cible d’un appel de classeur
it: Impossibile determinare il tipo di destinazione per una chiamata binder
ja: バインダー呼び出しの対象の型を特定できませんでした
ko: 바인더 호출의 대상 유형을 확인할 수 없습니다.
pl: Nie można określić typu docelowego dla wywołania integratora
pt_br: Não foi possível determinar o tipo de destino de uma chamada de associador
ru: Не удалось определить целевой тип для вызова модуля привязки
tr: Bir bağlayıcı çağrısının hedef türü belirlenemedi
zh_hans: 联编程序调用的目标类型无法确定
zh_hant: 無法判斷文件夾呼叫的目標型別

# DictionaryKeyNotSupported
source: The dictionary key type is not supported: '{0}'.
cs: Typ klíče slovníku se nepodporuje:„{0}“.
de: Der Wörterbuchschlüsseltyp wird nicht unterstützt: "{0}".
es: No se admite el tipo de clave de diccionario: "{0}".
fr: Le type de clé du dictionnaire n’est pas pris en charge : ‘{0}‘.
it: Il tipo di chiave del dizionario non è supportato: '{0}'.
ja: 辞書キー型はサポートされていません: '{0}'。
ko: 사전 키 유형이 지원되지 않습니다: '{0}'.
pl: Typ klucza słownika nie jest obsługiwany: „{0}”.
pt_br: O tipo de chave do dicionário não é suportado: '{0}'.
ru: Тип ключа словаря не поддерживается: "{0}".
tr: Sözlük anahtarı türü desteklenmiyor: '{0}'.
zh_hans: 不支持此字典密钥类型: '{0}'。
zh_hant: 不支援字典索引鍵類型: '{0}'。

# ElementTypeNotSupported
source: The collection element type is not supported: '{0}'.
cs: Typ elementu kolekce se nepodporuje: {0}“.
de: Der Auflistungselementtyp wird nicht unterstützt: "{0}".
es: No se admite el tipo de elemento de colección: "{0}".
fr: Le type d‘élément collection n‘est pas pris en charge : ‘{0}‘.
it: Il tipo di elemento della raccolta non è supportato: '{0}'.
ja: コレクション要素型はサポートされていません: '{0}'。
ko: 컬렉션 요소 유형이 지원되지 않습니다: '{0}'.
pl: Typ elementu kolekcji nie jest obsługiwany: „{0}”.
pt_br: O tipo de elemento da coleção não é suportado: '{0}'.
ru: Тип элемента коллекции не поддерживается: "{0}".
tr: Koleksiyon öğesi türü desteklenmiyor: '{0}'.
zh_hans: 不支持此集合元素类型: '{0}'。
zh_hant: 不支援集合元素類型: '{0}'。

# Language VersionIsNotSupportedMessageFormat
source: The project's language version has to be at least 'C# 12'.
de: Die Sprachversion des Projekts muss mindestens "C# 12" sein.
es: La versión del lenguaje del proyecto debe ser al menos "C# 12".
fr: La version de langage du projet doit être au moins 'C# 12'.
it: La versione del linguaggio del progetto deve essere almeno 'C# 12'.
pl: Wersja językowa projektu musi mieć wartość co najmniej „C# 12”.
pt_br: A versão da linguagem do projeto deve ser no mínimo 'C# 12'.

# LanguageVersionIsNotSupportedTitle
source: Language version is required to be at least C# 12
cs: Verze jazyka musí být alespoň C# 12
de: Die Sprachversion muss mindestens C# 12 sein.
es: La versión del lenguaje debe ser al menos C# 12
fr: La version du langage doit être au moins C# 12.
it: La versione del linguaggio deve essere almeno C# 12
ja: 言語バージョンは少なくとも C# 12 である必要があります
ko: 언어 버전은 C# 12 이상이어야 합니다.
pl: Wymagana jest wersja językowa o wartości co najmniej C# 12
pt_br: A versão do idioma deve ser pelo menos C# 12
ru: Версия языка должна быть не ниже C# 12
tr: Dil sürümünün en az C# 12 olması gerekir
zh_hans: 语言版本必须至少为 C# 12
zh_hant: 語言版本要求至少為 C#12

# MissingPublicInstanceConstructor
source: Cannot create instance of type '{0}' because it is missing a public instance constructor.
cs: Nelze vytvořit instanci typu „{0}“, protože chybí konstruktor veřejné instance.
de: Die Instanz vom Typ "{0}" kann nicht erstellt werden, weil ein öffentlicher Instanzkonstruktor fehlt.
es: No se puede crear una instancia de tipo '{0}' porque falta un constructor de instancia pública.
fr: Nous n’avons pas pu créer une instance du type '{0}', car il lui manque un constructeur d’instance public.
it: Non è possibile creare un'istanza di tipo '{0}' perché manca un costruttore di istanza pubblica.
ja: パブリック インスタンス コンストラクターがないため、型 '{0}' のインスタンスを作成できません。
ko: 공용 인스턴스 생성자가 없으므로 '{0}' 형식의 인스턴스를 만들 수 없습니다.
pl: Nie można utworzyć wystąpienia typu „{0}”, ponieważ brakuje w nim konstruktora wystąpienia publicznego.
pt_br: Não é possível criar instância do tipo ''{0}'' porque falta um construtor de instância pública.
ru: Не удается создать экземпляр типа "{0}", так как в нем отсутствует конструктор общедоступных экземпляров.
tr: Ortak örnek oluşturucu içermediğinden '{0}' türündeki örnek oluşturulamıyor.
zh_hans: 无法创建类型“{0}”的实例，因为它缺少公共实例构造函数。
zh_hant: 無法建立類型為 '{0}' 的執行個體，因為它缺少公用執行個體建構函式。

# MultiDimArraysNotSupported
source: Multidimensional arrays are not supported: '{0}'.
cs: Multidimenzionální pole se nepodporují: {0}“.
de: Mehrdimensionale Arrays werden nicht unterstützt: "{0}".
es: No se admiten las matrices multidimensionales: "{0}".
fr: Les tableaux multidimensionnels ne sont pas pris en charge : ‘{0}‘.
it: Matrici multidimensionali non supportate: '{0}'.
ja: 多次元配列はサポートされていません: '{0}'.
ko: 다차원 배열은 지원되지 않습니다: '{0}'.
pl: Tablice wielowymiarowe nie są obsługiwane: „{0}”.
pt_br: Matrizes multidimensionais não são suportadas: '{0}'.
ru: Многомерные массивы не поддерживаются: "{0}".
tr: Çok boyutlu diziler desteklenmiyor: '{0}'.
zh_hans: 不支持多维数组: '{0}'。
zh_hant: 不支援多維陣列: '{0}'。

# MultipleParameterizedConstructors
source: Cannot create instance of type '{0}' because it has multiple public parameterized constructors.
cs: Nelze vytvořit instanci typu „{0}“, protože má více veřejných parametrizovaných konstruktorů.
de: Die Instanz vom Typ "{0}" kann nicht erstellt werden, weil sie über mehrere öffentliche parametrisierte Konstruktoren verfügt.
es: No se puede crear una instancia de tipo '{0}' porque tiene varios constructores con parámetros públicos.
fr: Nous n’avons pas pu créer une instance du type '{0}', car il possède plusieurs constructeurs publics paramétrés.
it: Non è possibile creare un'istanza di tipo '{0}' perché contiene più costruttori con parametri pubblici.
ja: 複数のパブリック パラメーター化コンストラクターがあるため、型 '{0}' のインスタンスを作成できません。
ko: 매개 변수가 있는 공용 생성자가 여러 개 있으므로 '{0}' 형식의 인스턴스를 만들 수 없습니다.
pl: Nie można utworzyć wystąpienia typu „{0}”, ponieważ ma ono wiele publicznych konstruktorów sparametryzowanych.
pt_br: Não é possível criar instância do tipo ''{0}'' porque ela tem vários construtores parametrizados públicos.
ru: Не удается создать экземпляр типа "{0}", так как он содержит несколько общедоступных параметров конструкторов.
tr: Birden çok ortak parametreli oluşturucu içerdiğinden '{0}' türündeki örnek oluşturulamıyor.
zh_hans: 无法创建类型“{0}”的实例，因为它具有多个公共参数化构造函数。
zh_hant: 無法建立類型為 '{0}' 的執行個體，因為它有多個公用參數化建構函式。

# NullableUnderlyingTypeNotSupported
source: Nullable underlying type is not supported: '{0}'.
cs: Podkladový vynulovatelný typ se nepodporuje: „{0}“.
de: Der zugrunde liegende Typ, der NULL-Werte zulässt, wird nicht unterstützt: "{0}".
es: No se admite el tipo subyacente con valor nulo: "{0}".
fr: Le type sous-jacent pouvant accepter la valeur Null n’est pas pris en charge : ‘{0}‘.
it: Il tipo sottostante che ammette i valori Null non è supportato: '{0}'.
ja: Null 許容の、基本になる型はサポートされていません: '{0}'。
ko: Null 허용 기본 유형이 지원되지 않습니다: '{0}'.
pl: Typ podstawowy dopuszczający wartość null nie jest obsługiwany: „{0}”.
pt_br: O tipo subjacente anulável não é suportado: '{0}'.
ru: Базовый тип, допускающий значение NULL, не поддерживается: "{0}".
tr: Null atanabilir temel tür desteklenmiyor: '{0}'.
zh_hans: 不支持可为 Null 的基础类型: '{0}'。
zh_hant: 不支援可為 Null 的基礎類型: '{0}'。

# PropertyNotSupportedMessageFormat
source: Property '{0}' on type '{1}' is not supported.
cs: Vlastnost „{0}“ u typu „{1}“ se nepodporuje.
de: Die Eigenschaft „{0}“ für den Typ „{1}“ wird nicht unterstützt.
es: La propiedad '{0}' en el tipo '{1}' no se admite.
fr: La propriété '{0}' sur le type '{1}' n’est pas prise en charge.
it: La proprietà '{0}' nel tipo '{1}' non è supportata.
ja: 型 '{1}' のプロパティ '{0}' はサポートされていません。
ko: '{1}' 형식의 속성 '{0}'은(는) 지원되지 않습니다.
pl: Właściwość „{0}” w typie „{1}” nie jest obsługiwana.
pt_br: Não há suporte para a propriedade '{0}' no tipo '{1}'.
ru: Свойство "{0}" типа "{1}" не поддерживается.
tr: '{1}' türündeki '{0}' özelliği desteklenmiyor.
zh_hans: 类型“{1}”中的属性“{0}”不受支持。
zh_hant: 不支援類型 '{1}' 的屬性 '{0}'。

# PropertyNotSupportedTitle
source: Did not generate binding logic for a property on a type
cs: Negenerovala se logika vazby pro vlastnost typu
de: Für eine Eigenschaft eines Typs wurde keine Bindungslogik generiert
es: No se ha generado la lógica de enlace para una propiedad en un tipo.
fr: La logique de liaison n’a pas été généré pour une propriété sur un type
it: Non è stata generata la logica di binding per una proprietà in un tipo
ja: 型のプロパティのバインディング ロジックを生成しませんでした
ko: 형식의 속성에 대한 바인딩 논리를 생성하지 않았습니다.
pl: Nie wygenerowano logiki powiązania dla właściwości w typie
pt_br: Não gerou lógica de ligação para uma propriedade em um tipo
ru: Не создана логика привязки для свойства типа
tr: Türdeki bir özellik için bağlama mantığı oluşturulmadı
zh_hans: 没有为类型中的属性生成绑定逻辑
zh_hant: 未在類型上產生屬性的繫結邏輯

# TypeNotSupported
source: The type is not supported: '{0}'.
cs: Typ není podporován: „{0}“.
de: Der Typ wird nicht unterstützt: "{0}".
es: No se admite el tipo: "{0}".
fr: Le type n‘est pas pris en charge : ‘{0}‘.
it: Il tipo non è supportato: '{0}'.
ja: この型はサポートされていません: '{0}'。
ko: 지원되지 않는 유형: '{0}'.
pl: Typ nie jest obsługiwany: „{0}”.
pt_br: O tipo não é suportado: '{0}'.
ru: Тип не поддерживается: "{0}".
tr: Tür desteklenmiyor: '{0}'.
zh_hans: 不支持此类型: '{0}'。
zh_hant: 不支援類型: '{0}'。

# TypeNotSupportedTitle
source: Did not generate binding logic for a type
cs: Negenerovala se logika vazby pro typ
de: Für einen Typ wurde keine Bindungslogik generiert
es: No se ha generado la lógica de enlace para un tipo.
fr: La logique de liaison n’a pas été générée pour un type
it: Non è stata generata la logica di binding per un tipo.
ja: 型のバインディング ロジックを生成しませんでした
ko: 형식에 대한 바인딩 논리를 생성하지 않았습니다.
pl: Nie wygenerowano logiki powiązania dla typu
pt_br: Não gerou lógica de ligação para um tipo
ru: Не создана логика привязки для типа
tr: Bir tür için bağlama mantığı oluşturulmadı
zh_hans: 没有为类型生成绑定逻辑
zh_hant: 未產生類型的繫結邏輯

# ValueTypesInvalidForBindMessageFormat
source: Binding logic was not generated for a binder call with target type '{0}'. Value types are invalid inputs to configuration 'Bind' methods.
cs: Logika vazby nebyla vygenerována pro volání pořadače s cílovým typem „{0}“. Typy hodnot jsou neplatné vstupy pro konfigurační metody Bind.
de: Für einen Binderaufruf mit dem Zieltyp "{0}" wurde keine Bindungslogik generiert. Werttypen sind ungültige Eingaben für die Konfiguration von Bind-Methoden.
es: No se generó la lógica de enlace para una llamada de enlazador con el tipo de destino “{0}”. Los tipos de valor son entradas no válidas para los métodos de configuración “'bind”.
fr: La logique de liaison n’a pas été générée pour un appel de classeur avec le type cible '{0}'. Les types valeur ne sont pas des entrées valides pour les méthodes de configuration 'Bind'.
it: La logica di binding non è stata generata per una chiamata binder con tipo di destinazione '{0}'. I tipi di valore sono input non validi per i metodi di configurazione 'Bind'.
ja: 対象の型が '{0}' のバインダー呼び出しについてバインド ロジックが生成されませんでした。値の型が、構成の 'Bind' メソッドへの入力として正しくありません。
ko: 대상 유형이 '{0}'인 바인더 호출에 대해 바인딩 논리가 생성되지 않았습니다. 값 유형은 구성 '바인딩' 방법에 대한 유효하지 않은 입력입니다.
pl: Nie wygenerowano logiki powiązania dla wywołania integratora z typem docelowym „{0}”. Typy wartości to nieprawidłowe dane wejściowe do konfiguracji metod „Powiązanie”.
pt_br: A lógica de associação não foi gerada para uma chamada de associador com o tipo de destino "{0}". Tipos de valor são entradas inválidas para métodos de configuração 'Bind'.
ru: Логика привязки не была создана для вызова модуля привязки с типом "{0}". Типы значений являются недопустимыми входными данными для методов "Bind" конфигурации.
tr: '{0}' hedef türüne sahip bir bağlayıcı çağrısı için bağlama mantığı oluşturulmadı. Değer türleri yapılandırma ‘Bağlama’ yöntemleri için geçersiz girişlerdir.
zh_hans: 没有为目标类型为“{0}”的绑定器调用生成绑定逻辑。值类型是配置“Bind”方法的无效输入。
zh_hant: 未針對目標型別為 '{0}' 的文件夾呼叫產生繫結邏輯。實值型別對設定 'Bind' 方法的輸入無效。

# ValueTypesInvalidForBindTitle
source: Value types are invalid inputs to configuration 'Bind' methods
cs: Typy hodnot nejsou platné vstupy pro konfigurační metody „Bind“.
de: Werttypen sind ungültige Eingaben für die Konfiguration von Bind-Methoden.
es: Los tipos de valor son entradas no válidas para los métodos de configuración “bind”
fr: Les types valeur ne sont pas des entrées valides pour les méthodes de configuration 'Bind'
it: I tipi di valore sono input non validi per i metodi di configurazione 'Bind'
ja: 値の型が、構成の 'Bind' メソッドへの入力として正しくありません
ko: 값 형식은 구성 'Bind' 메서드에 대한 잘못된 입력입니다.
pl: Typy wartości to nieprawidłowe dane wejściowe do konfiguracji metod „Powiązanie”
pt_br: Tipos de valor são entradas inválidas para métodos de configuração "Associar"
ru: Типы значений являются недопустимыми входными данными для методов "Bind" конфигурации
tr: Değer türleri yapılandırma ‘Bağlama’ yöntemleri için geçersiz girişlerdir
zh_hans: 值类型是配置“Bind”方法的无效输入
zh_hant: 實值型別對設定 'Bind' 方法的輸入無效
