Repository: dotnet/runtime
Catalog: src/libraries/System.Text.Json/gen/Resources/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# JsonConstructorInaccessibleTitle
source: Constructor annotated with JsonConstructorAttribute is inaccessible.
cs: Konstruktor anotovaný atributem JsonConstructorAttribute je nepřístupný.
de: Auf den Konstruktor mit dem Kommentar "JsonConstructorAttribute" kann nicht zugegriffen werden.
es: No se puede acceder al constructor anotado con JsonConstructorAttribute.
fr: Le constructeur annoté avec JsonConstructorAttribute est inaccessible.
it: Il costruttore annotato con JsonConstructorAttribute non è accessibile.
ja: JsonConstructorAttribute で注釈が付けられたコンストラクターにアクセスできません。
ko: JsonConstructorAttribute로 주석이 추가된 생성자에 액세스할 수 없습니다.
pl: Konstruktor, w przypadku którego dokonano adnotacji za pomocą atrybutu JsonConstructorAttribute, jest niedostępny.
pt_br: O construtor anotado com JsonConstructorAttribute está inacessível.
ru: Конструктор, аннотированный с использованием JsonConstructorAttribute, недоступен.
tr: JsonConstructorAttribute ile açıklama eklenmiş oluşturucuya erişilemiyor.
zh_hans: 无法访问使用 JsonConstructorAttribute 批注的构造函数。
zh_hant: 無法存取使用 JsonConstructorAttribute 標註的建構函式。

# JsonConverterAttributeInvalidTypeMessageFormat
source: The 'JsonConverterAttribute' type '{0}' specified on member '{1}' is not a converter type or does not contain an accessible parameterless constructor.
cs: Typ JsonConverterAttribute {0} specifikovaný u členu {1} není typem konvertoru nebo neobsahuje přístupný konstruktor bez parametrů.
de: Der für den Member "{1}" angegebene JsonConverterAttribute-Typ "{0}" ist kein Konvertertyp oder enthält keinen parameterlosen Konstruktor, auf den zugegriffen werden kann.
es: El tipo “JsonConverterAttribute” “{0}” especificado en el miembro “{1}” no es un tipo de convertidor o no contiene un constructor sin parámetros accesible.
fr: Le type 'JsonConverterAttribute' '{0}' spécifié sur le membre '{1}' n’est pas un type convertisseur ou ne contient pas de constructeur sans paramètre accessible.
it: Il tipo 'JsonConverterAttribute' '{0}' specificato nel membro '{1}' non è un tipo di convertitore o non contiene un costruttore senza parametri accessibile.
ja: メンバー '{1}' で指定されている 'JsonConverterAttribute' 型 '{0}' はコンバーター型ではないか、アクセス可能なパラメーターなしのコンストラクターを含んでいません。
ko: '{1}' 멤버에 지정된 'JsonConverterAttribute' 형식 '{0}'이(가) 변환기 형식이 아니거나 액세스 가능한 매개 변수가 없는 생성자를 포함하지 않습니다.
pl: Typ „{0}” „JsonConverterAttribute” określony w przypadku składowej „{1}” nie jest typem konwertera lub nie zawiera dostępnego konstruktora bez parametrów.
pt_br: O tipo "JsonConverterAttribute" "{0}" especificado no membro "{1}" não é um tipo de conversor ou não contém um construtor sem parâmetros acessível.
ru: Тип "JsonConverterAttribute" "{0}", указанный в элементе "{1}", не является типом преобразователя или не содержит доступного конструктора без параметров.
tr: '{1}' üyesi üzerinde belirtilen 'JsonConverterAttribute' '{0}' türü dönüştürücü türü değil veya erişilebilir parametresiz bir oluşturucu içermiyor.
zh_hans: 在成员 "{1}" 上指定的 "JsonConverterAttribute" 类型 "{0}" 不是转换器类型或不包含可访问的无参数构造函数。
zh_hant: 成員 '{1}' 上指定的 'JsonConverterAttribute' 類型 '{0}' 不是轉換器類型，或不包含可存取的無參數建構函式。

# JsonConverterAttributeInvalidTypeTitle
source: The 'JsonConverterAttribute.Type' contains an invalid or inaccessible argument.
cs: JsonConverterAttribute.Type obsahuje neplatný nebo nepřístupný argument.
de: "JsonConverterAttribute.Type" enthält ein ungültiges oder nicht zugängliches Argument.
es: “JsonConverterAttribute.Type” contiene un argumento no válido o inaccesible.
fr: 'JsonConverterAttribute.Type' contient un argument non valide ou inaccessible.
it: 'JsonConverterAttribute.Type' contiene un argomento non valido o inaccessibile.
ja: 'JsonConverterAttribute.Type' に無効な、またはアクセスできない引数が含まれています。
ko: 'JsonConverterAttribute.Type'에 잘못되었거나 액세스할 수 없는 인수가 포함되어 있습니다.
pl: Typ „JsonConverterAttribute.Type” zawiera nieprawidłowy lub niedostępny argument.
pt_br: O "JsonConverterAttribute.Type" contém um argumento inválido ou inacessível.
ru: Аргумент "JsonConverterAttribute.Type" содержит недопустимый или недоступный аргумент.
tr: 'JsonConverterAttribute.Type' geçersiz veya erişilemeyen bir bağımsız değişken içeriyor.
zh_hans: "JsonConverterAttribute.Type" 包含无效或不可访问的参数。
zh_hant: 'JsonConverterAttribute.Type' 包含無效或無法存取的引數。

# JsonSerializableAttributeOnNonContextTypeMessageFormat
source: The type '{0}' has been annotated with JsonSerializableAttribute but does not derive from JsonSerializerContext. No source code will be generated.
cs: Typ „{0}“ byl anotován atributem JsonSerializableAttribute, ale není odvozen od třídy JsonSerializerContext. Nebude vygenerován žádný zdrojový kód.
de: Der Typ "{0}" wurde mit JsonSerializableAttribute kommentiert, ist aber nicht von JsonSerializerContext abgeleitet. Es wird kein Quellcode generiert.
es: El tipo "{0}" se ha anotado con JsonSerializableAttribute, pero no se deriva de JsonSerializerContext. No se generará ningún código fuente.
fr: Le type '{0}' a été annoté avec l'attribut JsonSerializable mais ne dérive pas de JsonSerializerContext. Aucun code source ne sera généré.
it: Il tipo '{0}' è stato annotato con JsonSerializableAttribute ma non deriva da JsonSerializerContext. Non verrà generato alcun codice sorgente.
ja: 型 '{0}' は JsonSerializableAttribute で注釈が付けられていますが、JsonSerializerContext から派生したものではありません。ソース コードは生成されません。
ko: '{0}' 형식에 JsonSerializableAttribute 주석이 추가되었지만 JsonSerializerContext에서 파생되지 않았습니다. 소스 코드가 생성되지 않습니다.
pl: Typ „{0}” ma adnotacje z atrybutem JsonSerializableAttribute, ale nie pochodzi od elementu JsonSerializerContext. Nie zostanie wygenerowany żaden kod źródłowy.
pt_br: O tipo '{0}' foi anotado com JsonSerializableAttribute, mas não deriva de JsonSerializerContext. Nenhum código-fonte será gerado.
ru: Тип "{0}" помечен атрибутом JsonSerializableAttribute, но не является производным от JsonSerializerContext. Исходный код не будет создан.
tr: '{0}' türü, JsonSerializableAttribute ile ek açıklama eklenmiş ancak JsonSerializerContext'ten türetmiyor. Kaynak kodu oluşturulmayacak.
zh_hans: 类型“{0}”已使用 JsonSerializableAttribute 进行批注，但不是从 JsonSerializerContext 派生的。不会生成源代码。
zh_hant: 類型 '{0}' 已使用 JsonSerializableAttribute 標註，但並非衍生自 JsonSerializerCoNtext。將不會產生原始程式碼。

# JsonSerializableAttributeOnNonContextTypeTitle
source: Types annotated with JsonSerializableAttribute must be classes deriving from JsonSerializerContext.
cs: Typy anotované atributem JsonSerializableAttribute musí být třídy odvozené od třídy JsonSerializerContext.
de: Mit JsonSerializableAttribute kommentierte Typen müssen Klassen sein, die von JsonSerializerContext abgeleitet werden.
es: Los tipos anotados con JsonSerializableAttribute deben ser clases derivadas de JsonSerializerContext.
fr: Les types annotés avec l'attribut JsonSerializable doivent être des classes dérivant de JsonSerializerContext.
it: I tipi annotati con JsonSerializableAttribute devono essere classi che derivano da JsonSerializerContext.
ja: JsonSerializableAttribute で注釈が付けられた型は、JsonSerializerContext から派生するクラスである必要があります。
ko: JsonSerializableAttribute 주석이 추가된 형식은 JsonSerializerContext에서 파생된 클래스여야 합니다.
pl: Typy z adnotacjami JsonSerializableAttribute muszą być klasami pochodzącymi z elementu JsonSerializerContext.
pt_br: Tipos anotados com JsonSerializable Attribute devem ser classes derivadas de JsonSerializerContext.
ru: Типы, аннотированные атрибутом JsonSerializableAttribute, должны быть классами, производными от JsonSerializerContext.
tr: JsonSerializableAttribute ile not eklenen türler, JsonSerializerContext'ten türetilen sınıflar olmalıdır.
zh_hans: 使用 JsonSerializableAttribute 批注的类型必须是派生自 JsonSerializerContext 的类。
zh_hant: 以 JsonSerializableAttribute 標註的類型必須為衍生自 JsonSerializerCoNtext 的類別。

# JsonStringEnumConverterNotSupportedMessageFormat
source: The member '{0}' has been annotated with 'JsonStringEnumConverter' which is not supported in native AOT. Consider using the generic 'JsonStringEnumConverter<TEnum>' instead.
cs: Člen {0} byl opatřen poznámkou jsonStringEnumConverter, což není v nativním AOT podporováno. Zvažte použití obecného objektu JsonStringEnumConverter<TEnum>.
de: Der Member "{0}" wurde mit "JsonStringEnumConverter" kommentiert, was in nativem AOT nicht unterstützt wird. Erwägen Sie stattdessen die Verwendung des generischen "JsonStringEnumConverter<TEnum>".
es: El miembro '{0}' se ha anotado con 'JsonStringEnumConverter', que no se admite en AOT nativo. Considere la posibilidad de usar el elemento genérico "JsonStringEnumConverter<TEnum>" en su lugar.
fr: Le membre '{0}' a été annoté avec 'JsonStringEnumConverter', ce qui n’est pas pris en charge dans AOT natif. Utilisez plutôt le générique 'JsonStringEnumConverter<TEnum>'.
it: Il membro '{0}' è stato annotato con 'JsonStringEnumConverter' che non è supportato in AOT nativo. Provare a usare il generico 'JsonStringEnumConverter<TEnum>'.
ja: メンバー '{0}' には、ネイティブ AOT ではサポートされていない 'JsonStringEnumConverter' の注釈が付けられています。 代わりに汎用の 'JsonStringEnumConverter<TEnum>' を使用することを検討してください。
ko: '{0}' 멤버에 네이티브 AOT에서 지원되지 않는 'JsonStringEnumConverter'로 주석이 달렸습니다. 대신 제네릭 'JsonStringEnumConverter<TEnum>'을 사용해 보세요.
pl: Element członkowski '{0}' został opatrzony adnotacją 'JsonStringEnumConverter', która nie jest obsługiwana w natywnym AOT. Zamiast tego należy rozważyć użycie ogólnego konwertera „JsonStringEnumConverter<TEnum>”.
pt_br: O membro "{0}" foi anotado com "JsonStringEnumConverter" que não tem suporte na AOT nativa. Considere usar o genérico "JsonStringEnumConverter<TEnum>".
ru: Элемент "{0}" содержит примечание JsonStringEnumConverter, что не поддерживается в собственном AOT. Вместо этого рассмотрите возможность использовать универсальный параметр JsonStringEnumConverter<TEnum>.
tr: '{0}' adlı üyeye yerel AOT’de desteklenmeyen 'JsonStringEnumConverter' parametresi eklendi. bunun yerine genel 'JsonStringEnumConverter<TEnum>' parametresini kullanmayı deneyin.
zh_hans: 成员“{0}”已使用本机 AOT 中不支持的 "JsonStringEnumConverter" 进行批注。请改为考虑使用泛型 "JsonStringEnumConverter<TEnum>"。
zh_hant: 成員 '{0}' 已使用原生 AOT 不支援的 'JsonStringEnumConverter' 加上標註。請考慮改用一般 'JsonStringEnumConverter<TEnum>'。

# JsonStringEnumConverterNotSupportedTitle
source: The non-generic 'JsonStringEnumConverter' requires dynamic code.
cs: Neobecný objekt JsonStringEnumConverter vyžaduje dynamický kód.
de: Der nicht generische "JsonStringEnumConverter" erfordert dynamischen Code.
es: El elemento 'JsonStringEnumConverter' no genérico requiere código dinámico.
fr: Le 'JsonStringEnumConverter' non générique requiert du code dynamique.
it: L'elemento 'JsonStringEnumConverter' non generico richiede un codice dinamico.
ja: 非ジェネリック 'JsonStringEnumConverter' には動的コードが必要です。
ko: 제네릭이 아닌 'JsonStringEnumConverter'에는 동적 코드가 필요합니다.
pl: Nieogólny element „JsonStringEnumConverter” wymaga dynamicznego kodu.
pt_br: O "JsonStringEnumConverter" não genérico requer código dinâmico.
ru: Для неуниверсального параметра JsonStringEnumConverter требуется динамический код.
tr: Genel olmayan 'JsonStringEnumConverter' parametresi dinamik kod gerektirir.
zh_hans: 非泛型 "JsonStringEnumConverter" 需要动态代码。
zh_hant: 非一般 'JsonStringEnumConverter' 需要動態程式碼。

# JsonUnsupportedLanguageVersionMessageFormat
source: The System.Text.Json source generator is not available in C# {0}. Please use language version {1} or greater.
cs: Zdrojový generátor System.Text.Json není k dispozici v jazyce C# {0}. Použijte prosím jazykovou verzi {1} nebo vyšší.
de: Der System.Text.Json-Quellgenerator ist in C# {0} nicht verfügbar. Verwenden Sie die Sprachversion {1} oder höher.
es: El generador de origen System.Text.Json no está disponible en C# {0}. Use la versión de idioma {1} o superior.
fr: Le générateur de source System.Text.Json n'est pas disponible en C# « {0} ». Veuillez utiliser la version linguistique {1} ou supérieure.
it: Il generatore di origine System.Text.Json non è disponibile in C# {0}. Usare la versione del linguaggio {1} o successiva.
ja: System.Text.Json ソース ジェネレーターは、C# {0}では使用できません。言語バージョン {1} 以上を使用してください。
ko: System.Text.Json 원본 생성기는 C# {0}에서 사용할 수 없습니다. {1} 이상의 언어 버전을 사용하세요.
pl: Generator źródła System.Text.Json nie jest dostępny w języku C# {0}. Użyj wersji językowej {1} lub nowszej.
pt_br: O gerador de origem System.Text.Json não está disponível em C# {0}. Use a versão do idioma {1} ou superior.
ru: Генератор исходного кода System.Text.Json не доступен в C# {0}. Используйте языковую версию {1} или выше.
tr: System.Text.Json kaynak oluşturucusu C# {0}'ta mevcut değildir. Lütfen {1} dil sürümünü veya daha üstünü kullanın.
zh_hans: System.Text.Json 源生成器在 C# {0} 中不可用。请使用{1}或更高版本的语言版本。
zh_hant: C# {0} 中無法使用 System.Text.Json 來源產生器。請使用 {1} 或更新的語言版本。

# JsonUnsupportedLanguageVersionTitle
source: C# language version not supported by the source generator.
cs: Zdrojový generátor nepodporuje jazykovou verzi jazyka C#.
de: Die C#-Sprachversion wird vom Quellgenerator nicht unterstützt.
es: La versión del idioma C# no es compatible con el generador de origen.
fr: Version du langage C# non prise en charge par le générateur de source.
it: Versione del linguaggio C# non supportata dal generatore di origine.
ja: ソース ジェネレーターでサポートされていない C# 言語バージョン。
ko: 원본 생성기에서 지원되지 않는 C# 언어 버전입니다.
pl: Wersja języka C# nie jest obsługiwana przez generator źródła.
pt_br: Versão da linguagem C# não suportada pelo gerador de origem.
ru: Версия языка C# не поддерживается генератором исходного кода.
tr: C# dil sürümü kaynak oluşturucu tarafından desteklenmiyor.
zh_hans: 源生成器不支持 C# 语言版本。
zh_hant: 來源產生器不支援 C# 語言版本。

# MultipleJsonConstructorAttributeFormat
source: Type '{0}' has multiple constructors annotated with 'JsonConstructorAttribute'.
cs: Typ {0} má více konstruktorů anotovaných s JsonConstructorAttribute.
de: Typ "{0}" weist mehrere Konstruktoren mit dem Kommentar "JsonConstructorAttribute" auf.
es: El tipo '{0}' tiene varios constructores anotados con 'JsonConstructorAttribute'.
fr: Le type' {0} 'a plusieurs constructeurs annotés avec’JsonConstructorAttribute'.
it: Il tipo '{0}' contiene più costruttori che presentano l'annotazione 'JsonConstructorAttribute'.
ja: 型 '{0}' には、'JsonConstructorAttribute' で注釈が付けられた複数のコンストラクターがあります。
ko: '{0}' 형식에 'JsonConstructorAttribute'로 주석이 추가된 여러 생성자가 있습니다.
pl: Typ "{0}" ma wiele konstruktorów z adnotacją "JsonConstructorAttribute".
pt_br: O tipo '{0}' tem vários construtores anotados com 'JsonConstructorAttribute'.
ru: Тип "{0}" имеет несколько конструкторов, аннотированных с использованием JsonConstructorAttribute.
tr: '{0}' türünün 'JsonConstructorAttribute' ile açıklanan birden çok oluşturucusu var.
zh_hans: 类型“{0}”具有用 “JsonConstructorAttribute” 批注的多个构造函数。
zh_hant: 類型 '{0}' 包含多個以 'JsonConstructorAttribute' 註解的建構函式。

# MultipleJsonConstructorAttributeTitle
source: Type has multiple constructors annotated with JsonConstructorAttribute.
cs: Typ obsahuje více konstruktorů anotovaných s JsonConstructorAttribute.
de: Der Typ weist mehrere Konstruktoren mit dem Kommentar JsonConstructorAttribute auf.
es: El tipo tiene varios constructores anotados con JsonConstructorAttribute.
fr: Le type a plusieurs constructeurs annotés avec JsonConstructorAttribute.
it: Il tipo contiene più costruttori che presentano l'annotazione JsonConstructorAttribute.
ja: 型には、JsonConstructorAttribute で注釈が付けられた複数のコンストラクターがあります。
ko: 해당 형식에 JsonConstructorAttribute로 주석이 추가된 여러 생성자가 있습니다.
pl: Typ ma wiele konstruktorów z adnotacją JsonConstructorAttribute.
pt_br: O tipo tem vários construtores anotados com JsonConstructorAttribute.
ru: Тип имеет несколько конструкторов, аннотированных с использованием JsonConstructorAttribute.
tr: Türün JsonConstructorAttribute ile açıklanan birden çok oluşturucusu var.
zh_hans: 类型具有用 JsonConstructorAttribute 批注的多个构造函数。
zh_hant: 類型包含多個以 JsonConstructorAttribute 註解的建構函式。

# MultipleJsonExtensionDataAttributeFormat
source: Type '{0}' has multiple members annotated with 'JsonExtensionDataAttribute'.
cs: Typ {0} obsahuje více členů s komentářem JsonExtensionDataAttribute.
de: Typ „{0}“ enthält mehrere Elemente, die mit dem „JsonExtensionDataAttribute“ versehen sind.
es: El tipo '{0}' tiene varios miembros anotados con 'JsonExtensionDataAttribute'.
fr: Le type '{0}' comporte plusieurs membres annotés avec JsonExtensionDataAttribute.
it: Nel tipo '{0}' sono presenti più membri annotati con 'JsonExtensionDataAttribute'.
ja: 型 '{0}' には、'JsonExtensionDataAttribute' に注釈が付けられた複数のメンバーが含まれます。
ko: '{0}' 형식에 JsonExtensionDataAttribute로 주석이 추가 된 멤버가 여러 개 있습니다.
pl: Typ "{0}" ma wiele składowych opatrzonych adnotacjami za pomocą atrybutu "JsonExtensionDataAttribute".
pt_br: Tipo '{0}' tem vários membros anotados com 'JsonExtensionDataAttribute'.
ru: Тип "{0}" содержит несколько элементов, помеченных с помощью "JsonExtensionDataAttribute".
tr: '{0}' türü, JsonExtensionDataAttribute ile ilişkili birden çok üyeye sahip.
zh_hans: 类型“{0}”具有多个带有 “JsonExtensionDataAttribute” 注释的成员。
zh_hant: 類型 '{0}' 有使用 'JsonExtensionDataAttribute' 標註的多個成員。

# MultipleJsonExtensionDataAttributeTitle
source: Type has multiple members annotated with JsonExtensionDataAttribute.
cs: Typ obsahuje více členů s komentářem JsonExtensionDataAttribute
de: Der Typ enthält mehrere Elemente, die mit dem JsonExtensionDataAttribute versehen sind.
es: El tipo tiene varios miembros anotados con JsonExtensionDataAttribute.
fr: Le type comporte plusieurs membres annotés avec JsonExtensionDataAttribute.
it: Nel tipo sono presenti più membri annotati con JsonExtensionDataAttribute.
ja: 型には、'JsonExtensionDataAttribute' に注釈が付けられた複数のメンバーが含まれます。
ko: 형식에 JsonExtensionDataAttribute로 주석이 추가 된 멤버가 여러 개 있습니다.
pl: Typ ma wiele składowych opatrzonych adnotacjami za pomocą atrybutu JsonExtensionDataAttribute.
pt_br: Tipo tem vários membros anotados com JsonExtensionDataAttribute.
ru: Тип содержит несколько элементов, помеченных с помощью JsonExtensionDataAttribute.
tr: Tür, JsonExtensionDataAttribute ile açıklanan birden çok üyeye sahip.
zh_hans: 类型具有多个带有 JsonExtensionDataAttribute 注释的成员。
zh_hant: 類型具有使用 JsonExtensionDataAttribute 標註的多個成員。

# TypeNotSupportedMessageFormat
source: Did not generate serialization metadata for type '{0}'.
cs: Nevygenerovala se metadata serializace pro typ {0}.
de: Die Serialisierungsmetadaten für den Typ "{0}" wurden nicht generiert.
es: No generó metadatos de serialización para el tipo '{0}".
fr: Les métadonnées de sérialisation pour le type « {0} » n’ont pas été générées.
it: Non sono stati generati metadati di serializzazione per il tipo '{0}'.
ja: '{0}'型 のシリアル化メタデータを生成ませんでした。
ko: '{0}' 형식에 대한 직렬화 메타데이터가 생성되지 않았습니다.
pl: Nie wygenerowano metadanych serializacji dla typu „{0}”.
pt_br: Não gerou metadados de serialização para o tipo '{0}'.
ru: Метаданные сериализации для типа "{0}" не сформированы.
tr: '{0}' türü için serileştirme meta verileri oluşturulmadı.
zh_hans: 未生成类型 '{0}' 的序列化元数据。
zh_hant: 未產生類型 '{0}' 的序列化中繼資料。

# TypeNotSupportedTitle
source: Did not generate serialization metadata for type.
cs: Nevygenerovala se metadata serializace pro typ
de: Serialisierungsmetadaten für den Typ wurden nicht generiert
es: No generó metadatos de serialización de metadatos para el tipo.
fr: Les métadonnées de sérialisation pour le type n’ont pas été générées.
it: Non sono stati generati metadati di serializzazione per il tipo.
ja: 型のシリアル化メタデータが生成されません。
ko: 형식에 대한 직렬화 메타데이터가 생성되지 않았습니다.
pl: Nie wygenerowano metadanych serializacji dla typu.
pt_br: Não gerou metadados de serialização para o tipo.
ru: Метаданные сериализации для типа не сформированы.
tr: Tür için serileştirme meta verileri oluşturulmadı.
zh_hans: 未生成类型的序列化元数据。
zh_hant: 未產生類型的序列化中繼資料。
