Repository: dotnet/runtime
Catalog: src/libraries/System.Text.Json/gen/Resources/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ContextClassesMustBePartialMessageFormat
source: Derived 'JsonSerializerContext' type '{0}' specifies JSON-serializable types. The type and all containing types must be made partial to kick off source generation.
cs: Odvozený typ JsonSerializerContext {0} určuje typy serializovatelné na JSON. Typ a všechny obsahující typy musí být částečné, aby se zahájilo generování zdroje.
de: Der abgeleitete JsonSerializerContext-Typ "{0}" gibt serialisierbare JSON-Typen an. Der Typ und alle enthaltenden Typen müssen partiell sein, um die Quellgenerierung zu starten.
es: El tipo derivado "JsonSerializerContext" "{0}" especifica tipos de JSON serializables. El tipo y todos los tipos que contienen deben hacerse parciales para iniciar la generación de origen.
fr: Le type 'JsonSerializerContext' dérivé '{0}' spécifie des types Sérialisables JSON. Le type et tous les types contenants doivent être rendus partiels pour lancer la génération de la source.
it: Il tipo 'JsonSerializerContext 'derivato '{0}' specifica i tipi serializzabili JSON. Il tipo e tutti i tipi contenenti devono essere parziali per iniziare la generazione dell'origine.
ja: 派生した 'JsonSerializerContext'型 '{0}' は、JSON シリアル化可能な型を指定します。ソース生成を開始するには、型と含まれているすべての型を部分的にする必要があります。
ko: 파생된 'JsonSerializerContext' 유형 '{0}'은(는) JSON 직렬화 가능한 유형을 지정합니다. 소스 생성을 위해 유형 및 모든 포함 유형을 부분적으로 만들어야 합니다.
pl: Pochodny typ "JsonSerializerContext" "{0}" określa typy możliwe do serializacji w notacji JSON. Typ i wszystkie zawierające typy muszą być częściowe, aby uruchomić generowanie źródła.
pt_br: O tipo 'JsonSerializerContext' derivado '{0}' especifica tipos serializáveis por JSON. O tipo e todos os tipos de contenção devem ser feitos parcialmente para iniciar a geração de origem.
ru: Производный тип "JsonSerializerContext"{0}' указывает сериализуемые типы в формате JSON. Тип и все содержащие типы необходимо сделать частичными для начала генерации источника.
tr: Türetilmiş 'JsonSerializerContext' türü '{0}' JSON ile seri hale getirilebilir türleri belirtir. kaynak oluşturmayı başlatmak için bu türün ve bu türü içeren tüm türlerin kısmi yapılması gerekir.
zh_hans: 派生的 “JsonSerializerContext” 类型“{0}”指定 JSON-serializable 类型。该类型和所有包含类型必须设为部分，以启动源生成。
zh_hant: 衍生的 'JsonSerializerContext' 型別 '{0}' 指定了 JSON 可序列化類型。類型和所有包含類型必須設為部份，才可開始產生原始檔。

# ContextClassesMustBePartialTitle
source: Derived 'JsonSerializerContext' types and all containing types must be partial.
cs: Odvozené typy JsonSerializerContext a všechny obsahující typy musí být částečné.
de: Abgeleitete JsonSerializerContext-Typen und alle enthaltenden Typen müssen partiell sein.
es: Los tipos derivados "JsonSerializerContext" y todos los tipos que contienen deben ser parciales.
fr: Les types dérivés 'JsonSerializerContext' et tous les types conteneurs doivent être partiels.
it: I tipi derivati 'JsonSerializerContext' e tutti i tipi contenenti devono essere parziali.
ja: 派生した 'JsonSerializerContext' 型と含まれているすべての型は部分的である必要があります。
ko: 파생된 'JsonSerializerContext' 형식과 포함하는 모든 형식은 부분이어야 합니다.
pl: Pochodne typy "JsonSerializerContext" i wszystkich zawierające typy muszą być częściowe.
pt_br: Os tipos derivados de 'JsonSerializerContext' e todos os tipos contidos devem ser parciais.
ru: Производные типы "JsonSerializerContext" и все содержащие типы должны быть частичными.
tr: Türetilmiş 'JsonSerializerContext' türleri ve bunları içeren tüm türler kısmi olmalıdır.
zh_hans: 派生的 “JsonSerializerContext” 类型以及所有包含类型必须是部分。
zh_hant: 衍生的 'JsonSerializerContext' 類型和所有包含類型必須是部份。

# DataExtensionPropertyInvalidFormat
source: The data extension property '{0}.{1}' is invalid. It must implement 'IDictionary<string, JsonElement>' or 'IDictionary<string, object>', or be 'JsonObject'.
cs: Vlastnost rozšíření dat {0}.{1} není platná. Musí implementovat IDictionary<string, JsonElement> nebo IDictionary<string, object>, nebo být JsonObject.
de: Die Datenerweiterungseigenschaft „{0}.{1}“ ist ungültig. Sie muss „IDictionary<string, JsonElement>“ oder „IDictionary<string, object>“ oder „JsonObject“ implementieren.
es: La propiedad de extensión de datos '{0}.{1}' no es válida. Debe implementar 'IDictionary<string, JsonElement>' o 'IDictionary<string, object>', o ser 'JsonObject'.
fr: La propriété d'extension de données '{0}.{1}' n'est pas valide. Elle doit mettre en œuvre 'IDictionary<string, JsonElement>' ou 'IDictionary<string, object>', ou être 'JsonObject'.
it: La proprietà '{0}.{1}' dell'estensione dati non è valida. Deve implementare 'IDictionary<string, JsonElement>' o 'IDictionary<String, Object>' o 'JsonObject '.
ja: データ拡張プロパティ '{0}.{1}' が無効です。これには、'IDictionary<string, JsonElement>'、'IDictionary<string, object>'、または 'JsonObject' を実装する必要があります。
ko: 데이터 확장 속성 '{0}.{1}'이 잘못되었습니다. 'IDictionary<string, JsonElement>'나 'IDictionary<string, object>' 를 구현하거나 'JsonObject'여야 합니다.
pl: Właściwość rozszerzenia danych "{0}.{1}" jest nieprawidłowa. Musi ona zaimplementować ciąg "IDictionary<string, JsonElement>" lub "IDictionary<string, object>" albo być obiektem "JsonObject".
pt_br: A propriedade da extensão de dados '{0}.{1}' é inválida. Deve implementar 'IDictionary<string, JsonElement>' ou 'IDictionary<string, object>', ou ter 'JsonObject'.
ru: Свойство расширения данных "{0}.{1}" недопустимо. Оно должен реализовывать строку "IDictionary<string, JsonElement>" или "IDictionary<string, Object>" либо являться "JsonObject".
tr: '{0}.{1}' veri uzantısı özelliği geçersiz. 'IDictionary<string, JsonElement>' veya 'IDictionary<string, object>' uygulamalı ya da 'JsonObject' olmalıdır.
zh_hans: 数据扩展属性“{0}.{1}”无效。它必须实现“IDictionary<string, JsonElement>”或“IDictionary<string, object>”，或为 “JsonObject”。
zh_hant: 資料延伸屬性 '{0}.{1}' 無效。它必須實作 'IDictionary<string, JsonElement>' 或 'IDictionary<string, object>'，或者為 'JsonObject'。

# DataExtensionPropertyInvalidTitle
source: Data extension property type invalid.
cs: Typ vlastnosti rozšíření dat není platný
de: Der Typ der Datenerweiterungseigenschaft ist ungültig.
es: Tipo de propiedad de extensión de datos no válido.
fr: Type de propriété d’extension de données non valide
it: Il tipo di proprietà dell'estensione dati non è valido.
ja: データ拡張プロパティの型が無効です。
ko: 데이터 확장 속성 형식이 잘못되었습니다.
pl: Nieprawidłowy typ właściwości rozszerzenia danych.
pt_br: Tipo de propriedade de extensão de dados inválido.
ru: Недопустимый тип свойства расширения данных.
tr: Veri uzantısı özellik türü geçersiz.
zh_hans: 数据扩展属性类型无效。
zh_hant: 資料延伸屬性類型無效。

# DerivedJsonConverterAttributesNotSupportedMessageFormat
source: The custom attribute '{0}' deriving from JsonConverterAttribute is not supported by the source generator.
cs: Generátor zdroje nepodporuje vlastní atribut „{0}“ odvozený od atributu JsonConverterAttribute.
de: Das von JsonConverterAttribute abgeleitete benutzerdefinierte Attribut "{0}" wird vom Quellgenerator nicht unterstützt.
es: El generador de origen no admite el atributo personalizado '{0}' derivado de JsonConverterAttribute.
fr: L'attribut personnalisé '{0}' dérivant de JsonConverterAttribute n'est pas pris en charge par le générateur source.
it: L'attributo personalizzato '{0}' che deriva da JsonConverterAttribute non è supportato dal generatore di origine.
ja: JsonConverterAttribute から派生するカスタム属性 '{0}' は、ソース ジェネレーターではサポートされていません。
ko: JsonConverterAttribute에서 파생된 사용자 지정 속성 '{0}'은(는) 원본 생성기에서 지원되지 않습니다.
pl: Generator źródłowy nie obsługuje atrybutu niestandardowego „{0}” pochodzącego od atrybutu JsonConverterAttribute.
pt_br: O atributo customizado '{0}' derivado de JsonConverterAttribute não tem suporte pelo gerador de origem.
ru: Пользовательский атрибут "{0}", производный от JsonConverterAttribute, не поддерживается генератором исходного кода.
tr: JsonConverterAttribute’tan türetilen özel öznitelik '{0}' kaynak oluşturucu tarafından desteklenmiyor.
zh_hans: 源生成器不支持从 JsonConverterAttribute 派生的自定义属性“{0}”。
zh_hant: 來源產生器不支援衍生自 JsonConverterAttribute 的自訂屬性 '{0}'。

# DerivedJsonConverterAttributesNotSupportedTitle
source: Attributes deriving from JsonConverterAttribute are not supported by the source generator.
cs: Zdrojový generátor nepodporuje atributy odvozené od atributu JsonConverterAttribute.
de: Von JsonConverterAttribute abgeleitete Attribute werden vom Quellgenerator nicht unterstützt.
es: El generador de origen no admite los atributos derivados de JsonConverterAttribute.
fr: Les attributs dérivant de JsonConverterAttribute ne sont pas pris en charge par le générateur de source.
it: Gli attributi che derivano da JsonConverterAttribute non sono supportati dal generatore di origine.
ja: JsonConverterAttribute から派生する属性は、ソース ジェネレーターではサポートされていません。
ko: JsonConverterAttribute에서 파생되는 특성은 소스 생성기에서 지원되지 않습니다.
pl: Atrybuty pochodzące z atrybutu JsonConverterAttribute nie są obsługiwane przez generator źródła.
pt_br: Os atributos derivados de JsonConverterAttribute não têm suporte pelo gerador de origem.
ru: Атрибуты, производные от JsonConverterAttribute, не поддерживаются генератором исходного кода.
tr: JsonConverterAttribute’tan türetilen öznitelikler kaynak oluşturucu tarafından desteklenmiyor.
zh_hans: 源生成器不支持从 JsonConverterAttribute 派生的属性。
zh_hant: 來源產生器不支援衍生自 JsonConverterAttribute 的屬性。

# DuplicateTypeNameMessageFormat
source: There are multiple types named '{0}'. Source was generated for the first one detected. Use 'JsonSerializableAttribute.TypeInfoPropertyName' to resolve this collision.
cs: Existuje více typů s názvem „{0}“. Zdroj byl vygenerován pro první zjištěný zdroj. K vyřešení této kolize použijte JsonSerializableAttribute.TypeInfoPropertyName.
de: Es gibt mehrere Typen mit dem Namen "{0}". Die Quelle wurde für die erste erkannte Quelle generiert. Verwenden Sie "JsonSerializableAttribute.TypeInfoPropertyName", um diesen Konflikt zu beheben.
es: Hay varios tipos denominados "{0}". El origen se generó para el primero detectado. Use "JsonSerializableAttribute.TypeInfoPropertyName" para resolver esta colisión.
fr: Il existe plusieurs types nommés '{0}'. La source a été générée pour le premier détecté. Utilisez 'JsonSerializableAttribute.TypeInfoPropertyName' pour résoudre cette collision.
it: Sono presenti più tipi denominati '{0}'. L'origine è stata generata per il primo tipo rilevato. Per risolvere questa collisione, usare 'JsonSerializableAttribute.TypeInfoPropertyName'.
ja: '{0}' と名前が付けられた種類が複数あります。最初に検出されたものに対してソースが生成されました。この問題を解決するには、'JsonSerializableAttribute.TypeInfoPropertyName' を使用します。
ko: 이름이 '{0}'인 형식이 여러 개 있습니다. 처음 검색된 것에 대한 원본이 생성되었습니다. 이 충돌을 해결하려면 'JsonSerializableAttribute.TypeInfoPropertyName'을 사용하세요.
pl: Istnieje wiele typów o nazwie „{0}”. Wygenerowano źródło dla pierwszego wykrytego elementu. Aby rozwiązać tę kolizję, użyj elementu „JsonSerializableAttribute. TypeInfoPropertyName”.
pt_br: Existem vários tipos chamados '{0}'. A fonte foi gerada para o primeiro detectado. Use 'JsonSerializableAttribute.TypeInfoPropertyName' para resolver essa colisão.
ru: Существует несколько типов с именем "{0}". Исходный код сформирован для первого обнаруженного типа. Используйте JsonSerializableAttribute.TypeInfoPropertyName для устранения этого конфликта.
tr: '{0}' adını taşıyan birden çok tür var. Kaynak, algılanan ilk tür için oluşturuldu. Bu çarpışmayı çözmek için 'JsonSerializableAttribute.TypeInfoPropertyName' özelliğini kullanın.
zh_hans: 有多个名为 {0} 的类型。已为第一个检测到类型的生成源。请使用“JsonSerializableAttribute.TypeInfoPropertyName”以解决此冲突。
zh_hant: 有多個名為 '{0}' 的類型。已為偵測到的第一個項目產生來源。請使用 'JsonSerializableAttribute.TypeInfoPropertyName' 解決此衝突。

# DuplicateTypeNameTitle
source: Duplicate type name.
cs: Duplicitní název typu
de: Doppelter Typname
es: Nombre de tipo duplicado.
fr: Nom de type dupliqué.
it: Nome di tipo duplicato.
ja: 重複した種類名。
ko: 중복된 형식 이름입니다.
pl: Zduplikowana nazwa typu.
pt_br: Nome de tipo duplicado.
ru: Дублирующееся имя типа.
tr: Yinelenen tür adı.
zh_hans: 重复的类型名称。
zh_hant: 重複類型名稱。

# FastPathPolymorphismNotSupportedMessageFormat
source: Type '{0}' is annotated with 'JsonDerivedTypeAttribute' which is not supported in 'JsonSourceGenerationMode.Serialization'.
cs: Typ {0} je anotován atributem JsonDerivedTypeAttribute, který se v JsonSourceGenerationMode.Serialization nepodporuje.
de: Der Typ „{0}“ ist mit „JsonDerivedTypeAttribute“ versehen, was in „JsonSourceGenerationMode.Serialization“ nicht unterstützt wird.
es: El tipo \"{0}\" está anotado con \"JsonDerivedTypeAttribute\", que no se admite en \"JsonSourceGenerationMode.Serialization\".
fr: Le type « {0} » est annoté avec « JsonDerivedTypeAttribute », ce qui n’est pas pris en charge dans « JsonSourceGenerationMode.Serialization ».
it: Il tipo '{0}' è annotato con 'JsonDerivedTypeAttribute' che non è supportato in 'JsonSourceGenerationMode.Serialization'.
ja: 型 '{0}' は 'JsonDerivedTypeAttribute' の注釈が付けられていますが、これは 'JsonSourceGenerationMode.Serialization' でサポートされていません。
ko: '{0} 형식은 'JsonSourceGenerationMode.Serialization'에서 지원되지 않는 'JsonDerivedTypeAttribute'로 주석이 추가되었습니다.
pl: Typ „{0}” ma adnotację „JsonDerivedTypeAttribute”, która nie jest obsługiwana w elemecie „JsonSourceGenerationMode.Serialization”.
pt_br: O tipo '{0}' é anotado com 'JsonDerivedTypeAttribute' que não tem suporte em 'JsonSourceGenerationMode.Serialization'.
ru: Тип '{0}' аннотирован атрибутом \"JsonDerivedTypeAttribute\", который не поддерживается в \"JsonSourceGenerationMode.Serialization\".
tr: '{0}' türü, 'JsonSourceGenerationMode.Serialization' içinde desteklenmeyen 'JsonDerivedTypeAttribute' ile ek açıklama içeriyor.
zh_hans: 类型 \"{0}\" 使用 \"JsonSourceGenerationMode.Serialization\" 中不支持的 \"JsonDerivedTypeAttribute\" 进行了批注。
zh_hant: 類型 '{0}' 使用 'JsonSourceGenerationMode.Serialization' 不支援的 'JsonDerivedTypeAttribute' 進行註釋。

# FastPathPolymorphismNotSupportedTitle
source: 'JsonDerivedTypeAttribute' is not supported in 'JsonSourceGenerationMode.Serialization'.
cs: Atribut JsonDerivedTypeAttribute se v JsonSourceGenerationMode.Serialization nepodporuje.
de: „JsonDerivedTypeAttribute“ wird in „JsonSourceGenerationMode.Serialization“ nicht unterstützt.
es: \"JsonDerivedTypeAttribute\" no se admite en \"JsonSourceGenerationMode.Serialization\".
fr: « JsonDerivedTypeAttribute » n’est pas pris en charge dans « JsonSourceGenerationMode.Serialization ».
it: 'JsonDerivedTypeAttribute' non è supportato in 'JsonSourceGenerationMode.Serialization'.
ja: 'JsonDerivedTypeAttribute' は 'JsonSourceGenerationMode.Serialization' ではサポートされていません。
ko: 'JsonSourceGenerationMode.Serialization'에서는 'JsonDerivedTypeAttribute'가 지원되지 않습니다.
pl: Atrybut „JsonDerivedTypeAttribute” nie jest obsługiwany w elemecie „JsonSourceGenerationMode.Serialization”.
pt_br: 'JsonDerivedTypeAttribute' não tem suporte em 'JsonSourceGenerationMode.Serialization'.
ru: Атрибут JsonDerivedTypeAttribute не поддерживается в \"JsonSourceGenerationMode.Serialization\".
tr: 'JsonSourceGenerationMode.Serialization' içinde 'JsonDerivedTypeAttribute' desteklenmiyor.
zh_hans: \"JsonSourceGenerationMode.Serialization\" 中不支持 \"JsonDerivedTypeAttribute\"。
zh_hant: 'JsonSourceGenerationMode.Serialization' 中不支援 'JsonDerivedTypeAttribute'。

# InaccessibleJsonIncludePropertiesNotSupportedFormat
source: The member '{0}.{1}' has been annotated with the JsonIncludeAttribute but is not visible to the source generator.
cs: Člen {0}.{1} má anotaci od JsonIncludeAttribute, ale není pro zdrojový generátor viditelný.
de: Der Member "{0}. {1}" wurde mit dem JsonIncludeAttribute versehen, ist jedoch für den Quellgenerator nicht sichtbar.
es: El miembro '{0}.{1}' se ha anotado con JsonIncludeAttribute, pero no es visible para el generador de origen.
fr: Le membre '{0}.{1}' a été annoté avec JsonIncludeAttribute mais n’est pas visible pour le générateur source.
it: Il membro ' {0}.{1}' è stato annotato con JsonIncludeAttribute ma non è visibile al generatore di origine.
ja: メンバー '{0}.{1}' には、JsonIncludeAttribute で注釈が付けられていますが、ソース ジェネレーターには表示されません。
ko: 멤버 '{0}.{1}'이(가) JsonIncludeAttribute로 주석 처리되었지만 원본 생성기에는 표시되지 않습니다.
pl: Składowa "{0}. {1}" jest adnotowana za pomocą atrybutu JsonIncludeAttribute, ale nie jest widoczna dla generatora źródła.
pt_br: O membro '{0}.{1}' foi anotado com o JsonIncludeAttribute, mas não é visível para o gerador de origem.
ru: Элемент "{0}.{1}" аннотирован с использованием класса JsonIncludeAttribute, но генератор исходного кода не обнаруживает этот элемент.
tr: '{0}.{1}' üyesine JsonIncludeAttribute notu eklendi ancak bu üye kaynak oluşturucu tarafından görülmüyor.
zh_hans: 已使用 JsonIncludeAttribute 注释成员“{0}.{1}”，但对源生成器不可见。
zh_hant: 成員 '{0}.{1}' 已經以 JsonIncludeAttribute 標註，但對來源產生器是不可見的。

# InaccessibleJsonIncludePropertiesNotSupportedTitle
source: Inaccessible properties annotated with the JsonIncludeAttribute are not supported in source generation mode.
cs: Nepřístupné vlastnosti anotované s JsonIncludeAttribute se v režimu generování zdroje nepodporují.
de: Nicht zugängliche Eigenschaften, die mit dem JsonIncludeAttribute versehen sind, werden im Quellgenerierungsmodus nicht unterstützt.
es: Las propiedades inaccesibles anotadas con JsonIncludeAttribute no se admiten en el modo de generación de origen.
fr: Les propriétés inaccessibles annotées avec JsonIncludeAttribute ne sont pas prises en charge en mode de génération de source.
it: Le proprietà inaccessibili annotate con JsonIncludeAttribute non sono supportate nella modalità di generazione di origine.
ja: JsonIncludeAttribute で注釈が付けられたアクセスできないプロパティは、ソース生成モードではサポートされていません。
ko: JsonIncludeAttribute로 주석 처리된 액세스할 수 없는 속성은 원본 생성 모드에서 지원되지 않습니다.
pl: Niedostępne właściwości adnotowane za pomocą atrybutu JsonIncludeAttribute nie są obsługiwane w trybie generowania źródła.
pt_br: Propriedades inacessíveis anotadas com JsonIncludeAttribute não são suportadas no modo de geração de origem.
ru: Недоступные свойства, аннотированные с использованием класса JsonIncludeAttribute, не поддерживаются в режиме создания исходного кода.
tr: JsonIncludeAttribute notu eklenmiş erişilemeyen özellikler kaynak oluşturma modunda desteklenmiyor.
zh_hans: 源生成模式不支持使用 JsonIncludeAttribute 注释的不可访问属性。
zh_hant: 來源產生模式不支援以 JsonIncludeAttribute 標註的無法存取屬性。

# InitOnlyPropertyDeserializationNotSupportedFormat
source: The type '{0}' defines init-only properties, deserialization of which is currently not supported in source generation mode.
cs: Typ {0} definuje vlastnosti pouze pro inicializaci, jejichž deserializace se v režimu generování zdroje v současnosti nepodporuje.
de: Der Typ "{0}" definiert nur init-Eigenschaften, deren Deserialisierung im Quellgenerierungsmodus derzeit nicht unterstützt wird.
es: El tipo '{0}' define propiedades de solo inicialización, pero la deserialización no es compatible actualmente con el modo de generación de origen.
fr: Le type' {0}' définit des propriétés init uniquement, dont la désérialisation n'est actuellement pas prise en charge en mode de génération de source.
it: Il tipo '{0}' definisce le proprietà di sola inizializzazione, la cui deserializzazione al momento non è supportata nella modalità di generazione di origine.
ja: 型 '{0}' は、ソース生成モードでは現在サポートされていない init-only プロパティの逆シリアル化を定義します。
ko: '{0}' 유형은 초기화 전용 속성을 정의하며, 이 속성의 역직렬화는 현재 원본 생성 모드에서 지원되지 않습니다.
pl: Typ "{0}" określa właściwości tylko do inicjowania, deserializację, która obecnie nie jest obsługiwana w trybie generowania źródła.
pt_br: O tipo '{0}' define propriedades apenas de inicialização, a desserialização das quais atualmente não é suportada no modo de geração de origem.
ru: Тип "{0}" определяет свойства, предназначенные только для инициализации. Их десериализация сейчас не поддерживается в режиме создания исходного кода.
tr: ‘{0}’ türü, seri durumdan çıkarılması şu anda kaynak oluşturma modunda desteklenmeyen yalnızca başlangıç özelliklerini tanımlar.
zh_hans: 类型“{0}”定义仅初始化属性，源生成模式当前不支持其反序列化。
zh_hant: 來源產生模式目前不支援類型 '{0}' 定義之 init-only 屬性的還原序列化。

# InitOnlyPropertyDeserializationNotSupportedTitle
source: Deserialization of init-only properties is currently not supported in source generation mode.
cs: Deserializace vlastností pouze pro inicializaci se v současnosti v režimu generování zdroje nepodporuje.
de: Die Deserialisierung von reinen init-Eigenschaften wird im Quellgenerierungsmodus derzeit nicht unterstützt.
es: Actualmente no se admite la deserialización de propiedades de solo inicialización en el modo de generación de origen.
fr: La désérialisation des propriétés d’initialisation uniquement n’est actuellement pas prise en charge en mode de génération de source.
it: La deserializzazione delle proprietà di sola inizializzazione al momento non è supportata nella modalità di generazione di origine.
ja: 現在、ソース生成モードでは init-only プロパティの逆シリアル化はサポートされていません。
ko: 초기화 전용 속성의 역직렬화는 현재 원본 생성 모드에서 지원되지 않습니다.
pl: Deserializacja właściwości tylko do inicjowania nie jest obecnie obsługiwana w trybie generowania źródła.
pt_br: A desserialização de propriedades apenas de inicialização não é atualmente suportada no modo de geração de origem.
ru: Десериализация свойств, предназначенных только для инициализации, сейчас не поддерживается в режиме создания исходного кода.
tr: Yalnızca başlangıç özelliklerini seri durumdan çıkarma şu anda kaynak oluşturma modunda desteklenmiyor.
zh_hans: 源生成模式当前不支持仅初始化属性的反序列化。
zh_hant: 來源產生模式目前不支援 init-only 屬性的還原序列化。

# JsonConstructorInaccessibleMessageFormat
source: The constructor on type '{0}' has been annotated with JsonConstructorAttribute but is not accessible by the source generator.
cs: Konstruktor typu {0} byl opatřen poznámkou s atributem JsonConstructorAttribute, ale zdrojový generátor k němu nemá přístup.
de: Der Konstruktor für den Typ "{0}" wurde mit dem Kommentar "JsonConstructorAttribute" versehen, aber der Quellgenerator kann nicht darauf zugreifen.
es: El constructor del tipo '{0}' se ha anotado con JsonConstructorAttribute, pero el generador de origen no puede acceder a él.
fr: Le constructeur sur le type '{0}' a été annoté avec JsonConstructorAttribute mais n'est pas accessible par le générateur source.
it: Il costruttore nel tipo '{0}' è stato annotato con JsonConstructorAttribute ma non è accessibile dal generatore di origine.
ja: 型 '{0}' のコンストラクターには JsonConstructorAttribute で注釈が付けられますが、ソース ジェネレーターからアクセスすることはできません。
ko: '{0}' 형식의 생성자에 JsonConstructorAttribute로 주석이 추가되었지만 원본 생성기에서 액세스할 수 없습니다.
pl: W przypadku konstruktora w zakresie typu „{0}” dokonano adnotacji przy użyciu atrybutu JsonConstructorAttribute, ale nie jest on dostępny dla generatora źródła.
pt_br: O construtor do tipo '{0}' foi anotado com JsonConstructorAttribute, mas não pode ser acessado pelo gerador de origem.
ru: Конструктор для типа "{0}" аннотирован с использованием JsonConstructorAttribute, но недоступен для генератора источника.
tr: '{0}' türündeki oluşturucuya JsonConstructorAttribute ile açıklama eklenmiş ancak kaynak oluşturucu tarafından erişilebilir değil.
zh_hans: 类型“{0}”上的构造函数已使用 JsonConstructorAttribute 进行批注，但源生成器无法访问该构造函数。
zh_hant: 類型 '{0}' 上的建構函式已使用 JsonConstructorAttribute 標註，但無法供來源產生器存取。
