<abi-corpus version='2.0' path='btmp1/libz-ng.so.2.1.0.devel' architecture='elf-mips-r3000-be' soname='libz-ng.so.2'>
  <elf-needed>
    <dependency name='libc.so.6'/>
    <dependency name='ld.so.1'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='zlibng_version' version='ZLIB_NG_2.1.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zng_adler32' version='ZLIB_NG_2.0.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zng_adler32_combine' version='ZLIB_NG_2.0.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zng_adler32_z' version='ZLIB_NG_2.0.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zng_compress2' version='ZLIB_NG_2.0.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zng_compress' version='ZLIB_NG_2.0.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='zng_inflateInit_' version='ZLIB_NG_2.0.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zng_inflateMark' version='ZLIB_NG_2.0.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zng_inflatePrime' version='ZLIB_NG_2.0.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zng_inflateReset2' version='ZLIB_NG_2.0.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zng_inflateReset' version='ZLIB_NG_2.0.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zng_inflateResetKeep' version='ZLIB_NG_2.0.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zng_inflateSetDictionary' version='ZLIB_NG_2.0.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zng_inflateSync' version='ZLIB_NG_2.0.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zng_inflateSyncPoint' version='ZLIB_NG_2.0.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zng_inflateUndermine' version='ZLIB_NG_2.0.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zng_inflateValidate' version='ZLIB_NG_2.0.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zng_uncompress2' version='ZLIB_NG_2.0.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zng_uncompress' version='ZLIB_NG_2.0.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zng_zError' version='ZLIB_NG_2.0.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zng_zlibCompileFlags' version='ZLIB_NG_2.0.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <elf-variable-symbols>
    <elf-symbol name='zng_vstring' size='38' version='ZLIB_NG_2.0.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr address-size='32' path='/mnt/c/build/git/zlib-ng/btmp1/src.d/adler32.c' comp-dir-path='/mnt/c/build/git/zlib-ng/btmp1' language='LANG_C99'>
    <type-decl name='long long int' size-in-bits='64' id='type-id-1'/>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-2'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-3'/>
    <typedef-decl name='uint32_t' type-id='type-id-4' filepath='/usr/mips-linux-gnu/include/bits/stdint-uintn.h' line='26' column='1' id='type-id-5'/>
    <typedef-decl name='__uint32_t' type-id='type-id-3' filepath='/usr/mips-linux-gnu/include/bits/types.h' line='42' column='1' id='type-id-4'/>
    <typedef-decl name='__int64_t' type-id='type-id-1' filepath='/usr/mips-linux-gnu/include/bits/types.h' line='47' column='1' id='type-id-6'/>
    <typedef-decl name='__off64_t' type-id='type-id-6' filepath='/usr/mips-linux-gnu/include/bits/types.h' line='153' column='1' id='type-id-7'/>
    <typedef-decl name='off64_t' type-id='type-id-7' filepath='/usr/mips-linux-gnu/include/sys/types.h' line='92' column='1' id='type-id-8'/>
    <qualified-type-def type-id='type-id-2' const='yes' id='type-id-9'/>
    <pointer-type-def type-id='type-id-9' size-in-bits='32' id='type-id-10'/>
    <function-decl name='zng_adler32' mangled-name='zng_adler32' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/adler32.c' line='72' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='zng_adler32@@ZLIB_NG_2.0.0'>
      <parameter type-id='type-id-5' name='adler' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/adler32.c' line='72' column='1'/>
      <parameter type-id='type-id-10' name='buf' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/adler32.c' line='72' column='1'/>
      <parameter type-id='type-id-5' name='len' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/adler32.c' line='72' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='zng_adler32_combine' mangled-name='zng_adler32_combine' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/adler32.c' line='112' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='zng_adler32_combine@@ZLIB_NG_2.0.0'>
      <parameter type-id='type-id-5' name='adler1' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/adler32.c' line='112' column='1'/>
      <parameter type-id='type-id-5' name='adler2' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/adler32.c' line='112' column='1'/>
      <parameter type-id='type-id-8' name='len2' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/adler32.c' line='112' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='32' path='/mnt/c/build/git/zlib-ng/btmp1/src.d/compress.c' comp-dir-path='/mnt/c/build/git/zlib-ng/btmp1' language='LANG_C99'>
    <type-decl name='int' size-in-bits='32' id='type-id-11'/>
    <typedef-decl name='size_t' type-id='type-id-3' filepath='/usr/lib/gcc-cross/mips-linux-gnu/10/include/stddef.h' line='209' column='1' id='type-id-12'/>
    <pointer-type-def type-id='type-id-12' size-in-bits='32' id='type-id-13'/>
    <pointer-type-def type-id='type-id-2' size-in-bits='32' id='type-id-14'/>
    <function-decl name='zng_compress2' mangled-name='zng_compress2' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/compress.c' line='31' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='zng_compress2@@ZLIB_NG_2.0.0'>
      <parameter type-id='type-id-14' name='dest' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/compress.c' line='31' column='1'/>
      <parameter type-id='type-id-13' name='destLen' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/compress.c' line='31' column='1'/>
      <parameter type-id='type-id-10' name='source' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/compress.c' line='31' column='1'/>
      <parameter type-id='type-id-12' name='sourceLen' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/compress.c' line='32' column='1'/>
      <parameter type-id='type-id-11' name='level' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/compress.c' line='32' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='zng_compress' mangled-name='zng_compress' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/compress.c' line='73' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='zng_compress@@ZLIB_NG_2.0.0'>
      <parameter type-id='type-id-14' name='dest' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/compress.c' line='73' column='1'/>
      <parameter type-id='type-id-13' name='destLen' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/compress.c' line='73' column='1'/>
      <parameter type-id='type-id-10' name='source' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/compress.c' line='73' column='1'/>
      <parameter type-id='type-id-12' name='sourceLen' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/compress.c' line='73' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='zng_compressBound' mangled-name='zng_compressBound' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/compress.c' line='81' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='zng_compressBound@@ZLIB_NG_2.0.0'>
      <parameter type-id='type-id-12' name='sourceLen' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/compress.c' line='81' column='1'/>
      <return type-id='type-id-12'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='32' path='/mnt/c/build/git/zlib-ng/btmp1/src.d/crc32_braid.c' comp-dir-path='/mnt/c/build/git/zlib-ng/btmp1' language='LANG_C99'>
    <qualified-type-def type-id='type-id-5' const='yes' id='type-id-15'/>
    <pointer-type-def type-id='type-id-15' size-in-bits='32' id='type-id-16'/>
    <function-decl name='zng_get_crc_table' mangled-name='zng_get_crc_table' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/crc32_braid.c' line='18' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='zng_get_crc_table@@ZLIB_NG_2.0.0'>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='zng_crc32' mangled-name='zng_crc32' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/crc32_braid.c' line='41' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='zng_crc32@@ZLIB_NG_2.0.0'>
      <parameter type-id='type-id-5' name='crc' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/crc32_braid.c' line='41' column='1'/>
      <parameter type-id='type-id-10' name='buf' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/crc32_braid.c' line='41' column='1'/>
      <parameter type-id='type-id-5' name='len' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/crc32_braid.c' line='41' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='32' path='/mnt/c/build/git/zlib-ng/btmp1/src.d/crc32_braid_comb.c' comp-dir-path='/mnt/c/build/git/zlib-ng/btmp1' language='LANG_C99'>
    <function-decl name='zng_crc32_combine' mangled-name='zng_crc32_combine' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/crc32_braid_comb.c' line='46' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='zng_crc32_combine@@ZLIB_NG_2.0.0'>
      <parameter type-id='type-id-5' name='crc1' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/crc32_braid_comb.c' line='46' column='1'/>
      <parameter type-id='type-id-5' name='crc2' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/crc32_braid_comb.c' line='46' column='1'/>
      <parameter type-id='type-id-8' name='len2' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/crc32_braid_comb.c' line='46' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='zng_crc32_combine_gen' mangled-name='zng_crc32_combine_gen' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/crc32_braid_comb.c' line='49' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='zng_crc32_combine_gen@@ZLIB_NG_2.0.0'>
      <parameter type-id='type-id-8' name='len2' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/crc32_braid_comb.c' line='49' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='zng_crc32_combine_op' mangled-name='zng_crc32_combine_op' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/crc32_braid_comb.c' line='52' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='zng_crc32_combine_op@@ZLIB_NG_2.0.0'>
      <parameter type-id='type-id-5' name='crc1' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/crc32_braid_comb.c' line='52' column='1'/>
      <parameter type-id='type-id-5' name='crc2' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/crc32_braid_comb.c' line='52' column='1'/>
      <parameter type-id='type-id-15' name='op' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/crc32_braid_comb.c' line='52' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='32' path='/mnt/c/build/git/zlib-ng/btmp1/src.d/crc32_fold.c' comp-dir-path='/mnt/c/build/git/zlib-ng/btmp1' language='LANG_C99'>
    <type-decl name='void' id='type-id-17'/>
  </abi-instr>
  <abi-instr address-size='32' path='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.c' comp-dir-path='/mnt/c/build/git/zlib-ng/btmp1' language='LANG_C99'>
    <type-decl name='char' size-in-bits='8' id='type-id-18'/>
    <class-decl name='static_tree_desc_s' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-19'/>
    <array-type-def dimensions='1' type-id='type-id-20' size-in-bits='1248' id='type-id-21'>
      <subrange length='39' type-id='type-id-3' id='type-id-22'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-20' size-in-bits='18336' id='type-id-23'>
      <subrange length='573' type-id='type-id-3' id='type-id-24'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-20' size-in-bits='1952' id='type-id-25'>
      <subrange length='61' type-id='type-id-3' id='type-id-26'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-27' size-in-bits='352' id='type-id-28'>
      <subrange length='11' type-id='type-id-3' id='type-id-29'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-11' size-in-bits='18336' id='type-id-30'>
      <subrange length='573' type-id='type-id-3' id='type-id-24'/>
    </array-type-def>
    <type-decl name='long long unsigned int' size-in-bits='64' id='type-id-31'/>
    <array-type-def dimensions='1' type-id='type-id-32' size-in-bits='256' id='type-id-33'>
      <subrange length='16' type-id='type-id-3' id='type-id-34'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-35' size-in-bits='512' id='type-id-36'>
      <subrange length='64' type-id='type-id-3' id='type-id-37'/>
    </array-type-def>
    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-38'/>
    <array-type-def dimensions='1' type-id='type-id-2' size-in-bits='4584' id='type-id-39'>
      <subrange length='573' type-id='type-id-3' id='type-id-24'/>
    </array-type-def>
    <type-decl name='unsigned long int' size-in-bits='32' id='type-id-40'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-41'/>
    <typedef-decl name='zng_stream' type-id='type-id-42' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/cpu_features.h' line='100' column='1' id='type-id-43'/>
    <class-decl name='crc32_fold_s' size-in-bits='544' is-struct='yes' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/crc32_fold.h' line='11' column='1' id='type-id-44'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fold' type-id='type-id-36' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/crc32_fold.h' line='12' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='value' type-id='type-id-5' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/crc32_fold.h' line='13' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ct_data_s' size-in-bits='32' is-struct='yes' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.h' line='77' column='1' id='type-id-20'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fc' type-id='type-id-45' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='dl' type-id='type-id-46' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.h' line='85' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__' size-in-bits='16' is-anonymous='yes' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.h' line='78' column='1' id='type-id-45'>
      <data-member access='public'>
        <var-decl name='freq' type-id='type-id-32' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.h' line='79' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='code' type-id='type-id-32' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.h' line='80' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__1' size-in-bits='16' is-anonymous='yes' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.h' line='82' column='1' id='type-id-46'>
      <data-member access='public'>
        <var-decl name='dad' type-id='type-id-32' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.h' line='83' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='len' type-id='type-id-32' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.h' line='84' column='1'/>
      </data-member>
    </union-decl>
    <typedef-decl name='ct_data' type-id='type-id-20' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.h' line='86' column='1' id='type-id-47'/>
    <typedef-decl name='static_tree_desc' type-id='type-id-19' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.h' line='93' column='1' id='type-id-48'/>
    <class-decl name='tree_desc_s' size-in-bits='96' is-struct='yes' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.h' line='95' column='1' id='type-id-49'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dyn_tree' type-id='type-id-50' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='max_code' type-id='type-id-11' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.h' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='stat_desc' type-id='type-id-51' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.h' line='98' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='Pos' type-id='type-id-32' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.h' line='101' column='1' id='type-id-52'/>
    <typedef-decl name='deflate_state' type-id='type-id-53' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.h' line='107' column='1' id='type-id-54'/>
    <typedef-decl name='update_hash_cb' type-id='type-id-55' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.h' line='109' column='1' id='type-id-56'/>
    <typedef-decl name='insert_string_cb' type-id='type-id-57' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.h' line='110' column='1' id='type-id-58'/>
    <typedef-decl name='quick_insert_string_cb' type-id='type-id-59' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.h' line='111' column='1' id='type-id-60'/>
    <class-decl name='internal_state' size-in-bits='47744' is-struct='yes' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.h' line='113' column='1' id='type-id-53'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='strm' type-id='type-id-61' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.h' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pending_buf' type-id='type-id-14' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.h' line='115' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='pending_out' type-id='type-id-14' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.h' line='116' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='pending_buf_size' type-id='type-id-5' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.h' line='117' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='pending' type-id='type-id-5' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.h' line='118' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='wrap' type-id='type-id-11' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.h' line='119' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='gzindex' type-id='type-id-5' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.h' line='120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='gzhead' type-id='type-id-62' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.h' line='121' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='status' type-id='type-id-11' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.h' line='122' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='last_flush' type-id='type-id-11' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.h' line='123' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='reproducible' type-id='type-id-11' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.h' line='124' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='block_open' type-id='type-id-11' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.h' line='126' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='w_size' type-id='type-id-3' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.h' line='133' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='w_bits' type-id='type-id-3' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.h' line='134' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='w_mask' type-id='type-id-3' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.h' line='135' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='lookahead' type-id='type-id-3' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.h' line='136' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='high_water' type-id='type-id-3' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.h' line='138' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='window_size' type-id='type-id-3' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.h' line='145' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='window' type-id='type-id-14' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.h' line='150' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <var-decl name='prev' type-id='type-id-63' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.h' line='160' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='head' type-id='type-id-63' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.h' line='166' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='ins_h' type-id='type-id-5' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.h' line='168' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='block_start' type-id='type-id-11' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.h' line='170' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='736'>
        <var-decl name='match_length' type-id='type-id-3' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.h' line='175' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='prev_match' type-id='type-id-52' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.h' line='176' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='800'>
        <var-decl name='match_available' type-id='type-id-11' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.h' line='177' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='strstart' type-id='type-id-3' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.h' line='178' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='864'>
        <var-decl name='match_start' type-id='type-id-3' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.h' line='179' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='prev_length' type-id='type-id-3' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.h' line='181' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='max_chain_length' type-id='type-id-3' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.h' line='186' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='max_lazy_match' type-id='type-id-3' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.h' line='191' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='992'>
        <var-decl name='update_hash' type-id='type-id-56' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.h' line='201' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='insert_string' type-id='type-id-58' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.h' line='202' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1056'>
        <var-decl name='quick_insert_string' type-id='type-id-60' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.h' line='203' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='level' type-id='type-id-11' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.h' line='207' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1120'>
        <var-decl name='strategy' type-id='type-id-11' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.h' line='208' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='good_match' type-id='type-id-3' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.h' line='210' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1184'>
        <var-decl name='nice_match' type-id='type-id-11' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.h' line='213' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='crc_fold' type-id='type-id-44' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.h' line='215' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1824'>
        <var-decl name='dyn_ltree' type-id='type-id-23' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.h' line='219' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='20160'>
        <var-decl name='dyn_dtree' type-id='type-id-25' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.h' line='220' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='22112'>
        <var-decl name='bl_tree' type-id='type-id-21' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.h' line='221' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='23360'>
        <var-decl name='l_desc' type-id='type-id-49' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.h' line='223' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='23456'>
        <var-decl name='d_desc' type-id='type-id-49' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.h' line='224' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='23552'>
        <var-decl name='bl_desc' type-id='type-id-49' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.h' line='225' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='23648'>
        <var-decl name='bl_count' type-id='type-id-33' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.h' line='227' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='23904'>
        <var-decl name='heap' type-id='type-id-30' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.h' line='230' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='42240'>
        <var-decl name='heap_len' type-id='type-id-11' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.h' line='231' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='42272'>
        <var-decl name='heap_max' type-id='type-id-11' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.h' line='232' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='42304'>
        <var-decl name='depth' type-id='type-id-39' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.h' line='237' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='46912'>
        <var-decl name='lit_bufsize' type-id='type-id-3' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.h' line='241' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='46944'>
        <var-decl name='sym_buf' type-id='type-id-14' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.h' line='261' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='46976'>
        <var-decl name='sym_next' type-id='type-id-3' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.h' line='262' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='47008'>
        <var-decl name='sym_end' type-id='type-id-3' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.h' line='263' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='47040'>
        <var-decl name='opt_len' type-id='type-id-40' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.h' line='265' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='47072'>
        <var-decl name='static_len' type-id='type-id-40' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.h' line='266' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='47104'>
        <var-decl name='matches' type-id='type-id-3' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.h' line='267' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='47136'>
        <var-decl name='insert' type-id='type-id-3' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.h' line='268' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='47168'>
        <var-decl name='compressed_len' type-id='type-id-40' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.h' line='271' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='47200'>
        <var-decl name='bits_sent' type-id='type-id-40' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.h' line='272' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='47232'>
        <var-decl name='reserved_p' type-id='type-id-64' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.h' line='275' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='47296'>
        <var-decl name='bi_buf' type-id='type-id-65' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.h' line='277' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='47360'>
        <var-decl name='bi_valid' type-id='type-id-27' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.h' line='280' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='47392'>
        <var-decl name='reserved' type-id='type-id-28' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.h' line='284' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='alloc_func' type-id='type-id-66' filepath='/mnt/c/build/git/zlib-ng/btmp1/zlib-ng.h' line='93' column='1' id='type-id-67'/>
    <typedef-decl name='free_func' type-id='type-id-68' filepath='/mnt/c/build/git/zlib-ng/btmp1/zlib-ng.h' line='94' column='1' id='type-id-69'/>
    <class-decl name='zng_stream_s' size-in-bits='448' is-struct='yes' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/zlib-ng.h' line='98' column='1' id='type-id-42'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next_in' type-id='type-id-70' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/zlib-ng.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='avail_in' type-id='type-id-5' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/zlib-ng.h' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='total_in' type-id='type-id-12' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/zlib-ng.h' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='next_out' type-id='type-id-71' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/zlib-ng.h' line='103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='avail_out' type-id='type-id-5' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/zlib-ng.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='total_out' type-id='type-id-12' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/zlib-ng.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='msg' type-id='type-id-72' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/zlib-ng.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='state' type-id='type-id-73' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/zlib-ng.h' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='zalloc' type-id='type-id-67' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/zlib-ng.h' line='110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='zfree' type-id='type-id-69' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/zlib-ng.h' line='111' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='opaque' type-id='type-id-74' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/zlib-ng.h' line='112' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='data_type' type-id='type-id-11' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/zlib-ng.h' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='adler' type-id='type-id-5' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/zlib-ng.h' line='116' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='reserved' type-id='type-id-40' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/zlib-ng.h' line='117' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='zng_gz_header_s' size-in-bits='416' is-struct='yes' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/zlib-ng.h' line='126' column='1' id='type-id-75'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='text' type-id='type-id-27' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/zlib-ng.h' line='127' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='time' type-id='type-id-40' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/zlib-ng.h' line='128' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='xflags' type-id='type-id-27' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/zlib-ng.h' line='129' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='os' type-id='type-id-27' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/zlib-ng.h' line='130' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='extra' type-id='type-id-71' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/zlib-ng.h' line='131' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='extra_len' type-id='type-id-5' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/zlib-ng.h' line='132' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='extra_max' type-id='type-id-5' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/zlib-ng.h' line='133' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='name' type-id='type-id-71' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/zlib-ng.h' line='134' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='name_max' type-id='type-id-5' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/zlib-ng.h' line='135' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='comment' type-id='type-id-71' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/zlib-ng.h' line='136' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='comm_max' type-id='type-id-5' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/zlib-ng.h' line='137' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='hcrc' type-id='type-id-27' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/zlib-ng.h' line='138' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='done' type-id='type-id-27' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/zlib-ng.h' line='139' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zng_gz_header' type-id='type-id-75' filepath='/mnt/c/build/git/zlib-ng/btmp1/zlib-ng.h' line='140' column='1' id='type-id-76'/>
    <typedef-decl name='zng_gz_headerp' type-id='type-id-77' filepath='/mnt/c/build/git/zlib-ng/btmp1/zlib-ng.h' line='142' column='1' id='type-id-62'/>
    <enum-decl name='zng_deflate_param' naming-typedef-id='type-id-78' filepath='/mnt/c/build/git/zlib-ng/btmp1/zlib-ng.h' line='1800' column='1' id='type-id-79'>
      <underlying-type type-id='type-id-38'/>
      <enumerator name='Z_DEFLATE_LEVEL' value='0'/>
      <enumerator name='Z_DEFLATE_STRATEGY' value='1'/>
      <enumerator name='Z_DEFLATE_REPRODUCIBLE' value='2'/>
    </enum-decl>
    <typedef-decl name='zng_deflate_param' type-id='type-id-79' filepath='/mnt/c/build/git/zlib-ng/btmp1/zlib-ng.h' line='1810' column='1' id='type-id-78'/>
    <class-decl name='zng_deflate_param_value' size-in-bits='128' is-struct='yes' naming-typedef-id='type-id-80' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/zlib-ng.h' line='1812' column='1' id='type-id-81'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='param' type-id='type-id-78' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/zlib-ng.h' line='1813' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='buf' type-id='type-id-74' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/zlib-ng.h' line='1814' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='size' type-id='type-id-12' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/zlib-ng.h' line='1815' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='status' type-id='type-id-27' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/zlib-ng.h' line='1816' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zng_deflate_param_value' type-id='type-id-81' filepath='/mnt/c/build/git/zlib-ng/btmp1/zlib-ng.h' line='1817' column='1' id='type-id-80'/>
    <typedef-decl name='int32_t' type-id='type-id-82' filepath='/usr/mips-linux-gnu/include/bits/stdint-intn.h' line='26' column='1' id='type-id-27'/>
    <typedef-decl name='uint8_t' type-id='type-id-83' filepath='/usr/mips-linux-gnu/include/bits/stdint-uintn.h' line='24' column='1' id='type-id-35'/>
    <typedef-decl name='uint16_t' type-id='type-id-84' filepath='/usr/mips-linux-gnu/include/bits/stdint-uintn.h' line='25' column='1' id='type-id-32'/>
    <typedef-decl name='uint64_t' type-id='type-id-85' filepath='/usr/mips-linux-gnu/include/bits/stdint-uintn.h' line='27' column='1' id='type-id-65'/>
    <typedef-decl name='__uint8_t' type-id='type-id-2' filepath='/usr/mips-linux-gnu/include/bits/types.h' line='38' column='1' id='type-id-83'/>
    <typedef-decl name='__uint16_t' type-id='type-id-41' filepath='/usr/mips-linux-gnu/include/bits/types.h' line='40' column='1' id='type-id-84'/>
    <typedef-decl name='__int32_t' type-id='type-id-11' filepath='/usr/mips-linux-gnu/include/bits/types.h' line='41' column='1' id='type-id-82'/>
    <typedef-decl name='__uint64_t' type-id='type-id-31' filepath='/usr/mips-linux-gnu/include/bits/types.h' line='48' column='1' id='type-id-85'/>
    <pointer-type-def type-id='type-id-52' size-in-bits='32' id='type-id-63'/>
    <pointer-type-def type-id='type-id-18' size-in-bits='32' id='type-id-64'/>
    <qualified-type-def type-id='type-id-18' const='yes' id='type-id-86'/>
    <pointer-type-def type-id='type-id-86' size-in-bits='32' id='type-id-72'/>
    <qualified-type-def type-id='type-id-48' const='yes' id='type-id-87'/>
    <pointer-type-def type-id='type-id-87' size-in-bits='32' id='type-id-51'/>
    <qualified-type-def type-id='type-id-35' const='yes' id='type-id-88'/>
    <pointer-type-def type-id='type-id-88' size-in-bits='32' id='type-id-70'/>
    <pointer-type-def type-id='type-id-47' size-in-bits='32' id='type-id-50'/>
    <pointer-type-def type-id='type-id-54' size-in-bits='32' id='type-id-89'/>
    <qualified-type-def type-id='type-id-89' const='yes' id='type-id-90'/>
    <pointer-type-def type-id='type-id-27' size-in-bits='32' id='type-id-91'/>
    <pointer-type-def type-id='type-id-53' size-in-bits='32' id='type-id-73'/>
    <pointer-type-def type-id='type-id-92' size-in-bits='32' id='type-id-59'/>
    <pointer-type-def type-id='type-id-93' size-in-bits='32' id='type-id-55'/>
    <pointer-type-def type-id='type-id-5' size-in-bits='32' id='type-id-94'/>
    <pointer-type-def type-id='type-id-35' size-in-bits='32' id='type-id-71'/>
    <pointer-type-def type-id='type-id-95' size-in-bits='32' id='type-id-57'/>
    <pointer-type-def type-id='type-id-96' size-in-bits='32' id='type-id-68'/>
    <pointer-type-def type-id='type-id-17' size-in-bits='32' id='type-id-74'/>
    <pointer-type-def type-id='type-id-97' size-in-bits='32' id='type-id-66'/>
    <pointer-type-def type-id='type-id-80' size-in-bits='32' id='type-id-98'/>
    <pointer-type-def type-id='type-id-76' size-in-bits='32' id='type-id-77'/>
    <pointer-type-def type-id='type-id-43' size-in-bits='32' id='type-id-61'/>
    <class-decl name='static_tree_desc_s' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-19'/>
    <function-decl name='zng_deflateInit2' mangled-name='zng_deflateInit2' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.c' line='191' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='zng_deflateInit2@@ZLIB_NG_2.1.0'>
      <parameter type-id='type-id-61' name='strm' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.c' line='191' column='1'/>
      <parameter type-id='type-id-27' name='level' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.c' line='191' column='1'/>
      <parameter type-id='type-id-27' name='method' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.c' line='191' column='1'/>
      <parameter type-id='type-id-27' name='windowBits' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.c' line='191' column='1'/>
      <parameter type-id='type-id-27' name='memLevel' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.c' line='192' column='1'/>
      <parameter type-id='type-id-27' name='strategy' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.c' line='192' column='1'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='zng_deflateInit' mangled-name='zng_deflateInit' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.c' line='323' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='zng_deflateInit@@ZLIB_NG_2.1.0'>
      <parameter type-id='type-id-61' name='strm' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.c' line='323' column='1'/>
      <parameter type-id='type-id-27' name='level' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.c' line='323' column='1'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='zng_deflateInit_' mangled-name='zng_deflateInit_' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.c' line='329' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='zng_deflateInit_@@ZLIB_NG_2.0.0'>
      <parameter type-id='type-id-61' name='strm' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.c' line='329' column='1'/>
      <parameter type-id='type-id-27' name='level' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.c' line='329' column='1'/>
      <parameter type-id='type-id-72' name='version' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.c' line='329' column='1'/>
      <parameter type-id='type-id-27' name='stream_size' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.c' line='329' column='1'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='zng_deflateInit2_' mangled-name='zng_deflateInit2_' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.c' line='336' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='zng_deflateInit2_@@ZLIB_NG_2.0.0'>
      <parameter type-id='type-id-61' name='strm' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.c' line='336' column='1'/>
      <parameter type-id='type-id-27' name='level' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.c' line='336' column='1'/>
      <parameter type-id='type-id-27' name='method' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.c' line='336' column='1'/>
      <parameter type-id='type-id-27' name='windowBits' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.c' line='336' column='1'/>
      <parameter type-id='type-id-27' name='memLevel' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.c' line='337' column='1'/>
      <parameter type-id='type-id-27' name='strategy' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.c' line='337' column='1'/>
      <parameter type-id='type-id-72' name='version' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.c' line='337' column='1'/>
      <parameter type-id='type-id-27' name='stream_size' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.c' line='337' column='1'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='zng_deflateSetDictionary' mangled-name='zng_deflateSetDictionary' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.c' line='366' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='zng_deflateSetDictionary@@ZLIB_NG_2.0.0'>
      <parameter type-id='type-id-61' name='strm' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.c' line='366' column='1'/>
      <parameter type-id='type-id-70' name='dictionary' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.c' line='366' column='1'/>
      <parameter type-id='type-id-5' name='dictLength' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.c' line='366' column='1'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='zng_deflateGetDictionary' mangled-name='zng_deflateGetDictionary' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.c' line='425' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='zng_deflateGetDictionary@@ZLIB_NG_2.0.0'>
      <parameter type-id='type-id-61' name='strm' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.c' line='425' column='1'/>
      <parameter type-id='type-id-71' name='dictionary' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.c' line='425' column='1'/>
      <parameter type-id='type-id-94' name='dictLength' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.c' line='425' column='1'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='zng_deflateResetKeep' mangled-name='zng_deflateResetKeep' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.c' line='444' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='zng_deflateResetKeep@@ZLIB_NG_2.0.0'>
      <parameter type-id='type-id-61' name='strm' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.c' line='444' column='1'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='zng_deflateReset' mangled-name='zng_deflateReset' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.c' line='483' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='zng_deflateReset@@ZLIB_NG_2.0.0'>
      <parameter type-id='type-id-61' name='strm' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.c' line='483' column='1'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='zng_deflateSetHeader' mangled-name='zng_deflateSetHeader' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.c' line='493' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='zng_deflateSetHeader@@ZLIB_NG_2.0.0'>
      <parameter type-id='type-id-61' name='strm' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.c' line='493' column='1'/>
      <parameter type-id='type-id-62' name='head' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.c' line='493' column='1'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='zng_deflatePending' mangled-name='zng_deflatePending' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.c' line='501' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='zng_deflatePending@@ZLIB_NG_2.0.0'>
      <parameter type-id='type-id-61' name='strm' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.c' line='501' column='1'/>
      <parameter type-id='type-id-94' name='pending' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.c' line='501' column='1'/>
      <parameter type-id='type-id-91' name='bits' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.c' line='501' column='1'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='zng_deflatePrime' mangled-name='zng_deflatePrime' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.c' line='512' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='zng_deflatePrime@@ZLIB_NG_2.0.0'>
      <parameter type-id='type-id-61' name='strm' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.c' line='512' column='1'/>
      <parameter type-id='type-id-27' name='bits' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.c' line='512' column='1'/>
      <parameter type-id='type-id-27' name='value' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.c' line='512' column='1'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='zng_deflateParams' mangled-name='zng_deflateParams' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.c' line='540' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='zng_deflateParams@@ZLIB_NG_2.0.0'>
      <parameter type-id='type-id-61' name='strm' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.c' line='540' column='1'/>
      <parameter type-id='type-id-27' name='level' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.c' line='540' column='1'/>
      <parameter type-id='type-id-27' name='strategy' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.c' line='540' column='1'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='zng_deflateTune' mangled-name='zng_deflateTune' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.c' line='583' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='zng_deflateTune@@ZLIB_NG_2.0.0'>
      <parameter type-id='type-id-61' name='strm' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.c' line='583' column='1'/>
      <parameter type-id='type-id-27' name='good_length' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.c' line='583' column='1'/>
      <parameter type-id='type-id-27' name='max_lazy' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.c' line='583' column='1'/>
      <parameter type-id='type-id-27' name='nice_length' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.c' line='583' column='1'/>
      <parameter type-id='type-id-27' name='max_chain' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.c' line='583' column='1'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='zng_deflateBound' mangled-name='zng_deflateBound' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.c' line='613' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='zng_deflateBound@@ZLIB_NG_2.0.0'>
      <parameter type-id='type-id-61' name='strm' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.c' line='613' column='1'/>
      <parameter type-id='type-id-40' name='sourceLen' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.c' line='613' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='zng_deflate' mangled-name='zng_deflate' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.c' line='725' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='zng_deflate@@ZLIB_NG_2.0.0'>
      <parameter type-id='type-id-61' name='strm' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.c' line='725' column='1'/>
      <parameter type-id='type-id-27' name='flush' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.c' line='725' column='1'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='zng_deflateEnd' mangled-name='zng_deflateEnd' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.c' line='1022' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='zng_deflateEnd@@ZLIB_NG_2.0.0'>
      <parameter type-id='type-id-61' name='strm' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.c' line='1022' column='1'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='zng_deflateCopy' mangled-name='zng_deflateCopy' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.c' line='1045' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='zng_deflateCopy@@ZLIB_NG_2.0.0'>
      <parameter type-id='type-id-61' name='dest' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.c' line='1045' column='1'/>
      <parameter type-id='type-id-61' name='source' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.c' line='1045' column='1'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='zng_deflateSetParams' mangled-name='zng_deflateSetParams' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.c' line='1309' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='zng_deflateSetParams@@ZLIB_NG_2.0.0'>
      <parameter type-id='type-id-61' name='strm' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.c' line='1309' column='1'/>
      <parameter type-id='type-id-98' name='params' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.c' line='1309' column='1'/>
      <parameter type-id='type-id-12' name='count' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.c' line='1309' column='1'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='zng_deflateGetParams' mangled-name='zng_deflateGetParams' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.c' line='1385' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='zng_deflateGetParams@@ZLIB_NG_2.0.0'>
      <parameter type-id='type-id-61' name='strm' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.c' line='1385' column='1'/>
      <parameter type-id='type-id-98' name='params' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.c' line='1385' column='1'/>
      <parameter type-id='type-id-12' name='count' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/deflate.c' line='1385' column='1'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-type size-in-bits='32' id='type-id-92'>
      <parameter type-id='type-id-90'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-52'/>
    </function-type>
    <function-type size-in-bits='32' id='type-id-93'>
      <parameter type-id='type-id-90'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='32' id='type-id-95'>
      <parameter type-id='type-id-90'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-17'/>
    </function-type>
    <function-type size-in-bits='32' id='type-id-96'>
      <parameter type-id='type-id-74'/>
      <parameter type-id='type-id-74'/>
      <return type-id='type-id-17'/>
    </function-type>
    <function-type size-in-bits='32' id='type-id-97'>
      <parameter type-id='type-id-74'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-74'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='32' path='/mnt/c/build/git/zlib-ng/btmp1/src.d/functable.c' comp-dir-path='/mnt/c/build/git/zlib-ng/btmp1' language='LANG_C99'>
    <class-decl name='functable_s' size-in-bits='544' is-struct='yes' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/functable.h' line='19' column='1' id='type-id-99'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='adler32' type-id='type-id-100' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/functable.h' line='20' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='adler32_fold_copy' type-id='type-id-101' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/functable.h' line='21' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='crc32' type-id='type-id-100' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/functable.h' line='22' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='crc32_fold_reset' type-id='type-id-102' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/functable.h' line='23' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='crc32_fold_copy' type-id='type-id-103' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/functable.h' line='24' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='crc32_fold' type-id='type-id-104' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/functable.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='crc32_fold_final' type-id='type-id-102' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/functable.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='compare256' type-id='type-id-105' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/functable.h' line='27' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='chunksize' type-id='type-id-106' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/functable.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='chunkmemset_safe' type-id='type-id-107' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/functable.h' line='29' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='inflate_fast' type-id='type-id-108' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/functable.h' line='30' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='insert_string' type-id='type-id-57' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/functable.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='longest_match' type-id='type-id-109' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/functable.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='longest_match_slow' type-id='type-id-109' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/functable.h' line='33' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='quick_insert_string' type-id='type-id-59' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/functable.h' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='slide_hash' type-id='type-id-110' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/functable.h' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='update_hash' type-id='type-id-55' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/functable.h' line='36' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-44' size-in-bits='32' id='type-id-111'/>
    <pointer-type-def type-id='type-id-112' size-in-bits='32' id='type-id-106'/>
    <pointer-type-def type-id='type-id-113' size-in-bits='32' id='type-id-105'/>
    <pointer-type-def type-id='type-id-114' size-in-bits='32' id='type-id-102'/>
    <pointer-type-def type-id='type-id-115' size-in-bits='32' id='type-id-109'/>
    <pointer-type-def type-id='type-id-116' size-in-bits='32' id='type-id-100'/>
    <pointer-type-def type-id='type-id-117' size-in-bits='32' id='type-id-101'/>
    <pointer-type-def type-id='type-id-118' size-in-bits='32' id='type-id-107'/>
    <pointer-type-def type-id='type-id-119' size-in-bits='32' id='type-id-104'/>
    <pointer-type-def type-id='type-id-120' size-in-bits='32' id='type-id-103'/>
    <pointer-type-def type-id='type-id-121' size-in-bits='32' id='type-id-110'/>
    <pointer-type-def type-id='type-id-122' size-in-bits='32' id='type-id-108'/>
    <var-decl name='functable' type-id='type-id-99' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/functable.h' line='39' column='1'/>
    <function-type size-in-bits='32' id='type-id-112'>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='32' id='type-id-113'>
      <parameter type-id='type-id-70'/>
      <parameter type-id='type-id-70'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='32' id='type-id-114'>
      <parameter type-id='type-id-111'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='32' id='type-id-115'>
      <parameter type-id='type-id-90'/>
      <parameter type-id='type-id-52'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='32' id='type-id-116'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-70'/>
      <parameter type-id='type-id-12'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='32' id='type-id-117'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-71'/>
      <parameter type-id='type-id-70'/>
      <parameter type-id='type-id-12'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='32' id='type-id-118'>
      <parameter type-id='type-id-71'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-71'/>
    </function-type>
    <function-type size-in-bits='32' id='type-id-119'>
      <parameter type-id='type-id-111'/>
      <parameter type-id='type-id-70'/>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-17'/>
    </function-type>
    <function-type size-in-bits='32' id='type-id-120'>
      <parameter type-id='type-id-111'/>
      <parameter type-id='type-id-71'/>
      <parameter type-id='type-id-70'/>
      <parameter type-id='type-id-12'/>
      <return type-id='type-id-17'/>
    </function-type>
    <function-type size-in-bits='32' id='type-id-121'>
      <parameter type-id='type-id-89'/>
      <return type-id='type-id-17'/>
    </function-type>
    <function-type size-in-bits='32' id='type-id-122'>
      <parameter type-id='type-id-61'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-17'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='32' path='/mnt/c/build/git/zlib-ng/btmp1/src.d/gzlib.c' comp-dir-path='/mnt/c/build/git/zlib-ng/btmp1' language='LANG_C99'>
    <typedef-decl name='gzFile' type-id='type-id-123' filepath='/mnt/c/build/git/zlib-ng/btmp1/zlib-ng.h' line='1285' column='1' id='type-id-124'/>
    <class-decl name='gzFile_s' size-in-bits='128' is-struct='yes' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/zlib-ng.h' line='1790' column='1' id='type-id-125'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='have' type-id='type-id-3' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/zlib-ng.h' line='1791' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='next' type-id='type-id-14' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/zlib-ng.h' line='1792' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='pos' type-id='type-id-8' visibility='default' filepath='/mnt/c/build/git/zlib-ng/btmp1/zlib-ng.h' line='1793' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-125' size-in-bits='32' id='type-id-123'/>
    <pointer-type-def type-id='type-id-11' size-in-bits='32' id='type-id-126'/>
    <function-decl name='zng_gzopen' mangled-name='zng_gzopen' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/gzlib.c' line='215' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='zng_gzopen@@ZLIB_NG_GZ_2.0.0'>
      <parameter type-id='type-id-72' name='path' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/gzlib.c' line='215' column='1'/>
      <parameter type-id='type-id-72' name='mode' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/gzlib.c' line='215' column='1'/>
      <return type-id='type-id-124'/>
    </function-decl>
    <function-decl name='zng_gzdopen' mangled-name='zng_gzdopen' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/gzlib.c' line='226' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='zng_gzdopen@@ZLIB_NG_GZ_2.0.0'>
      <parameter type-id='type-id-11' name='fd' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/gzlib.c' line='226' column='1'/>
      <parameter type-id='type-id-72' name='mode' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/gzlib.c' line='226' column='1'/>
      <return type-id='type-id-124'/>
    </function-decl>
    <function-decl name='zng_gzclose' mangled-name='zng_gzclose' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/gzlib.c' line='245' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='zng_gzclose@@ZLIB_NG_GZ_2.0.0'>
      <parameter type-id='type-id-124' name='file' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/gzlib.c' line='245' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='zng_gzbuffer' mangled-name='zng_gzbuffer' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/gzlib.c' line='260' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='zng_gzbuffer@@ZLIB_NG_GZ_2.0.0'>
      <parameter type-id='type-id-124' name='file' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/gzlib.c' line='260' column='1'/>
      <parameter type-id='type-id-3' name='size' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/gzlib.c' line='260' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='zng_gzrewind' mangled-name='zng_gzrewind' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/gzlib.c' line='284' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='zng_gzrewind@@ZLIB_NG_GZ_2.0.0'>
      <parameter type-id='type-id-124' name='file' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/gzlib.c' line='284' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='zng_gzseek' mangled-name='zng_gzseek' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/gzlib.c' line='304' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='zng_gzseek@@ZLIB_NG_GZ_2.0.0'>
      <parameter type-id='type-id-124' name='file' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/gzlib.c' line='304' column='1'/>
      <parameter type-id='type-id-8' name='offset' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/gzlib.c' line='304' column='1'/>
      <parameter type-id='type-id-11' name='whence' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/gzlib.c' line='304' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zng_gztell' mangled-name='zng_gztell' filepath='/mnt/c/build/git/zlib-ng/btmp1/src.d/gzlib.c' line='385' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='zng_gztell@@ZLIB_NG_GZ_2.0.0'>
