Repository: dotnet/runtime
Catalog: src/tools/illink/src/linker/Resources/xlf/Strings.*.xlf
Languages: cs, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# IL2090
source: 'this' argument does not satisfy {3} in call to '{0}'. The generic parameter '{1}' of '{2}' does not have matching annotations. The source value must declare at least the same requirements as those declared on the target location it is assigned to.
cs: Argument this nevyhovuje {3} ve volání metody {0}. Obecný parametr {1} pro {2} nemá odpovídající poznámky. Zdrojová hodnota musí deklarovat alespoň stejné požadavky jako požadavky deklarované v cílovém umístění, ke které je přiřazena.
es: El argumento "this" no satisface {3} en la llamada a "{0}". El parámetro genérico "{1}" de "{2}" no tiene anotaciones coincidentes. El valor de origen debe declarar al menos los mismos requisitos que los declarados en la ubicación de destino a la que está asignado.
fr: L’argument 'this' ne respecte pas {3} dans l’appel à '{0}'. Le paramètre générique '{1}' de '{2}' n’a pas d’annotations correspondantes. La valeur source doit déclarer au moins les mêmes exigences que celles déclarées sur l’emplacement cible auquel elle est attribuée.
it: L'argomento 'this' non soddisfa {3} nella chiamata al '{0}'. Il parametro generico '{1}' di '{2}' non contiene annotazioni corrispondenti. Il valore di origine deve dichiarare almeno gli stessi requisiti dichiarati nel percorso di destinazione a cui è assegnato.
ja: 'this' 引数が '{0}' への呼び出しの {3} を満たしていません。'{2}' のジェネリック パラメーター '{1}' に一致する注釈がありません。ソース値は、割り当てられているターゲットの場所で宣言されているものと少なくとも同じ要件を宣言する必要があります。
ko: 'this' 인수가 '{0}'에 대한 호출에서 {3}을(를) 충족하지 않습니다. '{2}'의 제네릭 매개 변수 '{1}'에 일치하는 주석이 없습니다. 원본 값은 할당된 대상 위치에서 선언된 요구 사항과 최소한 동일한 요구 사항을 선언해야 합니다.
pl: Argument „this” nie spełnia wymagań {3} w wywołaniu „{0}”. Parametr ogólny „{1}” metody „{2}” nie ma pasujących adnotacji. Wartość źródłowa musi deklarować co najmniej te same wymagania, które zadeklarowano w lokalizacji docelowej, do której jest przypisana.
pt_br: O argumento ‘this’ não atende {3} em chamada para ‘{0}’. O parâmetro genérico ‘{1}’ de ‘{2}’ não tem anotações correspondentes. O valor da fonte deve declarar pelo menos os mesmos requisitos que os declarados no local de destino para o qual foi atribuído.
ru: Аргумент "this" не удовлетворяет {3} в вызове "{0}". Универсальный параметр "{1}" из "{2}" не имеет соответствующих аннотаций. Исходное значение должно объявлять по крайней мере те же требования, что и требования, объявленные в целевом расположении, которому оно назначено.
tr: 'this' bağımsız değişkeni, '{0}' çağrısında şunu karşılamıyor: {3}. '{2}' yönteminin '{1}' genel parametresinde eşleşen ek açıklamalar yok. Kaynak değerin, atandığı hedef konumda bildirilenlerle en az aynı gereksinimleri bildirmesi gerekir.
zh_hans: "this" 参数在调用 "{0}" 时不满足 {3}。"{2}" 的泛型参数 "{1}" 没有匹配的注释。源值必须声明至少与在分配到的目标位置上声明的要求相同的要求。
zh_hant: 'this' 引數在對 '{0}' 的呼叫中未滿足 {3}。'{2}' 的泛型參數 '{1}' 沒有相符的註釋。來源值必須至少宣告與其獲指派目標位置上所宣告相同的需求。

# IL2091
source: '{0}' generic argument does not satisfy {4} in '{1}'. The generic parameter '{2}' of '{3}' does not have matching annotations. The source value must declare at least the same requirements as those declared on the target location it is assigned to.
cs: Obecný argument {0} nevyhovuje {4} v: {1}. Obecný parametr {2} třídy {3} nemá odpovídající poznámky. Zdrojová hodnota musí deklarovat alespoň stejné požadavky jako požadavky deklarované v cílovém umístění, ke které je přiřazena.
es: El argumento genérico "{0}" no satisface {4} en "{1}". El parámetro genérico "{2}" de "{3}" no tiene anotaciones coincidentes. El valor de origen debe declarar al menos los mismos requisitos que los declarados en la ubicación de destino a la que está asignado.
fr: L’argument générique '{0}' ne respecte pas {4} dans '{1}'. Le paramètre générique '{2}' de '{3}' n’a pas d’annotations correspondantes. La valeur source doit déclarer au moins les mêmes exigences que celles déclarées sur l’emplacement cible auquel elle est attribuée.
it: L’argomento generico '{0}' non soddisfa {4} in '{1}'. Il parametro generico '{2}' di '{3}' non contiene annotazioni corrispondenti. Il valore di origine deve dichiarare almeno gli stessi requisiti dichiarati nel percorso di destinazione a cui è assegnato.
ja: '{0}' ジェネリック引数が '{1}' の {4} を満たしていません。'{3}' のジェネリック パラメーター '{2}' に一致する注釈がありません。ソース値は、割り当てられているターゲットの場所で宣言されているものと少なくとも同じ要件を宣言する必要があります。
ko: '{0}' 제네릭 인수가 '{1}'에서 {4}을(를) 충족하지 않습니다. '{3}'의 제네릭 매개 변수 '{2}'에 일치하는 주석이 없습니다. 원본 값은 할당된 대상 위치에서 선언된 요구 사항과 최소한 동일한 요구 사항을 선언해야 합니다.
pl: Argument ogólny „{0}” nie spełnia wymagań {4} w wywołaniu „{1}”. Parametr ogólny „{2}” metody „{3}” nie ma pasujących adnotacji. Wartość źródłowa musi deklarować co najmniej te same wymagania, które zadeklarowano w lokalizacji docelowej, do której jest przypisana.
pt_br: O argumento genérico ‘{0}’ não atende {4} em ‘{1}’. O parâmetro genérico ‘{2}’ de ‘{3}’ não tem anotações correspondentes. O valor da fonte deve declarar pelo menos os mesmos requisitos que os declarados no local de destino para o qual foi atribuído.
ru: Универсальный аргумент "{0}" не удовлетворяет {4} в "{1}". Универсальный параметр "{2}" из "{3}" не имеет соответствующих аннотаций. Исходное значение должно объявлять по крайней мере те же требования, что и требования, объявленные в целевом расположении, которому оно назначено.
tr: '{0}' genel bağımsız değişkeni, '{1}' içinde şunu karşılamıyor: {4}. '{3}' yönteminin '{2}' genel parametresinde eşleşen ek açıklamalar yok. Kaynak değerin, atandığı hedef konumda bildirilenlerle en az aynı gereksinimleri bildirmesi gerekir.
zh_hans: "{0}" 泛型参数不满足 "{1}" 中的 {4}。"{3}" 的泛型参数 "{2}" 没有匹配的注释。源值必须声明至少与在分配到的目标位置上声明的要求相同的要求。
zh_hant: '{0}' 泛型引數不符合 '{1}' 中的 {4}。'{3}' 的泛型參數 '{2}' 沒有相符的註釋。來源值必須至少宣告與其獲指派目標位置上所宣告相同的需求。

# IL2103
source: Value passed to the '{0}' parameter of method '{1}' cannot be statically determined as a property accessor.
cs: Hodnotu předanou parametru {0} metody {1} nelze staticky určit jako přístupový objekt vlastnosti.
es: El valor pasado al parámetro "{0}" del método "{1}" no se puede determinar estáticamente como descriptor de acceso de propiedades.
fr: La valeur transmise au paramètre '{0}' de la méthode '{1}' ne peut pas être déterminée statiquement en tant qu’accesseur de propriété.
it: Il valore passato al parametro '{0}' del metodo '{1}' non può essere determinato statisticamente come funzione di accesso alle proprietà.
ja: メソッド '{1}' の'{0}' パラメーターに渡された値は、プロパティ アクセサーとして静的に決定できません。
ko: 메서드 '{1}'의 '{0}' 매개 변수에 전달된 값은 속성 접근자로 정적으로 확인할 수 없습니다.
pl: Nie można statycznie określić wartości przekazanej do parametru „{0}” metody „{1}” jako metody dostępu do właściwości.
pt_br: O valor passado para o parâmetro '{0}' do método '{1}' não pode ser determinado estaticamente como um acessador de propriedade.
ru: Значение, переданное в параметр "{0}" метода, "{1}" не может быть статически определено как метод доступа к свойству.
tr: '{1}' yönteminin '{0}' parametresine geçirilen değer statik bir şekilde özellik erişimcisi olarak belirlenemiyor.
zh_hans: 传递给方法 "{1}" 的 "{0}" 参数的值无法静态确定为属性访问器。
zh_hant: 無法將傳遞至方法 '{1}' 的 '{0}' 參數的值靜態判斷為屬性存取子。
