Repository: dotnet/runtime
Catalog: src/tools/illink/src/linker/Resources/xlf/Strings.*.xlf
Languages: cs, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# IL2082
source: '{0}' argument does not satisfy {3} in call to '{1}'. The implicit 'this' argument of method '{2}' does not have matching annotations. The source value must declare at least the same requirements as those declared on the target location it is assigned to.
cs: Argument {0} nevyhovuje {3} ve volání metody {1}. Implicitní argument this metody {2} nemá odpovídající poznámky. Zdrojová hodnota musí deklarovat alespoň stejné požadavky jako požadavky deklarované v cílovém umístění, ke které je přiřazena.
es: El argumento "{0}" no satisface {3} en la llamada a "{1}". El argumento "this" implícito del método "{2}" no tiene anotaciones coincidentes. El valor de origen debe declarar al menos los mismos requisitos que los declarados en la ubicación de destino a la que está asignado.
fr: L’argument '{0}' ne respecte pas {3} dans l’appel à '{1}'. L’argument implicite 'this' de la méthode '{2}' n’a pas d’annotations correspondantes. La valeur source doit déclarer au moins les mêmes exigences que celles déclarées sur l’emplacement cible auquel elle est attribuée.
it: L'argomento '{0}' non soddisfa {3} nella chiamata al '{1}'. L'argomento implicito 'this' del metodo '{2}' non contiene annotazioni corrispondenti. Il valore di origine deve dichiarare almeno gli stessi requisiti dichiarati nel percorso di destinazione a cui è assegnato.
ja: '{0}' 引数が '{1}' への呼び出しの {3} を満たしていません。メソッド '{2}' の暗黙な 'this' 引数に一致する注釈がありません。ソース値は、割り当てられているターゲットの場所で宣言されているものと少なくとも同じ要件を宣言する必要があります。
ko: '{0}' 인수가 '{1}'에 대한 호출에서 {3}을(를) 충족하지 않습니다. 메서드 '{2}'의 암시적 'this' 인수에 일치하는 주석이 없습니다. 원본 값은 할당된 대상 위치에서 선언된 요구 사항과 최소한 동일한 요구 사항을 선언해야 합니다.
pl: Argument „{0}” nie spełnia wymagań {3} w wywołaniu „{1}”. Parametr niejawny „this” metody „{2}” nie ma pasujących adnotacji. Wartość źródłowa musi deklarować co najmniej te same wymagania, które zadeklarowano w lokalizacji docelowej, do której jest przypisana.
pt_br: O argumento ‘{0}’ não atende {3} em chamada para ‘{1}’. O argumento ‘this’ implícito do método ‘{2}’ não tem anotações correspondentes. O valor da fonte deve declarar pelo menos os mesmos requisitos que os declarados no local de destino para o qual foi atribuído.
ru: Аргумент "{0}" не удовлетворяет {3} в вызове "{1}". Неявный аргумент "this" метода "{2}" не имеет соответствующих аннотаций. Исходное значение должно объявлять по крайней мере те же требования, что и требования, объявленные в целевом расположении, которому оно назначено.
tr: '{0}' bağımsız değişkeni, '{1}' çağrısında şunu karşılamıyor: {3}. '{2}' yönteminin örtük 'this' bağımsız değişkeninde eşleşen ek açıklamalar yok. Kaynak değerin, atandığı hedef konumda bildirilenlerle en az aynı gereksinimleri bildirmesi gerekir.
zh_hans: "{0}" 参数在调用 "{1}" 时不满足 {3}。方法 "{2}" 的隐式 "this" 参数没有匹配的注释。源值必须声明至少与在分配到的目标位置上声明的要求相同的要求。
zh_hant: '{0}' 引數在對 '{1}' 的呼叫中未滿足 {3}。方法 '{2}' 的隱含 'this' 引數沒有相符的註釋。來源值必須至少宣告與其獲指派目標位置上所宣告相同的需求。

# IL2083
source: '{0}' method return value does not satisfy {2} requirements. The implicit 'this' argument of method '{1}' does not have matching annotations. The source value must declare at least the same requirements as those declared on the target location it is assigned to.
cs: Návratová hodnota metody {0} nesplňuje požadavky {2}. Implicitní argument this metody {1} nemá odpovídající poznámky. Zdrojová hodnota musí deklarovat alespoň stejné požadavky jako požadavky deklarované v cílovém umístění, ke které je přiřazena.
es: El valor devuelto del método "{0}" no cumple los requisitos de {2}. El argumento "this" implícito del método "{1}" no tiene anotaciones coincidentes. El valor de origen debe declarar al menos los mismos requisitos que los declarados en la ubicación de destino a la que está asignado.
fr: La valeur renvoyée par la méthode '{0}' ne répond pas aux exigences de {2}. L’argument implicite 'this' de la méthode '{1}' n’a pas d’annotations correspondantes. La valeur source doit déclarer au moins les mêmes exigences que celles déclarées sur l’emplacement cible auquel elle est attribuée.
it: Il valore restituito del metodo '{0}' non soddisfa i requisiti {2}. L'argomento implicito 'this' del metodo '{1}' non contiene annotazioni corrispondenti. Il valore di origine deve dichiarare almeno gli stessi requisiti dichiarati nel percorso di destinazione a cui è assegnato.
ja: '{0}' メソッドの戻り値は {2} の要件を満たしていません。メソッド '{1}' の暗黙な 'this' 引数に一致する注釈がありません。ソース値は、割り当てられているターゲットの場所で宣言されているものと少なくとも同じ要件を宣言する必要があります。
ko: '{0}' 메서드 반환 값이 {2} 요구 사항을 충족하지 않습니다. 메서드 '{1}'의 암시적 'this' 인수에 일치하는 주석이 없습니다. 원본 값은 할당된 대상 위치에서 선언된 요구 사항과 최소한 동일한 요구 사항을 선언해야 합니다.
pl: Wartość zwracana metody „{0}” nie spełnia wymagań {2}. Niejawny argument „this” metody „{1}” nie ma pasujących adnotacji. Wartość źródłowa musi deklarować co najmniej te same wymagania, które zadeklarowano w lokalizacji docelowej, do której jest przypisana.
pt_br: O valor retornado do método ‘{0}’ não atende os requisitos de {2}. O argumento ‘this’ implícito do método ‘{1}’ não tem anotações correspondentes. O valor da fonte deve declarar pelo menos os mesmos requisitos que os declarados no local de destino para o qual foi atribuído.
ru: Возвращаемое значение метода "{0}" не удовлетворяет {2} требованиям. Неявный аргумент "this" метода "{1}" не имеет соответствующих аннотаций. Исходное значение должно объявлять по крайней мере те же требования, что и требования, объявленные в целевом расположении, которому оно назначено.
tr: '{0}' yöntemi dönüş değeri, {2} gereksinimlerini karşılamıyor. '{1}' yönteminin örtük 'this' bağımsız değişkeninde eşleşen ek açıklamalar yok. Kaynak değerin, atandığı hedef konumda bildirilenlerle en az aynı gereksinimleri bildirmesi gerekir.
zh_hans: ''{0}" 方法返回值不满足 {2} 要求。方法 "{1}" 的隐式参数没有匹配的批注。源值必须声明至少与在分配到的目标位置上声明的要求相同的要求。
zh_hant: '{0}' 方法傳回值不符合 {2} 需求。方法 '{1}' 的隱含 'this' 引數沒有相符的註釋。來源值必須至少宣告與其獲指派目標位置上所宣告相同的需求。

# IL2084
source: value stored in field '{0}' does not satisfy {2} requirements. The implicit 'this' argument of method '{1}' does not have matching annotations. The source value must declare at least the same requirements as those declared on the target location it is assigned to.
cs: Hodnota uložená v poli {0} nesplňuje požadavky {2}. Implicitní argument this metody {1} nemá odpovídající poznámky. Zdrojová hodnota musí deklarovat alespoň stejné požadavky jako požadavky deklarované v cílovém umístění, ke které je přiřazena.
es: El valor almacenado en el campo "{0}" no satisface los requisitos de {2}. El argumento "this" implícito del método "{1}" no tiene anotaciones coincidentes. El valor de origen debe declarar al menos los mismos requisitos que los declarados en la ubicación de destino a la que está asignado.
fr: La valeur stockée dans le champ '{0}' ne répond pas aux exigences de {2}. L’argument implicite 'this' de la méthode '{1}' n’a pas d’annotations correspondantes. La valeur source doit déclarer au moins les mêmes exigences que celles déclarées sur l’emplacement cible auquel elle est attribuée.
it: il valore archiviato nel campo '{0}' non soddisfa i requisiti {2}. L'argomento implicito 'this' del metodo '{1}' non contiene annotazioni corrispondenti. Il valore di origine deve dichiarare almeno gli stessi requisiti dichiarati nel percorso di destinazione a cui è assegnato.
ja: フィールド '{0}' に保存された値は {2} の要件を満たしていません。メソッド '{1}' の暗黙な 'this' 引数に一致する注釈がありません。ソース値は、割り当てられているターゲットの場所で宣言されているものと少なくとも同じ要件を宣言する必要があります。
ko: 필드 '{0}'에 저장된 값이 {2} 요구 사항을 충족하지 않습니다. 메서드 '{1}'의 암시적 'this' 인수에 일치하는 주석이 없습니다. 원본 값은 할당된 대상 위치에서 선언된 요구 사항과 최소한 동일한 요구 사항을 선언해야 합니다.
pl: Wartość przechowywana w polu „{0}” nie spełnia wymagań {2}. Niejawny argument „this” metody „{1}” nie ma pasujących adnotacji. Wartość źródłowa musi deklarować co najmniej te same wymagania, które zadeklarowano w lokalizacji docelowej, do której jest przypisana.
pt_br: O valor armazenado no campo ‘{0}’ não atende os requisitos de {2}. O argumento ‘this’ implícito do método ‘{1}’ não tem anotações correspondentes. O valor da fonte deve declarar pelo menos os mesmos requisitos que os declarados no local de destino para o qual foi atribuído.
ru: значение, хранящееся в поле "{0}" не удовлетворяет {2} требованиям. Неявный аргумент "this" метода "{1}" не имеет соответствующих аннотаций. Исходное значение должно объявлять по крайней мере те же требования, что и требования, объявленные в целевом расположении, которому оно назначено.
tr: '{0}' alanında depolanan değer, {2} gereksinimlerini karşılamıyor. '{1}' yönteminin örtük 'this' bağımsız değişkeninde eşleşen ek açıklamalar yok. Kaynak değerin, atandığı hedef konumda bildirilenlerle en az aynı gereksinimleri bildirmesi gerekir.
zh_hans: 字段''{0}" 中存储的值不满足 {2} 要求。方法 "{1}" 的隐式参数没有匹配的批注。源值必须声明至少与在分配到的目标位置上声明的要求相同的要求。
zh_hant: 儲存在欄位 '{0}' 中的值未滿足 {2} 需求。方法 '{1}' 的隱含 'this' 引數沒有相符的註釋。來源值必須至少宣告與其獲指派目標位置上所宣告相同的需求。

# IL2085
source: 'this' argument does not satisfy {2} in call to '{0}'. The implicit 'this' argument of method '{1}' does not have matching annotations. The source value must declare at least the same requirements as those declared on the target location it is assigned to.
cs: Argument this nevyhovuje {2} ve volání metody {0}. Implicitní argument this metody {1} nemá odpovídající poznámky. Zdrojová hodnota musí deklarovat alespoň stejné požadavky jako požadavky deklarované v cílovém umístění, ke které je přiřazena.
es: El argumento "this" no satisface {2} en la llamada a "{0}". El argumento "this" implícito del método "{1}" no tiene anotaciones coincidentes. El valor de origen debe declarar al menos los mismos requisitos que los declarados en la ubicación de destino a la que está asignado.
fr: L’argument 'this' ne respecte pas '{2}' dans l’appel à '{0}'. L’argument implicite 'this' de la méthode '{1}' n’a pas d’annotations correspondantes. La valeur source doit déclarer au moins les mêmes exigences que celles déclarées sur l’emplacement cible auquel elle est attribuée.
it: L'argomento 'this' non soddisfa {2} nella chiamata al '{0}'. L'argomento implicito 'this' del metodo '{1}' non contiene annotazioni corrispondenti. Il valore di origine deve dichiarare almeno gli stessi requisiti dichiarati nel percorso di destinazione a cui è assegnato.
ja: 'this' 引数が '{0}' への呼び出しの {2} を満たしていません。メソッド '{1}' の暗黙な 'this' 引数に一致する注釈がありません。ソース値は、割り当てられているターゲットの場所で宣言されているものと少なくとも同じ要件を宣言する必要があります。
ko: 'this' 인수가 '{0}'에 대한 호출에서 {2}을(를) 충족하지 않습니다. 메서드 '{1}'의 암시적 'this' 인수에 일치하는 주석이 없습니다. 원본 값은 할당된 대상 위치에서 선언된 요구 사항과 최소한 동일한 요구 사항을 선언해야 합니다.
pl: Argument „this” nie spełnia wymagań {2} w wywołaniu „{0}”. Parametr niejawny „this” metody „{1}” nie ma pasujących adnotacji. Wartość źródłowa musi deklarować co najmniej te same wymagania, które zadeklarowano w lokalizacji docelowej, do której jest przypisana.
pt_br: O argumento ‘this’ não atende {2} em chamada para ‘{0}’. O argumento implícito do método ‘{1}’ não tem anotações correspondentes. O valor da fonte deve declarar pelo menos os mesmos requisitos que os declarados no local de destino para o qual foi atribuído.
ru: Аргумент "this" не удовлетворяет {2} в вызове "{0}". Неявный аргумент "this" метода "{1}" не имеет соответствующих аннотаций. Исходное значение должно объявлять по крайней мере те же требования, что и требования, объявленные в целевом расположении, которому оно назначено.
tr: 'this' bağımsız değişkeni, '{0}' çağrısında şunu karşılamıyor: {2}. '{1}' yönteminin örtük 'this' bağımsız değişkeninde eşleşen ek açıklamalar yok. Kaynak değerin, atandığı hedef konumda bildirilenlerle en az aynı gereksinimleri bildirmesi gerekir.
zh_hans: "this" 参数在调用 "{0}" 时不满足 {2}。方法 "{1}" 的隐式 "this" 参数没有匹配的注释。源值必须声明至少与在分配到的目标位置上声明的要求相同的要求。
zh_hant: 'this' 引數在對 '{0}' 的呼叫中未滿足 {2}。方法 '{1}' 的隱含 'this' 引數沒有相符的註釋。來源值必須至少宣告與其獲指派目標位置上所宣告相同的需求。

# IL2086
source: '{0}' generic argument does not satisfy {3} in '{1}'. The implicit 'this' argument of method '{2}' does not have matching annotations. The source value must declare at least the same requirements as those declared on the target location it is assigned to.
cs: Obecný argument {0} nevyhovuje {3} v: {1}. Implicitní argument this metody {2} nemá odpovídající poznámky. Zdrojová hodnota musí deklarovat alespoň stejné požadavky jako požadavky deklarované v cílovém umístění, ke které je přiřazena.
es: El argumento genérico "{0}" no satisface {3} en "{1}". El argumento "this" implícito del método "{2}" no tiene anotaciones coincidentes. El valor de origen debe declarar al menos los mismos requisitos que los declarados en la ubicación de destino a la que está asignado.
fr: L’argument générique '{0}' ne respecte pas {3} dans '{1}'. L’argument implicite 'this' de la méthode '{2}' n’a pas d’annotations correspondantes. La valeur source doit déclarer au moins les mêmes exigences que celles déclarées sur l’emplacement cible auquel elle est attribuée.
it: L’argomento generico '{0}' non soddisfa {3} in '{1}'. L'argomento implicito 'this' del metodo '{2}' non contiene annotazioni corrispondenti. Il valore di origine deve dichiarare almeno gli stessi requisiti dichiarati nel percorso di destinazione a cui è assegnato.
ja: '{0}' ジェネリック引数が '{1}' の {3} を満たしていません。メソッド '{2}' の暗黙な 'this' 引数に一致する注釈がありません。ソース値は、割り当てられているターゲットの場所で宣言されているものと少なくとも同じ要件を宣言する必要があります。
ko: '{0}' 제네릭 인수가 '{1}'에서 {3}을(를) 충족하지 않습니다. 메서드 '{2}'의 암시적 'this' 인수에 일치하는 주석이 없습니다. 원본 값은 할당된 대상 위치에서 선언된 요구 사항과 최소한 동일한 요구 사항을 선언해야 합니다.
pl: Argument ogólny „{0}” nie spełnia wymagań {3} w wywołaniu „{1}”. Parametr niejawny „this” metody „{2}” nie ma pasujących adnotacji. Wartość źródłowa musi deklarować co najmniej te same wymagania, które zadeklarowano w lokalizacji docelowej, do której jest przypisana.
pt_br: O argumento genérico ‘{0}’ não atende {3} em ‘{1}’. O argumento ‘this’ implícito do método ‘{2}’ não tem anotações correspondentes. O valor da fonte deve declarar pelo menos os mesmos requisitos que os declarados no local de destino para o qual foi atribuído.
ru: Универсальный аргумент "{0}" не удовлетворяет {3} в "{1}". Неявный аргумент "this" метода "{2}" не имеет соответствующих аннотаций. Исходное значение должно объявлять по крайней мере те же требования, что и требования, объявленные в целевом расположении, которому оно назначено.
tr: '{0}' genel bağımsız değişkeni, '{1}' içinde şunu karşılamıyor: {3}. '{2}' yönteminin örtük 'this' bağımsız değişkeninde eşleşen ek açıklamalar yok. Kaynak değerin, atandığı hedef konumda bildirilenlerle en az aynı gereksinimleri bildirmesi gerekir.
zh_hans: "{0}" 泛型参数不满足 "{1}" 中的 {3}。方法 "{2}" 的隐式 "this" 参数没有匹配的注释。源值必须声明至少与在分配到的目标位置上声明的要求相同的要求。
zh_hant: '{0}' 泛型引數不符合 '{1}' 中的 {3}。方法 '{2}' 的隱含 'this' 引數沒有相符的註釋。來源值必須至少宣告與其獲指派目標位置上所宣告相同的需求。

# IL2087
source: '{0}' argument does not satisfy {4} in call to '{1}'. The generic parameter '{2}' of '{3}' does not have matching annotations. The source value must declare at least the same requirements as those declared on the target location it is assigned to.
cs: Argument {0} nevyhovuje: {4} ve volání metody {1}. Obecný parametr {2} třídy {3} nemá odpovídající poznámky. Zdrojová hodnota musí deklarovat alespoň stejné požadavky jako požadavky deklarované v cílovém umístění, ke které je přiřazena.
es: El argumento "{0}" no satisface {4} en la llamada a "{1}". El parámetro genérico "{2}" de "{3}" no tiene anotaciones coincidentes. El valor de origen debe declarar al menos los mismos requisitos que los declarados en la ubicación de destino a la que está asignado.
fr: L’argument '{0}' ne respecte pas {4} dans l’appel à '{1}'. Le paramètre générique '{2}' de '{3}' n’a pas d’annotations correspondantes. La valeur source doit déclarer au moins les mêmes exigences que celles déclarées sur l’emplacement cible auquel elle est attribuée.
it: L'argomento '{0}' non soddisfa {4} nella chiamata al '{1}'. Il parametro generico '{2}' di '{3}' non contiene annotazioni corrispondenti. Il valore di origine deve dichiarare almeno gli stessi requisiti dichiarati nel percorso di destinazione a cui è assegnato.
ja: '{0}' 引数が '{1}' への呼び出しの {4} を満たしていません。'{3}' のジェネリック パラメーター '{2}' に一致する注釈がありません。ソース値は、割り当てられているターゲットの場所で宣言されているものと少なくとも同じ要件を宣言する必要があります。
ko: '{0}' 인수가 '{1}'에 대한 호출에서 {4}을(를) 충족하지 않습니다. '{3}'의 제네릭 매개 변수 '{2}'에 일치하는 주석이 없습니다. 원본 값은 할당된 대상 위치에서 선언된 요구 사항과 최소한 동일한 요구 사항을 선언해야 합니다.
pl: Argument „{0}” nie spełnia wymagań {4} w wywołaniu „{1}”. Parametr ogólny „{2}” metody „{3}” nie ma pasujących adnotacji. Wartość źródłowa musi deklarować co najmniej te same wymagania, które zadeklarowano w lokalizacji docelowej, do której jest przypisana.
pt_br: O argumento ‘{0}’ não atende {4} em chamada para ‘{1}’. O parâmetro genérico ‘{2}’ de ‘{3}’ não tem anotações correspondentes. O valor da fonte deve declarar pelo menos os mesmos requisitos que os declarados no local de destino para o qual foi atribuído.
ru: Аргумент "{0}" не удовлетворяет {4} в вызове "{1}". Универсальный параметр "{2}" из "{3}" не имеет соответствующих аннотаций. Исходное значение должно объявлять по крайней мере те же требования, что и требования, объявленные в целевом расположении, которому оно назначено.
tr: '{0}' bağımsız değişkeni, '{1}' çağrısında şunu karşılamıyor: {4}. '{3}' yönteminin '{2}' genel parametresinde eşleşen ek açıklamalar yok. Kaynak değerin, atandığı hedef konumda bildirilenlerle en az aynı gereksinimleri bildirmesi gerekir.
zh_hans: "{0}" 参数在调用 "{1}" 时不满足 {4}。"{3}" 的泛型参数 "{2}" 没有匹配的注释。源值必须声明至少与在分配到的目标位置上声明的要求相同的要求。
zh_hant: '{0}' 引數在對 '{1}' 的呼叫中未滿足 {4}。'{3}' 的泛型參數 '{2}' 沒有相符的註釋。來源值必須至少宣告與其獲指派目標位置上所宣告相同的需求。

# IL2088
source: '{0}' method return value does not satisfy {3} requirements. The generic parameter '{1}' of '{2}' does not have matching annotations. The source value must declare at least the same requirements as those declared on the target location it is assigned to.
cs: Návratová hodnota metody {0} nesplňuje požadavky {3}. Obecný parametr {1} pro {2} nemá odpovídající poznámky. Zdrojová hodnota musí deklarovat alespoň stejné požadavky jako požadavky deklarované v cílovém umístění, ke které je přiřazena.
es: El valor devuelto del método "{0}" no cumple los requisitos de {3}. El parámetro genérico "{1}" de "{2}" no tiene anotaciones coincidentes. El valor de origen debe declarar al menos los mismos requisitos que los declarados en la ubicación de destino a la que está asignado.
fr: La valeur renvoyée par la méthode '{0}' ne répond pas aux exigences de {3}. Le paramètre générique '{1}' de '{2}' n’a pas d’annotations correspondantes. La valeur source doit déclarer au moins les mêmes exigences que celles déclarées sur l’emplacement cible auquel elle est attribuée.
it: Il valore restituito del metodo '{0}' non soddisfa i requisiti {3}. Il parametro generico '{1}' di '{2}' non contiene annotazioni corrispondenti. Il valore di origine deve dichiarare almeno gli stessi requisiti dichiarati nel percorso di destinazione a cui è assegnato.
ja: '{0}' メソッドの戻り値は {3} の要件を満たしていません。'{2}' のジェネリック パラメーター '{1}' に一致する注釈がありません。ソース値は、割り当てられているターゲットの場所で宣言されているものと少なくとも同じ要件を宣言する必要があります。
ko: '{0}' 메서드 반환 값이 {3} 요구 사항을 충족하지 않습니다. '{2}'의 제네릭 매개 변수 '{1}'에 일치하는 주석이 없습니다. 원본 값은 할당된 대상 위치에서 선언된 요구 사항과 최소한 동일한 요구 사항을 선언해야 합니다.
pl: Wartość zwracana metody „{0}” nie spełnia wymagań {3}. Parametr ogólny „{1}” metody „{2}” nie ma pasujących adnotacji. Wartość źródłowa musi deklarować co najmniej te same wymagania, które zadeklarowano w lokalizacji docelowej, do której jest przypisana.
pt_br: O valor retornado do método ‘{0}’ não atende os requisitos de {3}. O parâmetro genérico ‘{1}’ de ‘{2}’ não tem anotações correspondentes. O valor da fonte deve declarar pelo menos os mesmos requisitos que os declarados no local de destino para o qual foi atribuído.
ru: Возвращаемое значение метода "{0}" не удовлетворяет {3} требованиям. Универсальный параметр "{1}" из "{2}" не имеет соответствующих аннотаций. Исходное значение должно объявлять по крайней мере те же требования, что и требования, объявленные в целевом расположении, которому оно назначено.
tr: '{0}' yöntemi dönüş değeri, {3} gereksinimlerini karşılamıyor. '{2}' yönteminin '{1}' genel parametresinde eşleşen ek açıklamalar yok. Kaynak değerin, atandığı hedef konumda bildirilenlerle en az aynı gereksinimleri bildirmesi gerekir.
zh_hans: "{0}" 方法返回值不满足 {3} 要求。"{1}" 的泛型参数 "{2}" 没有匹配的批注。源值必须声明至少与在分配到的目标位置上声明的要求相同的要求。
zh_hant: '{0}' 方法傳回值不符合 {3} 需求。'{2}' 的泛型參數 '{1}' 沒有相符的註釋。來源值必須至少宣告與其獲指派目標位置上所宣告相同的需求。

# IL2089
source: value stored in field '{0}' does not satisfy {3} requirements. The generic parameter '{1}' of '{2}' does not have matching annotations. The source value must declare at least the same requirements as those declared on the target location it is assigned to.
cs: Hodnota uložená v poli {0} nesplňuje požadavky {3}. Obecný parametr {1} pro {2} nemá odpovídající poznámky. Zdrojová hodnota musí deklarovat alespoň stejné požadavky jako požadavky deklarované v cílovém umístění, ke které je přiřazena.
es: El valor almacenado en el campo "{0}" no satisface los requisitos de {3}. El parámetro genérico "{1}" de "{2}" no tiene anotaciones coincidentes. El valor de origen debe declarar al menos los mismos requisitos que los declarados en la ubicación de destino a la que está asignado.
fr: La valeur stockée dans le champ '{0}' ne répond pas aux exigences de {3}. Le paramètre générique '{1}' de '{2}' n’a pas d’annotations correspondantes. La valeur source doit déclarer au moins les mêmes exigences que celles déclarées sur l’emplacement cible auquel elle est attribuée.
it: il valore archiviato nel campo '{0}' non soddisfa i requisiti {3}. Il parametro generico '{1}' di '{2}' non contiene annotazioni corrispondenti. Il valore di origine deve dichiarare almeno gli stessi requisiti dichiarati nel percorso di destinazione a cui è assegnato.
ja: フィールド '{0}' に保存された値は {3} の要件を満たしていません。'{2}' のジェネリック パラメーター '{1}' に一致する注釈がありません。ソース値は、割り当てられているターゲットの場所で宣言されているものと少なくとも同じ要件を宣言する必要があります。
ko: 필드 '{0}'에 저장된 값이 {3} 요구 사항을 충족하지 않습니다. '{2}'의 제네릭 매개 변수 '{1}'에 일치하는 주석이 없습니다. 원본 값은 할당된 대상 위치에서 선언된 요구 사항과 최소한 동일한 요구 사항을 선언해야 합니다.
pl: Wartość przechowywana w polu „{0}” nie spełnia wymagań {3}. Parametr ogólny „{1}” metody „{2}” nie ma pasujących adnotacji. Wartość źródłowa musi deklarować co najmniej te same wymagania, które zadeklarowano w lokalizacji docelowej, do której jest przypisana.
pt_br: O valor armazenado no campo ‘{0}’ não atende os requisitos de {3}. O parâmetro genérico ‘{1}’ de ‘{2}’ não tem anotações correspondentes. O valor da fonte deve declarar pelo menos os mesmos requisitos que os declarados no local de destino para o qual foi atribuído.
ru: значение, хранящееся в поле "{0}" не удовлетворяет {3} требованиям. Универсальный параметр "{1}" из "{2}" не имеет соответствующих аннотаций. Исходное значение должно объявлять по крайней мере те же требования, что и требования, объявленные в целевом расположении, которому оно назначено.
tr: '{0}' alanında depolanan değer, {3} gereksinimlerini karşılamıyor. '{2}' yönteminin '{1}' genel parametresinde eşleşen ek açıklamalar yok. Kaynak değerin, atandığı hedef konumda bildirilenlerle en az aynı gereksinimleri bildirmesi gerekir.
zh_hans: 存储在字段 "{0}" 中的值不满足 {3} 要求。"{2}" 的泛型参数 "{1}" 没有匹配的批注。源值必须声明至少与在分配到的目标位置上声明的要求相同的要求。
zh_hant: 儲存在欄位 '{0}' 中的值未滿足 {3} 需求。'{2}' 的泛型參數 '{1}' 沒有相符的註釋。來源值必須至少宣告與其獲指派目標位置上所宣告相同的需求。
